package com.otis.company.udfs;

import org.apache.commons.lang3.StringUtils;
import org.apache.flink.table.functions.ScalarFunction;

import java.util.HashMap;

/**
 *  目前的一些问题：
 *  1. 词库中相同有相同的key
 *  2. 分类规则有脏数据
 */
public class SortRuleFunction extends ScalarFunction {
    private static final HashMap<String, String> map = new HashMap<>();

    //在这里把词库加载进去
    static {
        map.put("11100", "外出餐饮,餐饮,餐吧,美食,唐饮街,嘉旺,饭庄,食坊,酒家,饮食,小馆,饭店,菜,酒楼,餐厅,饭馆,酒馆,肉馆,红烧,红焖,炒菜,小炒,食汇");
        map.put("11110", "火锅,海底捞,小肥羊,皇城老妈,德庄,呷哺,刘一手,小尾羊,巴奴毛肚,皇城老妈,新派（上海）");
        map.put("11120", "地方菜,那家小馆,土菜馆,家乡菜,地方菜,地方风味,云南菜,闽菜,北京菜,京味,锅巴菜");
        map.put("11121", "川菜,8号厚厨,麻辣诱惑,串串香,麻辣香锅,冒菜,川人百味,川香,棒棒鸡,巴蜀");
        map.put("11122", "鲁菜,鲁菜,酥肉");
        map.put("11123", "粤菜,粤菜,佛跳墙,油闷大虾,一品豆腐,九转大肠,糖醋鲤鱼,香酥鸡,油爆海螺,四喜丸子,海参肘子,德州扒鸡,爱语阳光");
        map.put("11124", "苏菜,苏菜");
        map.put("11125", "浙菜,浙菜");
        map.put("11126", "豫菜,豫菜");
        map.put("11127", "湘菜,湘菜");
        map.put("11128", "徽菜,徽菜,刀板香,蒸小皖,同庆楼");
        map.put("11129", "东北菜,东北菜,东北家常菜");
        map.put("11131", "日料,日本料理,日料,寿司,和番丼饭,争鲜(上海)食品,泉盛餐饮,食其家,壱番屋,居食屋和民,和民餐饮,吉野家,鳗鳗的爱,和合谷");
        map.put("11149", "汤类,肉汤,羊汤,粉汤,杂碎,杂汤,肉杂,冬瓜汤,砂锅,排骨汤");
        map.put("11132", "泰国餐,泰国菜馆,泰国餐,泰味佳,蕉叶,泰国菜,泰国美食");
        map.put("11140", "小吃快餐,快餐");
        map.put("11141", "早餐,生煎,早餐,粥屋,豆浆,油条,豆腐脑,粥店,早点,手抓饼,小笼包,包子,汤包,锅贴,胡辣汤,锅盔,永和大王,豆汁,蛋堡,肉包,锅魁,肉饼,馅饼,鲜汁包,熏肉大饼,烧麦,肠粉,抛饼,包司令,鲜包,菜包,煎饼,八宝粥,腊八粥,玉米粥,黑米粥,小米粥");
        map.put("11142", "中式快餐,老乡鸡,真功夫,田老师红烧肉,黄焖鸡,拌饭,中式便当,中式快餐,炒饭,扒饭,盖饭,盒饭,西贝,大鸭梨,烤肉拌饭,猪脚饭,猪肘饭,自助快餐,烟台蓝白,卤汁饭,肥牛,肥汁,大米先生,超意兴,唛宜德,捞汁");
        map.put("11143", "炸鸡汉堡,正新鸡排,红得聪餐饮,禾唛,华莱士,炸鸡,汉堡,炸串,最高鸡密,第一炸");
        map.put("11144", "熟食熏酱,熟食,卤肉,肘子,卤煮,培根,泡椒鸡,鸡爪,鸭脖,烤鸭,红烧排骨,腊肉,腊汁,鸭货,泡泡鸡,捞卤,金又文食品,五香,广味,熏肉,卤水,酱肉,热食,鸭爪,缸子肉");
        map.put("11144-1", "熟食品牌,周黑鸭,久久丫,留夫鸭,上海留夫企业,绝味食品,煌上煌,廖记棒棒鸡,六味斋,全聚德,一手店,百味鸡");
        map.put("11145", "西式快餐,乐而美,麦当劳,肯德基,百胜咨询,必胜客,金拱门,汉堡王,环胜电子商务,披萨,快乐星,赛百味,三明治,薯条,华莱士,德克士,乡村基,百胜餐饮");
        map.put("11146", "面食,味千拉面,拉州拉面,巴比,水饺,面馆,馄炖,黯然销魂面,面条,手擀面,泡馍,面点,梅州腌面,炸酱面,拉条,面片,油泼面,炒面,炒饼,牛肉面,板面,炒面,炒饼,拌面,馒头,花卷,烧饼,烩面,面皮,拉面,打卤面,刀削面,茄汁面,小面,沙茶面,沙茶面,龙须面,臊子面,蘸水面,浆水面,荞面,罐罐面,扯面,焖面,蒸面,煎饼,冷面,谷大白,鱼粉面");
        map.put("11147", "特色小吃,凉皮,柠檬鸭,串串,米线,肉蟹煲,烤馕,馕坑,粉丝,凉粉,米粉,花甲,糖葫芦,烤地瓜,烤玉米,沙县小吃,烧汁虾,麻辣拌,酸辣粉,鸭血粉丝,肉夹馍,麻辣烫,板栗,炒栗,脆骨烧,牛肉粉,牛肉丸,淳百味,肉馍,粉之都,鱼粉,糯米糍,凉糕,切糕");
        map.put("11148", "海鲜,海鲜,鲍鱼,龙虾,牡蛎,生蚝,鲍鱼,蛤蜊,大黄鱼,鸦片鱼,多宝鱼,小嘴鱼,海兔,梭子蟹,沙丁鱼,鲳鱼,昌鱼,金枪鱼,夏威夷贝,海螺,海参,小人鲜,花蚬,海汁鲜");
        map.put("11150", "烤肉烧烤,权金城,汉拿山,串吧,赤坂亭,釜山料理,上海盘古餐饮,烤吧,烤羊肉,羊肉串,羊排");
        map.put("11151", "烤鱼,探鱼,炉鱼,烤鱼");
        map.put("11210", "乳制品,温州一鸣食品,九牛私家牧场,伊利,蒙牛,牛奶,酸奶,奶酪,奶皮,乳制品,杀菌乳,调制乳,灭菌乳,牛初乳,乳粉,鲜奶,乳酸菌");
        map.put("11230", "米面粮油,稻谷,小麦,玉米,面粉");
        map.put("11250", "外卖,蜂鸟即配,拉扎斯,趣活美食,锦食送,饭嘻餐饮,配餐,吉食送,拼豆夜宵,拼豆科技,饭来张口,上海益岛,PapaBuffet,小九家,秘觉,熊猫不走,六膳门,专星送,饿了么,弘通科技,美餐");
        map.put("11260", "蛋糕甜点,泡芙,烘焙,甜筒,冰淇淋,蛋糕,蛋挞,西饼,月饼,甜点,面包,点心,甜品,甜食,雪糕,冰棍,冰沙,CAKE,西饼,绿豆饼,提拉米苏,巧克力派,蛋黄派,甜甜圈,绿豆糕,榴莲酥,饼屋,糕点,爆浆,老味糕干");
        map.put("11260-1", "蛋糕甜点品牌,味多美,御品轩,元祖食品,廿一客,贝思客,巴黎贝甜,原麦山丘,好利来,哈根达斯,通用磨坊,诺心,米旗食品,MAKY,克莉丝汀,奥比岛,伯德鸿,85度C,稻香村,巴莉甜甜,鲜芋仙,彩蝶轩,百年义利,百年義利,南洋大师傅");
        map.put("11270", "饮品店,冷饮,蜜雪冰城,,星巴克,书亦烧仙草,快乐番薯,益禾堂,饮品店,奈雪的茶,奈雪の茶,CoCo,1点点,贡茶,果郡王,鲜榨果汁,奶茶,喜茶,水吧,撸加点,果茶,鲜榨,现煮,玉米汁,果汁冰,果乐,纯汁味,半亩茶园,快乐柠檬,一点点,星食茶,鲜果时间,甜啦啦,避风塘,乐乐茶,雅木茶,茶百道,柠檬茶,茶饮,吾饮良品,果呀呀");
        map.put("11310", "零食,零食,薯片,巧克力,干果,果脯,核桃,坚果,松子,榛子,三只松鼠,郝姆斯,良品铺子,绝味食品,食品有限公司,崇云科技,月饼,辣条,豆干,豆制品,蜜饯,海苔,肉松,爆米花,口香糖,老婆饼,泡泡糖,薄荷糖,巧克力,德芙,金丝猴,巴旦木,开心果,棒棒糖,鱿鱼丝,碧根果,南瓜子,牛轧糖,麦芽糖,饼干,薯片,果冻,来伊份,上海清美");
        map.put("11330", "酒水,酒类,酒水,酒小二");
        map.put("11331", "饮用水,苏打水,农夫山泉,矿泉水,矿物质水,纯净水,健康水,净水器");
        map.put("11331", "饮用水,饮用水,纯净水,苏打水,矿泉水,恒大冰泉,农夫山泉,怡宝,净水器,百岁山,雀巢优活,西藏冰川,蒸馏水,水站,水卡,热水,白开水");
        map.put("11332", "饮料,可乐,雪碧,芬达,王老吉,加多宝,和其正,冰红茶,绿茶,凉茶,香飘飘,优乐美,脉动,农夫果园,饮料,汇源果汁,蓝莓汁,沙棘汁,橙汁,椰汁,乐乐茶");
        map.put("11333", "白酒,白酒,茅台,五粮液,汾酒,青稞酒,朗姆酒,威士忌,伏特加,梦之蓝,洋河股份,天之蓝,杜康,江小白,酒厂,酒曲,头曲,酒业,二锅头,闷倒驴");
        map.put("11334", "红酒,红酒,葡萄酒,干红,酒庄,酒窖");
        map.put("11335", "啤酒,啤酒,黑啤,果啤,原汁麦,精酿,扎啤,生啤");
        map.put("12100", "服饰,服饰,服装,衣服,帽子,裤子,牛仔裤,时装,内衣,内裤,服装零售");
        map.put("12100-1", "品牌服饰,优衣库,迅销,海澜之家,飒拉,ZARA,爱思特电子商务,森马,简爱诚品,衣必优,热风,得物,tpminx,丝绸,海恩斯莫里斯,凡人优品");
        map.put("12131", "珠宝首饰,翡翠,钻石,首饰,珠宝,金行,宝石,玛瑙,银饰,玉石,手镯,耳环,戒指,金店");
        map.put("12132", "手表,卡地亚");
        map.put("12220", "美容美发,造型,理发,美容,美体,美发,美甲,脱毛,烫发,染发,离子烫,锡纸烫,佛罗云特,致远创想,形象设计,形体设计,发型设计,减脂,塑形,美瞳,双眼皮,美林美妆");
        map.put("13111", "家用电器,加湿器,电磁炉,饼铛,微波炉,电水壶,电吹风,热水器,空调,电扇,油烟机,换气扇,电视,冰箱,洗衣机,彩电,干衣机,吸尘器,洗碗机,消毒柜,洗碟机,家电,电器");
        map.put("13121", "装修材料,地板,地砖,防盗门,水泥,沙子,油漆,砖厂,大理石,装饰材料,涂料,管业,玻璃厂,瓷砖,灯具,灯泡,节能灯,天花板,建筑陶瓷,吊顶,阻燃板,软装,美缝剂,卫浴,马桶,浴盆,浴缸,坐便,水槽,灭火器,防火板,阻燃板,门窗,板材,闭门器,滑轨,线材,五金,陶瓷制作,建材");
        map.put("13122", "五金工具,螺丝,切割机,角磨机,榔头,电钻,钻头,切割片,木工刀具,铲凿,套筒,钉子,开孔器,锯片,砂轮,切削工具,油漆工具,电线,网线,管材,接头,插座,面板,开关");
        map.put("13131", "日用品,纸巾,抽纸,湿巾,洗衣液,肥皂,香皂,晾衣架,卫生纸,镜子,梳子,口杯,日用,生活用品");
        map.put("13131", "日用品,卫生纸,纸巾,手纸,牙膏,牙刷,毛巾,水杯,日用品,日雑店,沐浴,洗头,洗发");
        map.put("13132", "厨具,豆浆机,榨汁机,电压力锅,电饭锅,铁锅,不锈钢锅,盘子,炉灶,电饭煲,电饭包,厨具,碗筷,筷子,盆,烤箱,燃气灶,果汁机");
        map.put("13220", "水电燃气,国网,水务,自来水,国家电网,供电所,供电局,供电,天然气,燃气,煤气,生活缴费,国电,电力,便民缴费,公共事业类,南方电网,水电");
        map.put("13250", "家政服务,浙江驿栈,家政,保姆,E城E家,美家美邦,爱侬养老,家庭服务,阳光大姐,正祥和,巾帼西丽,小羽佳,华夏中青,沪上阿姨,后勤服务,清洗服务");
        map.put("13251", "洗衣,洗衣,UCC洗衣,干洗,水洗,泰笛");
        map.put("14111", "公交,公交,市民卡,城市通,交通一卡通,琴岛通,交通易,交通运输集团,巴士,交运集团,交通卡,公共交通,红山通,出行南宁,交通科技,微付冲,惠州通,珠海通,黑狗科技,智能交通,智慧交通,乘车码,市民通,交通电子,中交金码");
        map.put("14112", "地铁,深圳通,盛京通,城市通,一卡通,长安通,轨道交通,羊城通,地铁,地下铁道,闪客蜂,天府通,万通顺达,长安通");
        map.put("14121", "网约车,滴滴出行,首汽约车,嘀嗒出行,嘀嘀无限,曹操出行,三秦出行,米图出行,呼我出行,如祺出行,享道出行,长安出行,如一出行,云滴出行,高德打车,万顺叫车,舒行科技,优行科技,快狗打车,UBER,北京畅行,领行科技,顺风车,赛可出行,滴滴商业");
        map.put("14122", "租车,摩捷出行,悠游出行,小桔车服,神州汽车,汽车租赁,租车费,GOUFUN出行");
        map.put("14140", "共享单车,哈啰出行,美团单车,蜜蜂出行,蜜步出行,人民出行,小遛共享,青桔单车,松果出行,喵走出行,柠檬出行,小飞出行,益捷出行,艾特出行,小鱼出行,摩拜,广州骑安,科马出行,小布出行,悟空出行,小彬出行,如易出行,钧正网络科技,云充吧,杭州青奇,锂市民,青桔");
        map.put("14210", "汽车品牌,奔驰,宝马,奥迪沃尔沃,保时捷,路虎,丰田,凯迪拉克,别克,雪铁龙,沃克斯豪尔,欧宝,雷诺,克莱斯勒,JEEP,林肯,吉普,阿尔法罗密欧,庞蒂亚克,林肯,法拉利,菲亚特,阿斯顿马丁");
        map.put("14240", "汽车保养,汽车美,汽车装饰,车务服务,汽车装潢,途虎养车,汽车服务,汽车用品,汽车养护,车饰");
        map.put("14241", "洗车,智链物联,洗车,易自助");
        map.put("14250", "停车,城泊通,捷停车,泊车,停简单,车位,停车云,科拓车场,悦畅科技,慧泊车,停哪儿,人人优泊");
        map.put("14260", "加油费,中国石油,中国石化,中油碧辟,加油站,中石油,石油,能链石化,壳牌石油,加油卡,石化,中化,道达尔,团油,加油费,加油款,中油,第三方油站,加气,易成车车帮");
        map.put("14261", "充电桩,云鸟,充电站,充电桩,特来电,点点畅行,充电平台,来充,充电小斑马,小绿人充电");
        map.put("14280", "过路费,通行宝,速通科技,齐鲁交通,高速通行,联合电服,通渝卡");
        map.put("14410", "火车,快票出行,蒜芽信息科技,游啊游,铁友火车票,中国铁路总公司,,智行,票务服务,上铁实业,畅旅");
        map.put("14430", "长途汽车,长途汽车,客运站,巴士管家,湘约出行,皖美出行,慧慧出行,万家出行,小麦出行,申威出行,安岳出行,骑骑出行,公路客运");
        map.put("14441", "第三方购票--飞机,航班管家,东方友诚,阿斯兰航空服务,航空售票,领航票务");
        map.put("14460", "旅游景点,度假村,景区,旅游区,植物园,动物园,故居,纪念馆,陈列馆,科技馆,博物馆,博物院,寻梦源梦水乡,国色天香,寻梦盛唐,古迹,景点,名胜,故宫,世博园,颐和园,永兴坊,圆明园,泰山票务交通管");
        map.put("14500", "酒店,锦江都城,华住酒店,宾馆,温泉酒店,商务酒店,,首旅如家,汉庭星空,大酒店,铂涛,酒店,格林豪泰,GUESTHOUSE");
        map.put("14500-1", "旅社,旅社,旅馆,招待所");
        map.put("14510", "酒店预订,酒店直达,途家网");
        map.put("14531", "星级酒店,五星级酒店");
        map.put("15110", "话费流量,中国移动,中国联通,中国电信,阿里通信,手拉手电子商务,连连科技,福建移动,充值服务,手机充值,千行你我,广州金康通,卡创科技,君宝科技,易冲宝,移动缴费,联通缴费,电信缴费,固话,座机,联合网络通信,来来网网,固网缴费,恩连科技,连连科技,江山信息技术,凯华东方科技,话费充值,上海畅纳网络科技,,中移在线,菲速充,天音移动,阿里通信,移动通讯费,,手机费");
        map.put("15110-1", "省份,辽宁,吉林,黑龙江,北京,上海,云南,青海,西藏,甘肃,陕西,山西,江苏,内蒙古,深圳,广东,广西,海南,江西,贵州,河南,河北,天津,浙江,安徽,重庆,四川,福建,湖南,湖北,宁夏,新疆,欧飞");
        map.put("15120", "热点,环球漫游,I辽宁,WIFI");
        map.put("16110", "连锁超市,沃尔玛,家乐福,大润发,屈臣氏,苏果超市,鹏翔百货,北国超市,河南大张,新世纪百货,华润万家,华联超市,麦德龙,丹尼斯百货,美特好,华联,丹尼斯大卖场,万德隆商贸,京客隆,百大合家福,人人乐,连锁超,正道思达,华豫佰佳,华润万佳,福伴生活,FAMILYMART,日照日百,家得乐,好又多,世纪联华,东方冷库,利客来,综合超市,苏果生活,万客隆,万家福");
        map.put("16120", "便利店,苏宁小店,便利蜂,同程优鲜,美宜佳,金虎便利,7-ELEVEN,红旗连锁,LAWSON,天福连锁,十足便利,联华快客,唐久超市,全家FamilyMart,苏宁便利,陕西康邦,罗森便利,便利连锁,喜士多,叁陆伍生活通,柒一拾壹,众库,便利连锁,便利店,,7-11(SEB),梦想蜂,广东天福,好客来,UHOME有家,好邻居,山海蓝图,统一银座,赛罕区乌兰察布东路利,,罗森,一团火,新佳宜,芙蓉兴盛,美宜多,汇米巴,函数空间,三寰会有,在楼下,阳光小玛特,百货店");
        map.put("16120-1", "食杂店,副食,食杂,小食店,小卖部,卖品部,杂货店,杂货铺,百货店");
        map.put("16121", "自助售卖,友宝,米源,银海之星,苏州乐美,广州富宏,售货机,自助零售,自助贩卖,自助商店,自助售卖,丰E足食,大黄鹅,湖南兴元科技,贩卖机,宗盛商业,售卖机");
        map.put("16130", "超市便利--生鲜,京东到家,叮咚买菜,佳果多,多点新鲜,永辉生活,谊品到家,辰颐物语,鲜丰水果,朴朴超市,美家买菜,云杉信息,兴盛优选,生鲜,盒马,松鼠拼拼,家家悦,美菜,百果园,兴盛优选,钱大妈,鲜生活,地利生鲜,朴朴电子商务,多点,飞牛集达,食享会,7FRESH,大商鲜生,永辉云创,鲜生,鲜农场,鲜丰邻里,果之友,果唯伊");
        map.put("16200", "商场百货,万达广场,三江购物,东方之珠,购物中心,购物广场,永旺梦乐城,大奥莱,新玛特,万象城,永旺天河城,永旺梦乐城,欧亚卖场,长春欧亚,楽悦坊,百集团,永旺东泰,优MALL,奥特莱斯,大悦城,天街,平和堂");
        map.put("16230", "奢侈品,寺库,奢咖秀,胖虎");
        map.put("16310", "同城速递,同城速运,同城速递,快服务,生活半径,闪送,达达平台,跑腿,货拉拉,同城必应,北京三快科技,上海趣盛,邻趣,即刻送,风先生,极客快送,GKlife,四川创物科技,48同城,曹操送,同城急送,货车帮");
        map.put("16330", "物流,货运,海运,汽运,运输,托运,货站,供应链");
        map.put("16410", "全球购,考拉海购,斑马会员,网银国际购,HQG,全球货架,严选优质,全球精选,跨境购,全球购,有好东西");
        map.put("16420", "网络购物--综合购物,京东商城,京东京造,苏宁易购,唯品会,小V共享,苏宁云商,每日一淘,蘑菇街,1号店,必要,云集,有赞,精选海豚,飞牛网,优惠好货,识货,亚马逊,延边优选,JD,Alibaba,PDD平台商户,放心购,800折,蜂狂购,一淘,国美在线,国美融通,今日卖场,口袋时尚科技,网易严选,顺丰优品,淘宝折扣,京喜,京东商城");
        map.put("16420-1", "网络购物--简称,苏宁,安利(中国),天猫,安利（中国）,贝店,京东,淘宝");
        map.put("16430", "网络购物--社交购物,拼便宜,魔筷星选,京喜,十荟团,拼多多,晨钟科技,群接龙,微店,快乐拼,萌推,上海突进网络科技,邻邻壹,叼到家,邻邻团,京东拼购,团购,KK馆,海豚精选,宜品优享,有品信息科技,大庆玖佰街,上海寻梦信息技术,,社区团,名义初品");
        map.put("16600", "二手闲置,转转,八爪鱼,闲鱼");
        map.put("17200", "慈善机构,基金会,公益,慈善,志愿者,社工服务社,残疾人,捐款,母亲水窖,福利基金");
        map.put("17200-1", "慈善捐献,捐款,蚂蚁金服公益,捐赠,捐献,武汉加油,福利基金,母亲水窖");
        map.put("17500", "社交软件,陌陌,探探,土地公,默往,私讯,企业微信,一谈网络科技,比心陪练,重庆通,趣味科技,ZAKER,微梦创科,微博,SOULAPP,陌声,比心APP,陪玩,陪练,伴伴,约玩");
        map.put("18121", "酒吧,疆进酒,foxbar,激情百度,清吧,棒球河谷,胡桃里,慕尼黑1810,MUSEM2,蝗家一号,MIXCLUB,苏格缪斯,肆零肆娱乐,语音");
        map.put("18122", "茶馆,茶馆,茶楼,茶坊,茶舍,茶吧,大杯茶,盖碗茶");
        map.put("18125", "棋牌,麻将,扑克,扎金花,飞行棋,五子棋,围棋,象棋,跳棋,军棋");
        map.put("18126", "桌游,桌游,三国杀,狼人杀,卡坦岛,小小世界,时间守望");
        map.put("18127", "网吧,网吧,网咖,电竞馆,电竞俱乐部,网络休闲,网络会所");
        map.put("18129", "KTV,音乐盒新一城,好乐迪,唱吧麦颂,K歌,卡拉OK,娱乐购,潮歌,银乐迪,快乐迪,量贩");
        map.put("18130", "电影,猫眼,淘票票,格瓦拉生活,IMAX,巨幕,时光网,电影,影院,影城,院线,娱票儿,晨熹多,天宇映艺");
        map.put("18140", "演出赛事,球赛,比赛,演出,演唱会,交响乐,对抗赛,交响乐");
        map.put("18150", "花鸟宠物,鹦鹉,花鸟,宠物,鲜花,波斯猫,牧羊犬,藏獒");
        map.put("18210", "数码产品,手机,电话,数码,电脑,相机,U盘,优盘,MP4,MP3,录音笔,DVD,摄像机,游戏机,摄像头,充电宝,数据线,充电线,华为授,华为线下加盟,电子产品,VIVO,OPPO,小米之家,娱乐设备,switch,小米科技,华为商场,品胜电子,步步高,摩托罗拉,诺基亚,诺亚舟,点读机,平板电脑");
        map.put("18220", "游戏,网易游戏,JJ比赛,交易猫,斗地主,广东天宸,乐元素,瓦力科技,上海聚市,小米游戏,天宸网络,网易,手游,虫家网络,鱼泡泡,红珊瑚,地下城与勇士,剑灵,英雄联盟,明星麻将,eku8com,亿酷棋牌,江苏天瑞网,竞技世界,盛情网络,世熠网络,欢太科技,HEYTAP,VALVE,WEGAME,TAPTAP,代练,网之易,悦趣科技,九游,瓦力网络科技,SMART2PAY,网游,互娱,西山居,王者荣耀,刺激战场,心娱网络,完美世界,中青宝,心游互动,心娱,尚趣玩,游网,欢游,财付通瓦力,游湛科技,亿诺瑞迪,波克捕鱼,捕鱼达人,梦幻西游,大话西游,狼望网络,海盗来了,弘贯网络,娱网,鑫途网络,盛讯达,力港网络,多益网络,超神玩,创神网络,微游,楚天优游,电魂,手盟,顺网科技,大话西游,新游,互动娱乐,智娱,娱玩,玩梦网络,雷霆信息,卷瓜网络");
        map.put("18230", "影视娱乐,快手,爱奇艺,优酷,哔哩哔哩,微播视界,虎牙,云视听极光,银河互联网电视,芒果TV,bilibili,瓯越网视,火山直播,喜马拉雅FM,腾讯视频,百度网讯,抖音,短视频,M站,漫看网络,荔枝APP,上海宽娱,互动娱乐,国广东方,直播,映客,NEWTV极光,极光TV,酷喵,搜狐视频,小视频,短视频,聚好看,字节跳动,微赞,娱乐秀,娱乐科技,TV会员");
        map.put("18231", "音乐,酷狗,网易云音乐,酷我音乐,VV音乐,网易音乐,音乐网,APPLEMUSIC,酷我科技,唱吧,咪咕");
        map.put("18241", "共享充电宝,街电科技,怪兽充电,来电科技,星星充电,咻电共享,美团充电,小电,租电,挚享科技,易冲宝,伊电园,自助充电,搜电科技,易充宝");
        map.put("18250", "手机服务,云上艾珀,AppStore,Apple,云上贵州,小米市场,华为市场,软件市场,华为客服,华为云助手,华为软件技术,苹果软件,ITUNES,手机服务,华为应用");
        map.put("18300", "工艺收藏,工艺品,金币,银币,珍藏,收藏,纪念,工艺美术,工艺设计,深圳元信,珐琅,陶瓷,雕塑,雕像,木雕,石雕,石刻,石狮子,夜光杯");
        map.put("18320", "文玩艺术,玩物得志,微拍堂,知解");
        map.put("18320", "文玩艺术,玩物得志,微拍堂,文玩,古董,艺术品,国画,水彩,书法");
        map.put("18400", "生活服务,美团点评,58同城,美团,大众点评,三快在线,勤兴软件服务,口碑,五八有限公司,壹佰米,生活服务,生活");
        map.put("19000", "教育培训,学而思,摩比网校,粉笔蓝天,新东方,教育科技,教育培训,教育咨询");
        map.put("19100", "购买图书,当当科文,当当网,小红帽网络科技,美信网络技术,书店,书城,书屋,言几又,猫的天空城,钟书阁,西西弗文化传播,二手书,旧书,多抓鱼,图书,世纪卓越");
        map.put("19110", "报刊书籍,报社,报刊,杂志,书籍,月刊,报纸,日报,周刊,故事,报刊");
        map.put("19130", "Kindle,掌阅,汉王,文石信息,ONYX,博阅,艾利和,国文,OBOOK,伟易达,BOOX,翰林,阿帕比,玄霆科技,阿里巴巴文学,启阅科技,掌读,阅读,看书,阅文,吉阅网络");
        map.put("19130", "电子图书,掌中云,玄霆,QQ阅读,起点中文,掌阅,kindle,电子书,电纸书,乐读,阳光书城,手阅,微阅,追书,网林小阅");
        map.put("19220", "家教补习,学而思,猿辅导,作业帮");
        map.put("19230", "在线教育,腾讯课堂,高途课堂,小哈皮学堂,教育科技,网易云课堂");
        map.put("19240", "知识付费,小鹅通,知乎,知识店铺");
        map.put("19320", "艺术器材,彩笔,彩铅,颜料,乐器,小提琴,二胡,美术用品,颜料,水彩,油彩,毛笔,砚台,宣纸,生宣,熟宣,一得阁,国画,油画,美术材料,画材,颜料,琴行,大提琴,黑管,唢呐,电子琴,钢琴,葫芦丝,竖笛,横笛,琵琶,古筝,马头琴,板胡,革胡,艾捷克,京胡,中胡,高胡,大锣,小锣,锣鼓,架子鼓,排鼓");
        map.put("21100", "进货采购,表面处理,石子款,货款,材料款,材料费,采购款,进度款,补货,唛头,板材,线材,液碱,采购,进度款,货架,模具,物料,刀模,存料,衬料,村料,油脂款,工业用,锻造,浆粉,水锤");
        map.put("21100-1", "商家采购平台,瓜瓜农业,运货优选,微革科技,阿里巴巴,微革网络");
        map.put("21200", "种植养殖,种子,肥料,农产品,饲料,鱼苗,猪仔,鸡苗,种植,养殖,生猪,鸭苗,鱼款,捕鱼");
        map.put("21500", "办公租房,分行,支行,厂房,写字楼,酒店,库房,对公,仓库");
        map.put("22400", "商户提现,商户结算,商户清结算,商户资金结算,备付金,支付,商盟商务服务,有限公司备付");
        map.put("31000", "薪资,薪酬,薪资,薪金,工资,年薪,发薪,薪水,双薪,加班,,值班,早班,晚班,夜班,台班费");
        map.put("32000", "奖金绩效,绩效,奖励,年终奖,季度奖,服务奖,预支奖,元旦奖,目标奖,效益奖,计生奖,项目奖,成果奖,文明奖,专项奖,单位奖,津贴,大单奖,奖金,提成,贡献奖,分成,返点,节日费,年终等税后,考核奖,阳光普照,嘉奖,业绩补点,绩点,个人加发,生产奖,安全奖,出勤,全勤,月度奖,全奖,满勤,超额奖,月奖,年奖,年度奖,销售奖,先进奖,现金奖,增收奖,创效奖,保密奖,奖款,拓展奖,达标奖,进步奖,达标奖,优秀奖,大单奖");
        map.put("33000-1", "兼职,兼职,劳务费,稿费,讲课,培训,辅导,课酬,搬运费,软件开发,劳务报酬,晚自习");
        map.put("33000-2", "兼职,家教,补习,补课,代练");
        map.put("36000", "福利补贴,福利,补助,补贴,专家费,返利,过节费,慰问,车补,餐补,年会,奖牌,奖杯,奖品,奖状,高温费,交通补助,荣誉证书");
        map.put("52100", "行外投资--理财,金融,融鑫,钜汇,华德思诺");
        map.put("52410", "P2P,小牛在线,爱投资管,天安金,宜人财富,有道财富");
        map.put("62100", "互联网借贷,两橙科技,春风救急,贼好借,翼龙贷,人人贷,合众e贷,新新贷,微贷,PPmoney,团贷网,达人贷,百金贷,和信贷,你我贷,博金贷,民贷天下,广信贷,道口贷,杉易贷,汇通易贷,拍拍贷,立业贷,e微贷,安心贷,格林易贷,搜易贷,口贷网,爱贷网,草根新贷,互贷网,恒信易贷,汇泉贷,今金贷,珠宝贷,钱贷网,易通贷,连资贷,广州e贷,图腾贷,乾贷网,三信贷,合力贷,惠人贷,温商贷,宜贷网,粤商贷,沃时贷,晋商贷,阿朋贷,宁创贷,银瑞贷,克克贷,云信贷,豫商贷,贷贷巴,小鹅e贷,金开贷,速贷100,宁商e贷,酷融贷,纳米时贷,中通融贷,深速贷,长久贷,小树时代网贷,友贷网,365易贷,龙城易贷,迷你贷,开鑫贷,好借贷,乐乐贷,工程惠贷,易合贷,景金贷,金道贵网贷,快时贷,新一贷,老友贷,e贷51,合互贷,唐人贷,大国贷,汇通贷,宜联易贷,中科鼎贷,春鹏易贷,好又贷,学信贷,易享贷,易天贷,利盈贷,龙商e贷,糖糖贷,巨福易贷,元鑫贷,聚恒贷,晨诺贷,讯贷网,广西东盟贷,善贷,今时贷,民合贷,聚诚贷,百强贷,电网贷,我企贷,快速贷,皖江贷,百纳微贷,欢乐贷,浦捷贷,速发贷,亿富贷,放心e贷,中正易贷,津融贷,全球贷,民民贷,好车贷,合安易贷,招商贷,房易贷,你好贷,融裕贷,信和贷,车易贷,轻易贷,阿凡达e贷,中航生意贷,稳贷网,万商贷,惠金贷,众可贷,抱团贷,浙江车贷网,安信网贷,领先贷,可投可贷,医贷汇,当贷网,橙旗贷,广义贷,芝麻贷,百泉贷,湘金贷,中金贷,快来贷,融信贷,建辉贷,惠信贷,吉成贷,快乐e贷,汇众贷,一站贷,创富贷,安付贷,四联贷,强宏信贷,富通贷,富春贷,众贷,菜牛钱袋,融资贷,友友贷,小平贷,工商贷,鼎信贷,卓安e贷,医购贷,金海贷,甬e贷,简易贷,金钥匙网贷,爱贷金服,e路邑贷,喔喔贷,法汇贷,润阳贷,超人贷,借贷之家,信广立诚贷,众贷汇,飞速贷,拓天速贷,54贷客,迅捷贷,融和贷,互助贷,节节贷,亲亲小贷,陇e贷,宝元贷,新博贷,易e贷,亿宝贷,共赢时贷,乐升易贷,安平贷,元贷通,百财车贷,广州贷,百业贷,黔商贷,车能贷,轻创贷,中融通贷,随心贷,担保贷,速e贷,贷先生,创一贷,稳盈贷,用心贷,连盈贷,贷动中国,德利贷,黑马贷,顺E贷,芝麻e贷,悦车贷,钱口贷,赢金贷,易友贷,粤易贷,联鑫贷,京都贷,百姓贷,搜贷天下,平方贷,万家贷,小微时贷,一城贷,国信贷,壹心贷,闲包贷,通通贷,福金贷,沪金贷,易贷在线,乾融易贷,寻贷网,民爱贷,七安贷,新华久久贷,豆豆分期,大时贷,多好贷,通融易贷,普天贷,信可贷,鲁信宜贷,速银E贷,宿州易贷,西安贷,潞商e贷,家宝贷,天瑞小小贷,网银贷,网贷路,新升贷,好融贷,秦沪贷,一贷添交,和缘融贷,快快贷,微领贷,顺鑫助农贷,炜会贷,鼎天贷,家晓车贷,爱上贷,欣欣贷,酷贷网,首贷通,UU贷,鑫贷天下,易利贷,心意贷,优企贷,前海e贷,绿化贷,企额贷,东方车贷,农信商贷,生意贷,秒贷金融,诚成贷,可信贷,和万贷,信贷通,网汇贷,丰收贷理财,利众e贷,微贷通,申金贷,e贷e禄,捷创贷,五岳贷,民贷网,圆梦易贷,齐鲁恒信贷,宝贷通行网,红海贷,蜜蜂众筹|本地贷,贷兔网,第一房贷,零用贷,海惠贷,智投贷,丰收贷,瑞通贷,银亿通网贷,学好贷,永贷宝,众人贷,诚乾贷,马尚贷,人企贷,吉鑫贷,余易贷,智汇贷,69贷,家园贷,多贷贷,牛气贷,隆泰贷,普e贷,行行贷,兴教贷,斗金贷,麟鑫贷,嘉乐贷,车贷汇,易安贷,金华贷,存贷汇,嘉e贷,为为贷,恩科e贷,银河易贷,开心贷,多宝贷,智富贷,贵州网贷,懒财网贷,爱投易贷,众禧贷,微拍贷,小贷吧,58车贷,亿钱贷,辉煌易贷,迪迪贷,汇商贷,合汇贷,轻松易贷,通宝通贷,中储贷,君融贷,货融贷,柳e贷,飞鱼贷,手贷网,国贷网,唐贷金融超市,国融贷,九坤贷,实实贷,壹禾贷,德成贷,摩根浦捷贷,立马贷,多了口贷,丰益贷,一秒贷,迅隆贷,鑫胜贷,国泰·惠民益贷,苏融贷,海恒e贷,任我贷,脸贷网,融诺微贷,赢贷通,1688易贷,哈哈贷,小钱贷,贷贷兴隆,珠宝平安贷,正能贷,金柜贷,亿人e贷,易贷宝,邦邦贷,富民网贷,十鼎贷,U车贷,车商贷,合盈贷,零钱袋,鑫融贷,长安易贷,e元贷,比亮贷,永顺贷,亿人易贷,成功贷,新薪贷,易极贷,建工E贷,东邦易贷,运盈e贷,安家贷,利好贷,宜民贷,御龙e贷,长吉贷,便利贷,森昊好时贷,123便利贷,产融贷,袋鼠贷,贷你盈,联众贷,COLA贷,京贷金服,借贷云盘,多多贷,实在贷,汇财贷,潜隆贷,科银信贷,乐助贷,莆商贷,介贷网,他项车贷,车邦贷,众信易贷,飞阳易贷,融利贷,民信贷,178网贷,柘家贷,致富贷,萨贝尔贷,塞上贷,全通贷,点贷网,深贷通,徽常易贷,美好时贷,百利贷,满满贷,易路易贷,人人商贷,商易贷,股易贷,乐贷网,兴投贷,玖信贷,金联贷,江西微贷,华众时贷,冠腾贷,好借好贷,豪泰网贷,人文贷,融贷通赢,云钱袋,壹宝贷,阳光黔贷,畅贷网,贷财行,银通贷,速可贷,票据贷,众易贷,OK贷,微易贷,祺天优贷,点钦易贷,望洲易贷,海汇网贷,E融车贷,蚂蚁贷,岩鑫贷,海贷金服,老微贷,利合贷,海享贷,聪贷,好财运网贷,广通贷,贤贤贷,每每贷,博贷网,龙江易贷,渝都贷,亿车贷,帮成贷,钰融贷,汇贷中国,圣豪贷,致盈贷,盈鼎贷,鸿诚贷,花生贷,崇喜e贷,魔方贷,金都e贷,多美贷,管金贷,华南城贷,潮人贷,首机贷,连连贷,睿信贷,有车贷,厚道贷,贷吧,E贝贷,金统贷,招米贷,华赢贷,总财贷,籽微贷,雪莲借贷,鑫钱袋,保澜贷,如德易拍贷,合拍贷,易人贷,粤融贷,金陵贷,贷贷好,e趣钱袋,15贷,好优贷,益投网贷,卓洋易贷,融途e贷,喜来贷,玉器贷,车行贷,车来贷,可易贷,百年贷,e人e贷,天翼贷,宜昌贷,同城人人贷,可乐贷,红牛贷,瑞德微贷,分分贷,千企贷,小蚂蚁微贷,博源e贷,58爱贷,在线贷,民宝贷,小诸葛网贷,新安左右贷,龙贷,有米贷,月月贷,翡翠贷,皖乾商贷,惠龙贷,向日葵贷,种子易贷,企乐贷,平乐贷,贷贷网,融邦贷,贷未来,粮食贷,华涌贷,宝筹贷,全球贷,团团贷,逍遥贷,借贷撮合网,小微易贷,联贷天下,51投融贷,第1车贷,好融e贷,优先贷,奇子贷,玖盈贷,锦宏贷,天天乐贷,乐百贷,家园贷,信他贷,鼠贷金融,易网贷,全民贷,百思贷,e速贷,起点贷,益合贷,易捷贷,苏富贷,帮友贷,三板贷,平联贷,德信贷,赶贷网,易小贷,骑士贷,贵人贷,金网贷,唯信贷,明银贷,钱贷子金融,联合易贷,融易贷,淦源贷,宏骏时贷,创赢易贷,易车速贷,慈E贷,超信贷,冰融贷,融信速贷,金猫微贷,中信e贷,微银贷,最易贷,鲁商贷,808信贷,兴易贷,贷投乐,开开贷,广翼贷,非常易贷,安信聚贷,三分贷,真鑫贷,鑫悦贷,楚易贷,召宝贷,东创贷,中州易贷,诚信贷,莱商贷,阳光e贷,币胜贷,拾财贷,明贷网,宏伟贷,盼贷网,安贷宝,mM贷,朋友贷,贷乐网,小熊贷,我借我贷,邦信贷,恒贷网,亿贷网,吉强贷,中国融信贷,钱钱贷,有人贷,1119贷,珠宝e贷,贴身贷,正事贷,热贷网,宜贷在线,医疗贷,投融贷,熊猫贷,公明贷,百顺贷,银信贷,昌晟易贷,互利贷,电子贷,前海金易贷,易贷金融,盈信贷,武汉贷,宗亲贷,港润信贷,北城贷,贷贷通,板桥贷,不倒翁贷,阳光时贷,1+1贷,民生易贷,妥妥贷,我家贷,雪山贷,可投可贷,海金贷,众和贷,微E贷,微贷在线,优信贷,裕贷网,奕盈贷,一对一贷,宜企贷,京城贷,特付贷,百合贷,禹顺贷,涌金贷,瑞贷通,51如易贷,微信贷,易简贷,卓行信贷,庭好贷,新贷联盟,乐投贷,千店贷,宜贷投,甬商贷,中天易贷,大融小贷,富壹贷,量子贷,心愿贷,好想贷,车e贷,呱呱贷,友投友贷,广融贷,顺顺贷,阳光快贷,玉宝贷,美贷网,钱贷贷,方便贷,盈赢贷,迅贷网,贷贷平安,融投贷,奔宝贷,融佳易贷,合盈网贷,有益贷,鄂商贷,360易贷,多好贷,嘉嘉易贷,万贝贷,金源贷,速贷融创,齐鲁人贷,华辰易贷,温易贷,每天美贷,浙昌贷,当当贷,仁义贷,汇丰贷,钱好贷,达飞贷,九问贷,爱帮贷,天诚贷,信宝贷,Aoao贷,诚壹贷,汇贷天下,帮侬贷,莱诚贷,速车贷,周转贷,黄经贷,学富贷,润通贷,苏州钱袋,安盈贷,旭日贷,新港e贷,云贷网,瑞安贷,小商贷,校园贷,惠车贷,海西贷,益元贷,吉贷网,浙商e贷,粒粒贷,联合贷,彩讯贷,厦门贷,汇聚贷,飞红贷,淘贷宝,惠卡贷,广发贷,闽昌贷,华夏商贷,中信贷,泰山贷,慈鑫贷,高效贷,添惠贷,有钱贷,徽商贷,360贷贷网,渝易贷,大众贷,乐成贷,好贷宝,亿润贷,蜀易贷,鸿商贷,融通e贷,众鑫贷,浙江商贷,易融贷,乐贷通,缑城贷,壹方壹贷,金点贷,车贷宝,银米贷,金钱袋,新易贷,益航贷,搜好贷,好帮贷,辽商贷,商会易贷,E贷网,九一贷,兴业易贷,富邦贷,财帮易贷,富弘易贷,农银贷,信互贷,锦煜贷,医界贷,绿谷贷融资,广裕贷,吉超贷,善鼎贷,润贷网,建融贷,融易贷,伯乐易贷,富二贷,合贷网,圆创贷,通金贷,双富贷,惠方商易贷,中信速贷,永银贷,宁夏贷,同城贷,普惠贷,互联贷,安宜贷,e投贷,大乘e贷,百仁贷,百年e贷,钻鑫贷,闽商贷,借贷宝,盘盈贷,连云港e贷,均金贷,赣商贷,点点贷,鑫生贷,京钱贷,融易贷,净净贷,易钱票贷,东方贷,保理贷,最优贷,如意贷,齐商贷,正欣贷,联合信贷,惠农时贷,益达易贷,乐易贷,生钱袋,携手贷,顺利贷,融盈贷,重庆贷,华东贷,聚车贷,幸福贷,融易贷,电商贷,中联贷,神享贷,大业贷,创贷网,聚合信贷,小资贷,恩恩贷,五福贷,千林贷,19贷,乐投微贷,诚易贷,你投我贷,聚嘉e贷,中房易贷,房贷通,优区贷,国安贷,政信贷,汇投汇贷,友金贷,燕赵借贷网,新华贷,苏商贷,信天贷,宁安贷,顺融易贷,幸福e贷,信财贷,润恒贷,仟佰贷,钱途贷,首信贷,水晶贷,信任时贷,安琪贷,信益贷,深港易贷,慧眼通贷,爱信贷,天鑫贷,贷宝宝,帮你贷,汇众商贷,易贷乐投,光华永贷,一一贷,银桥贷,三人贷,668信贷网,联商贷,百e贷,盈通易贷,四季贷,宁波贷,龙猫贷,天润贷,酬勤贷,稳益贷,随e贷,贷投帮帮,平平贷,五A贷,海巢贷,彩虹贷,致盛贷,招金贷,富城贷,润达贷,融贷所,华人贷,壹路易贷,阳光贷,e路贷,盈聚贷,徽瑞贷,聚散贷,猫小贷,大地贷,鑫博易贷,梧桐E贷,网信贷,七星贷,政融贷,自由贷,点心贷,皇顺贷,惠优贷,天下贷,旺欣贷,财安贷,广亿贷,苏中贷,网络贷,亿汇易贷,源鑫贷,金易贷,江城贷,金钱贷,国开贷,小优贷,证大e贷,东方宜贷,房车贷,京浙贷,甬都贷,金德易贷,御帮贷,金升贷,晶玉贷,爱速贷,瑞通易贷,贷发发,永合贷,保财贷,平原贷,瑞银贷,易商贷,优微贷,汉商贷,甬佳贷,人贷贷,聚贷网,锐畅易贷,涌易贷,钱布贷,微利众贷,聚德贷,四联易贷,双赢贷,钱斗贷,好安贷,汇元贷,算盘贷,贷信通,缤纷贷,大华E贷,金钱贷,乐事贷,贷贷红,爱网贷,农科城网贷,米贷网,美美贷,银达贷,明珠e贷,宝丰易贷,上网贷,网通网贷,亿通贷,中金e贷,美E贷,众人贷,汇鑫贷,轩驰贷,好利贷,投人贷,骏翼贷,中原贷宝,眉州商贷,瑞诚贷,华生贷,明烨贷,等我贷,盐商贷,兴盛贷,金泉贷,91车房贷,润合贷,企易贷,银银贷,轻松贷,新恒易贷,惠群贷,零一贷,巨鑫贷,鑫宝贷,乐帮宜贷,青青贷,小小易贷,红兴e贷,有福贷,惠通贷,鑫益贷,金e网贷,贷投者,神州易贷,盛益贷,国银贷,西部网贷,君发贷,融宝贷,鲁中贷,巴菲贷,贷鼠理财,丰和贷,投贷宝,淘银网贷,益民贷,群众贷,仁信贷,金钰易贷,同言贷,升升易贷,凯华贷,农商贷,大乔易贷,延商贷,中联农商贷,文玥贷,小米e贷,宜年贷,贝贷金服,长安微贷,闽台贷,峰诺贷,中兴易贷,万万贷,苏华贷,海陵贷,中融速贷,龙鼎易贷,小微e贷,广润贷,一本贷,昊泽贷,铜都贷,网贷网,京津信贷,宝顺贷,秦车贷,汉贷网,万利贷,鲁融贷,智博信贷,荣盛贷,安全贷,虔城车贷,天贷金融,夏日贷,非常贷,永信易贷,宇鑫人人贷,恒博贷,宜开贷,全融信贷,鼎盛借贷,聚融贷,玉兔贷,直利贷,凤城易贷,玖泽贷,捷贷网,滴水微贷,隆投贷,公务贷,招财e贷,金兴贷,18亮点贷,新双贷,艺商贷,价值贷,弈信贷,聚龙贷,中韩易贷,冀网贷,大家贷,蓝洋E贷,贷贷通,梦想贷,乾坤贷,楚盈贷,车友易贷,金沙e贷,融邦车贷,浙信贷,日夜贷,慈甬贷,富民贷,国宏贷,华夏易贷,我投你贷,欧邦贷,诺贷投资,优悦贷,鑫十贷,汇龙贷,中协贷,长诚贷,财神贷,张贯李贷,多益贷,壹禄壹贷,同城一贷,窑湾贷,钱讯贷,和润贷,尽情贷,贷运来,甬人贷,中银贷,广东微贷,融金贷,环融贷,易金贷,聚人贷,鼎诺贷,万得贷,优品贷,智富贷,益邦贷,搜搜贷,聚融易贷,万京贷,深圳商贷,汇丰网贷,友邦贷,存钱贷,吉宏贷,信贷宝,银联网贷,瓯江贷,通泰贷,车保贷,荣钻贷,名车贷,贷币网,聚鑫贷,安凰贷,里外贷,神州贷,房宝贷,河南贷,科迅贷,怀民贷,贷贷富,升金贷,盈添贷,银保车贷,号码贷,中能宜贷,益农贷,好享贷,世成贷,万信贷,民鑫贷,万和易贷,啄木贷,晋融贷,我爱我贷,医融贷,中融贷,百益贷,德鸿贷,一块贷,今后贷,易发个私贷,农贷360,宜众贷,顺鑫贷,甬隆贷,合胜贷,去网贷,盈万贷,永融e贷,旺旺贷,鸿利贷,天天贷,益丰贷,胜达易贷,A金融网贷,元气贷,金金贷,宝驼贷,金冠贷,易贷中国,顺顺贷,汇富贷,余额E贷,深港一贷,汇乐贷,易久贷,艾瑞贷,好友贷,信优贷,起跑线借贷,布贷宝宝,现贷网,商友贷,快安贷,贷得多,微通贷,三合贷,普临贷,易百贷,中贷信创,U贷网,北深贷,鼎元贷,时时贷,滴滴车贷,快可贷,招商加盟贷,湘商贷,财桥速贷,泷盛易贷,岭南贷,中锂贷,阿宝贷,松特贷,货车易贷,川金贷,龙跃贷,押押贷,聚贾贷,豪得贷,臣曦贷,浙商贷,天使贷,宝元易贷,诚意贷,金淮贷,群润贷,亿豪商贷,云联贷,满地易贷,天标贷,众达贷,领贷网,弘文贷,龍亿贷,拓达贷,宜商贷,民联贷,众富贷,伦取贷,联帮贷,新乡贷,金蛋E贷,聚鑫贷,华扶金贷,聚钱袋,富创贷,汇泉贷,金牛易贷,金润信贷,108贷,鸢都贷,苏州贷,六六贷,凤城贷,甬发贷,商鼎贷,学贷网,e云贷,创赢贷,成融贷,旭贷网,秒车贷,桂宾贷,珠宝网贷,乐贷网,基鼎贷,大家贷,指尖贷,欣融贷,车贷乐,慧信贷,集优贷,普荣信贷,广佳贷,源泰易贷,足鞋贷,金贷子,金信贷,速学贷,保险贷,鹏城贷,通联贷,及时贷,处州贷,天天搜贷,淼商贷,荣京贷,庄里贷,深圳贷,实名贷,投投贷,帮你贷,贷易网,众富随心贷,红易贷,随手贷,闽恒信P2P网贷,一路易贷,浙江贷,6000贷,欣鼎贷,亚联贷,鑫昌易贷,桂融贷,信贷365,华信贷,高隆贷,拓途易贷,诚贷网,川信贷,天力贷,亿鑫贷,宝都e贷,合众贷,金池e贷,乐网贷,徽州贷,汇宝信贷,贷快贷,易互贷,孔礼贷,福易贷,e融易贷,淘车贷,银实贷,八桂贷,喆晨贷,紫金贷,天之源贷,互益贷,鑫鑫贷,网乐贷,日金贷,盟利贷,都能贷,拉手贷,车房贷,天涯贷,恒鼎贷,利安贷,鼎力贷,生活贷,东旭贷,贵商贷,惠民贷,空中贷,索置贷,益君贷,润宏贷,永信网贷,状元贷,诚信友贷,好借好贷,汉贷邦,鼎和贷,山三贷,助民贷,好乐易贷,弘富贷,翼凤贷,鑫石贷,瑞言贷,88贷,优易贷,创值贷,平易贷,中兴易贷,591车贷,住购贷,钱口贷,沃贷宝,创鑫贷,德州贷,青源贷,利巢贷,人山贷,丰融贷,安农商贷,恒金贷,速速贷,洛卡贷,沪易贷,华北贷,股民贷,亿峰借贷,易能贷,昌盛易贷,迅益贷,农商贷,非诚勿贷,铭联贷,西北贷,君易贷,中南e贷,汇晟金易贷,哈哈贷,e联贷,互帮贷,立贷网,喜喜钱贷,徽商e贷,家家贷,慧鸣贷,鑫农贷,桔子易贷,沪发贷,立贷通,富一贷,嘉融贷,誉信贷,天顺贷,褔易贷,招时贷,学生借贷网,益宝贷,朋保贷,聚众贷,龙华贷,瑞通易贷临淄站,理想贷,瑞通易贷德州站,云商贷,紫枫信贷,湖商贷,速贷邦,亿财贷,卓忠贷,车贷通,淘金贷,鲁网贷,溢隆贷,金陵易贷,优贷网,同时贷,诺期贷,苏航贷,景煜贷,安宜贷,利众贷,昆山贷款网,双鸿贷,贷动天下,天易贷,万坚贷,中国贷,铺贷所,3a借贷,鑫意贷,众贷邦,城乡贷,百川贷,哆啦钱袋,和贷盈,中原贷,安贷创投,为微贷,永融贷,好易贷,富本速贷,鼎润丰贷,中投网贷,佰贷,信乐贷,隆晋贷,阿拉贷,发展贷,宜客贷,众贷网,兴利贷,贷记宝,舒心贷,携成贷,钱悦贷,融汇e贷,银鑫贷,易贷富,海岸鑫贷,农丰贷,浙东贷,妙华生意贷,民商贷,利商贷,蚂蚁贷,今顺贷,必喜贷,大河贷,沪乾贷,渣渣贷,宜信易贷,富维贷,牛牛贷,顺意贷,恋贷网,给力贷,利金贷,翔易贷,乐点贷,无忧E贷,盘锦贷,徽商易贷,沪联贷,自贷网,中合贷,贵州贷,E宠贷,民借贷,义贷网,幸运贷,微银易贷,众拓贷,胜辉贷,油界贷,滴水贷,尚融网贷,星星贷,金众金服易汇贷,盛融贷,懒丁贷,一人一贷,葫芦时贷,无忧微贷,晁福贷,诚助贷,周周贷,铂宁贷,虹宁e贷,典当贷,天成贷,众信贷,星时贷理财,一百贷,量众易贷,乾易贷,优贷朋友,乐凑贷,品尚易贷,珠宝界贷,融钢贷,联华e贷,金拓速贷,e典贷,快盈贷,龙驹贷,五八爱贷,云时贷,恒安E贷,内蒙贷,64贷,厚金贷,联安贷,鑫易贷,真诚贷,畅享贷,速贷宝,凤凰网贷,点滴借贷,高兴贷,加银贷,润川贷,中国网络信贷平台,聚鑫易贷,时贷创投,时贷网,三江信贷,家人贷,商众贷,泰诚贷,钱易贷,丰睿贷,卓鹏贷,菁英贷,蜀互贷,我信我贷,快e贷,卡卡贷,易贷邦,国华宝贷,昌南贷,华商贷,贷鼠网,卓越易贷,港城贷,易益贷,滨学贷,同信贷,迅融贷,大慈贷,国中信贷网,我帮你贷,群贷网,沪商贷,利稳贷,酒好贷,鼎鑫贷,信网贷,新势力宜贷,仁泰贷,亿昌贷,峰尚易贷,楚商贷,投帮贷,招宝贷,鼎好贷,汇城贷,优途贷,瑞盈贷,温馨易贷,鑫丰易贷,速得贷,鲁惠E贷,中国民穗易贷,保利贷贷网,瑞德贷,易富贷,佳翔贷,仓仓贷,邦你贷,鑫源贷,徽贷网,赛客学生借贷行,放鑫贷,联贷365,雨水贷,分分期,智帆金科,自在分期,及时钱包,可乐分期,秒借吧,速来分期,汇花花,优米袋,两橙科技,普泰资产,美团三块小额,小额贷,闪银奇异,小贷,幸福消金,耳序信息技术,数禾科技,融资担保");
        map.put("64124", "车贷公司,龙环汇丰");
        map.put("1112A", "西北菜,西北风味,新疆");
        map.put("11140-1", "小吃快餐,二维火,小吃,小店收银台");
        map.put("11210-1", "奶企,蒙牛,伊利");
        map.put("11240", "水果蔬菜,西瓜,葡萄,水果,牛油果,蔬菜,土豆,葱,生姜,蒜,菠菜,韭菜,西芹,南瓜,冬瓜,黄瓜,辣椒,洋姜,芥菜,生菜,韭黄,韭菜,茼蒿,苋菜,果蔬,果业,芒果,槟榔,豆腐,菜摊,果香");
        map.put("11240-1", "果蔬商户,果多美,果婆婆,果业,相约果坊");
        map.put("12131-1", "珠宝首饰,翡翠,钻石,首饰,珠宝行,金行,宝石,玛瑙,银饰,玉石,珠宝店,珠宝有限");
        map.put("12131-2", "珠宝首饰,周大福,周生生,周大生,金至尊,戴梦得,谢瑞麟,老凤祥,明牌珠宝,六福珠宝,越王珠宝,BVLGARI,宝格丽,I-PRIMO,万凤珠宝,SILVERGIFTLIMITED,招金银楼,老庙黄金,华昌珠宝,百泰投资,潮宏基");
        map.put("12210", "个护用品,洗发水,护发素,发蜡,啫喱水,啫喱膏,面膜,洗面奶,睫毛,剃须,脱毛膏,防晒,香体,香水");
        map.put("12210-1", "个护化妆,浙江集享,海豚家,商宇洁,名创优品,卡维妲,一商宇洁,欧莱雅,自然堂,逸仙电子商务,逸仙电商,名创优选");
        map.put("12210-2", "高端化妆,海蓝之迷,香奈儿,赫莲娜,迪奥,路威酩轩,SK-II,雅诗兰黛,资生堂,兰蔻,LANCOME,CLARINS,娇韵诗,希思黎,SISLEY,SHISEIDO,ESTEELAUDER,丝芙兰,SEPHORA");
        map.put("11220", "调料辅食,食用盐,加碘盐,辣椒酱,辣椒面,胡椒,花椒,耗油,酱油,调料,陈醋,香醋,生抽,老抽,冰糖,榨菜,咸菜,八角,大料,白糖,泡菜,酸菜,食糖,白砂糖,红糖,蜂蜜,王致和");
        map.put("13111-1", "家电品牌,海尔,格力,美的,海信,松下,西门子,TCL,奥克斯,酷开");
        map.put("13215", "购房手续费,维修基金,住房专项维修,维修资金,房屋专项维修,契税,认筹金,认购金");
        map.put("142A0", "违章缴费,交警罚款,烟台公安,交通警察,违法处理,交通罚款,交通管理,交罚,交通违法,交警自助");
        map.put("142B1", "摩托,摩托");
        map.put("142B2", "电动车,电动车,雅迪,HMINTERNATIONALCOLTD");
        map.put("142B3", "自行车,自行车,车棚");
        map.put("14400", "旅行,携程,飞猪,去哪儿,携程,同程艺龙,嘉信浩远,七彩阳光,腾邦国际,联联周边游,上海华程,玩爆汕头,优客管家,中青旅,众联商务,同程旅行");
        map.put("15300", "有线电视,有线电视,歌华有线,有线收取,广电");
        map.put("16240", "高端商场,ShillaDFSOnline,,山姆会员,北国商城");
        map.put("16320", "快递,顺丰,韵达,圆通,国通,申通,优速,宅急送,快递,速递,EMS,中国邮政,京东叁佰陆拾度,空运,丰巢,速递易,乐栈,E栈,格格货栈,京邦达");
        map.put("16510", "彩票,彩票,体彩,福彩,刮刮乐,双色球,大乐透,足彩");
        map.put("17100", "礼金红包,礼金,红包,随礼,恭喜,早日康复,平安喜乐");
        map.put("1812A", "俱乐部,休闲会所,休闲中心,休闲俱乐部");
        map.put("18210-1", "数码产品,小米,魅族,台电,纽曼,GAOKE,蓝晨科技,BMORN,中欧兄弟,昂达,索尼,联想,LENOVO,飞利浦,爱国者,AiGO,清华同方,奥林巴斯,紫光数码,紫光股份,博克斯通,BROOKSTONE,文曲星,方正,FOUNDER,英夫美迪,鑫安视,金永利科技,格代,优迈,新好时代,环格电子,世酷科技,美博电子,智虎电子,恒霖骏达,炳捷,美洲豹电子,SHMCI,华索,升迈电子,步步高");
        map.put("1A100", "运动健身,羽毛球,乒乓球,篮球,足球,滑冰,滑雪,射箭,弓箭,游泳,瑜伽,舞蹈");
        map.put("1A113", "体育馆,体育馆,体育场,羽毛球馆,游泳馆,保龄球馆,网球场,足球场,篮球场,乒乓球馆,网球馆,靶场");
        map.put("1A210", "药品,制药,药品,药厂,医药,药费");
        map.put("1A211", "互联网药房,阿里健康,大参林,叮当快药,互联网药,网上药,海王星辰,广药健民");
        map.put("1A212", "药店,药店,同仁堂,叶开泰,陈李济,胡庆余堂,医药零售,药业,云南健之佳");
        map.put("1A240", "养生保健,健康管理,保健服务,采耳,生活馆,养生堂,健康在线,血糖,血压,降压,血尿酸,痛风,风湿,关节炎");
        map.put("1A260", "保健品,保健品,维生素片,脑白金,黄金搭档,保健食品,善存,桑海金维,养生堂,安吉堂");
        map.put("1B120", "相亲,百合网,华夏百汇,珍爱,世纪佳缘,一线姻缘,米连科技,觅恋");
        map.put("1B200", "家庭消费--母婴,婴咖出行,孩子王,泑泑贝,宝宝,婴儿,迪士尼,母婴,宝贝");
        map.put("1B220", "孕婴用品,孕婴用品,婴童,贝咖实业");
        map.put("1B221", "孕婴服饰,安奈儿,童装");
        map.put("1B230", "妇幼保健,妇幼,儿童医院,幼儿中心,月子会所,月子中心,妇女儿童医疗,月嫂,催乳");
        map.put("1B310", "幼儿教育,幼儿园,乖乖宝宝文化艺术,幼教,倍优天地,托班,托儿所,幼儿园,少儿英语");
        map.put("31000-1", "外包公司,共享经济信息咨询,陕西知本壹佰商务信息");
        map.put("35000", "报销,交通费,通讯费,话费,通勤费,招待,接待,打车费,差旅费,报销,客情费");
        map.put("52110", "互联网理财,湖北消费,招财蛙,有道财富,玖富普惠,天安金交中心,宜人财富,91旺财,爱钱进,普汇云通,新联在线,礼德财富,51人品,小猪理财,有利网,E都市钱包,拓道金服,麻袋财富,今日捷财,易港金融,联金所,e融所,布谷农场,一点通财富,生菜金融,惠投无忧,前海惠农,元宝365,小赢网金,口袋理财,网利宝,钱香,可溯金融,融贝网,知商金融,宝象金融,信融财富,邦帮堂,东方汇,向上金服,点融,铜掌柜,友金服,合时代,多多理财,大麦理财,合盘金服,鹏金所,联连普金,融金宝,多赢普惠,抱财网,积木盒子,永利宝,人众金服,万盈金融,人人聚财,凤凰智信,宜聚网,首金网,理想宝,财富星球,金联储,钱盆网,沪商财富,融金所,小油菜p2p,投哪网,爱投金融,信用宝,米缸金融,彩麒麟,洋钱罐,民投金服,理财范,汇盈金服,中融宝,银豆网,黄河金融,后河财富,金宝保,恒易融,十六铺金融,小牛在线,嘉石榴,小诺理财,众金在线,钜宝盆,互融宝,麦麦提,首E家,爱钱帮,金信网,壹佰金融,鑫合汇,合拍在线,银票网,工场微金,九斗鱼,果树财富,固金所,融资易,付融宝,石投金融,钱吧,德众金融,腾邦创投,东方金钰,财加,汇投资,e路同心,华人金融,钱盒子,火球,玖融网,丁丁金服,聚宝普惠,金马财富,投息宝,投融家,短融网,Hi投吧,财源宝,车e融,花生米富,保浩财富,银点财富,掌存宝,钱爸爸,宜佳财富,理财屋,得利宝,聚火投资,阳光金服,众融投,广富宝,爱投资,聚金资本,联保投资网,易融恒信,金投行,金猪儿,懒虫网,麦子金服财富,小微金融,桔子理财,链链金融,钱座网,鑫元汇,财金所,圈圈金服,财富之门,天天赢,菜苗金融,利人金融,宏量财富,浩亚达e金融,微金所,米庄,天天财富,海融易,融通资产,中兴财富,前海领投,中广核富盈,中业兴融,紫金所,房金所,钱多多,五爱金融,宝点网,皮城金融,168金服,九信金融,海吉星金融网,昊良创投,上雨创投,金佰汇金融,99财富,融信网,惠众金融,财爷爷,星光财富,中乾在线,金麦金融,广佛e家,合富吧,冀金宝,钱生钱,徽商财富,大鑫富帮,福汇财富,华丰金融,富裕财富,超钻金融,润源财富,金顺创投,全民财富,金油所,中国钱庄,鑫阳创投,奥科创投,资生管家,众房宝,美利金融,捞财宝,聚优财,众信金融,众信金融(京),网投网,信东创赢,爱上理财,广金金服,小鸡理财,九金所,银湖网,微邦金融,鼎诚创投,小宝金融,涌泉金服,有融网,中融投,徽盐金融,喜投网,爱当宝,A+理财,花虾金融,华夏信财,楚金所,好会理财,三农金服,超爱财,普资金服,投融无忧,恒有钱,力帆善融,红顶财富,鱼猫金服,沃联财富,一起好,胖胖猪,予财宝,红岭创投,中唐财富,兆鑫财富,钱途无忧,懒人财富,金帝财富,西海诚鑫财富,汇信财富,享福宝,方凯财富,家合资本,点点投,诺米宝,远虑财富,黑豆金服,富宏金融,怡文财富,和润网,财智魔方,博宇金融,发现地,汇纳财富,诚信万通,交融所,成融理财,迅泊达,安穗金融,金裤兜,提钱网,银合金融,瑞钱宝,金融圈,安益金融,金蜂财富,银巴克,溢诚金融,善林财富,58money,红金宝,金e柴神,阳光同益,土豆金服,支点金融,华西金融,私房投,友信宝,优选宝,点滴聚,财富智汇,乐饷吧,远尚金融,七彩格子,658金融网,四达投资,沐金农,饭盒金服,鑫金所,投乐网,稳信金融,蚂蚁理财,种钱网,好好理财,新资本,深佰信,瑞驰资本,钱道网,财神驾到,欧拉宝,拾贝理财,盈盈创投,徽鑫所,贝贝投,汇利通,金梧桐,金倍乐,全局金服,海英财富,融邦网,房司令,A资本,全民通金融,搬金网,金葫篓,好利农,钱利网,乐投网,银多网,掌中财富,蓝鲸金融,点理财,快捷财富,粒子财富,袋鼠妈妈,相融网,乐享宝,中益信金融,蝴蝶银,福鑫e融,渝金所,左右逢园,AI考拉,道口金融网,玺欢钱,金银猫,搜搜金融网,金筑财富,58财福,车赚,微金互助,利巨人,汇理财,纳泓金服,浦小宝,鸿金宝,火柴头,蓝金所,量子金融,财雨网,钱脉堡,念钱安,乾方位,大丰收金融,银象网,新纪元金服,京金所,就爱金融网,锐盈财富,美债所,薪金融,贝尔在线,华融道理财,我要金蛋,希望金融,地标金融,百发信业,易保利,小白菜理财,多融财富,吉盟财富,富金利,飞特金融,财富观,宾和投资,融远金服,汇金益,投牛网,理财团,小鹅网,百达金融,深金在线,发发金融,金金宝,蜗牛客,金屋魔方,盈汇融,祥瑞财富,金鲤金服,鑫脉财富,派财网,银魅财富,诚投在线,广润财富,芝麻开门,汇誉金服,狮子座金融,升值空间,涛财网,众信在线,摇财树,瓯金所,脐橙金融,大王理财,聚众金融,兴泰财富,金满仓,银嘉在线,环鑫金融,钱眼金融,火狐投资,明志财富,互融城,八条鱼,百川创投,积金汇,懒猪理财,国富通,点点理财,华夏银帮,东起投资,才米公社,亨多财富,渤海创投,创新众投,聚金汇财,金发所,浙金网,正和创投,天昊财富,立金所,中金在线,一家人财富,宏泰网,荔园银河系,利他人,殿金财富,智富理财,民商理财,穗金所,吉祥宝金融,鲁金所,万利金融,众隆金服,金豆包,洋葱先生,久融金融,车富88,第三方金融,领投鸟理财,树懒理财,中网国投,够力金融,金牌理财,乐投壹佰,小存折,蜜蜂有钱,青鱼金融,升值宝,汇中网,优投金服,新富创投,蛙蛙在线,好利网,金麦子,四海众投,财蜂发财树,银承派,通通理财,齐鑫金融,一点钱,异享金融,金元宝理财,乐投创富,屹农金服,要借钱网,前海广深发,融租E投,极光金融,投这家,普天金安,聚融在线,柏融投资,拼图金,赚啦理财,付小宝,椰子理财,527金融,砖头网,优车融,壹壹金服,铸金所,富通财富,蜂融网,银港在线,龙光金服,隆金宝,富民投资网,利民网,上融所,花生金服,财富派,财富派(京),海投汇,善行金服,淘淘金,浩森金融,链金所,众财金桥,石榴壳,合银创投,首库金融,U我金融,饭米粒金服,大唐普惠,钱途在线,菠萝理财,掌指理财,协众金融,天财宝,君财金服,蜂涌理财,点牛金融,酷宝盒,融生在线,三湘金融,优聚投,一休理财,瀚翔e家,渥金,麦钱网,大拇哥财富,贵人柜,浙众车,楚天财富网,融金交易,小鱼钱包,中恒宝,汇付四海,得融在线,我的金服,全资本,电牛金服,企融信,悦家金融,岁意讯,中青金服,壕金所,中金物联,春雨金服,财大狮,东领在线,易众网,优信资本,芝麻金融,爱互融,钱增增,北方金融网,增值e,堆金网,票据客,钱潮网,长江创投,800Banking,信融投资,房融界,乐金所,花果金融,中再融,便民投,拉拉财富,产融信,有盼投,广电财富,宜投宜盈,龙腾财富,艺投金融,投之有道,盈金所,同城汇融,钱范儿,佰家创投,第一账房,囧羊,全民共投,中赢投,本利网,稳通金融,安盈创富,中吴财富,沄银宝,巽邦资产,一帆理财,千和投,钱胖胖,天天投,普惠利德,融信壹百,徽金猫,外星人理财,聚赢金服,米融网,爱投投,融交所,华泰100,尚尚金服,鄂金所,金戈戈,巨涟金融,银达金融,钱在线,信义天下,凤凰金服,富瑞财富,金龟网,中鼎在线,淘收益,襄金所,广发财富,盛凯禄财富,仁我行,票金所,帝天财富,高安创投,银子铺,米族金融,国民丰泰,国盈金服,喜悦金融,葡萄串,投复利,鸿学金信,森仙堡,田金所,中仁财富,星金所,旺财谷,倍倍利,金盈所,金桥梁,即利网,亿丰金融,和合速融,景云金融,佳兆业金服,光合种子,海新金服,自由财富,木融宝,汇诚金服,来财街,小金瓜,稳银在线,融金桥,梦想盈行,手投网,爱康金服,火钱理财,大圣理财,e聚富,顺时针金融,亿信宝,诚汇通,e葱金融,e兴金融,金融社,富仁金融,恒瑞财富网,艺条龙金融,SH.COM,惠农聚宝,豆芽金融,车财网,汉金所,石头理财,浙财理财,长运网,利基金融,中投摩根,e路财富,有友金融,融之家,微积金,爱财得,众联财富,恒安财富钱多多,关信金服,互融CLUB,润冠黄金,住银所,满益网,马甲袋,金贝贝,首鸿财富,盛金所,富轩投资,长征金融,宝沃金融,源海金服,创富部落,港信创富,老母鸡,吉乐车理财,51帮你,安宜投,哈哈金服,金融眼,盛京金服,水珠钱包,共富网,钱兜金融,宝宝金服,德壹金融,珠宝盒子,联恒金融,创客金融,钻库网,咸鱼理财,月光宝盒,八戒宝,有红利,金融聚投,福润融通,迅拓创投,恒信汇通,微投天下,爱财在线,华银金融,爱银承,红创金服,富桥金融,成峰创投,吉爱财,时间价值,恒丰钱包,91节节高,融亿通,浙楚金融,多息猫,小石头金融,开图财富,大众金融,丰利金服,城满财富,多玺云,禹上资本,润丰金融,中融钱邦,金蝶金链,亿诺信投,普交所,基因创投,天添钱,楚财友道,小麦在线,投德宝,平安资本,介投行,景云网,小麦创投,金宝盒,紫金聚宝,中祥金融,小狗钱钱,角分在线,小喵理财,钱路理财,钱来也,利得行,海河金融,沙小僧,乐居财富,钱哆拉,e资产,中潮金服,中平金融,前金融,蜂硕金融,申鼎互金,步步盈,峰向标,my标客,太空马,汇商所,有喜财富,理财去,五星财富,冠e通,当当金融,一鼎金融,钱保姆,乾包,糖果金融,甜菜金融,白杨金融,广群金融,久信金服,金瑞龙,富利网,农钱庄,中贝金融,悦享金服,瑞达金服,互利网龙宝宝,黄金街,点石金融,金花顺,快点理财,吉汇金融,微金在线,私房钱,创具财富,理财盒子,世纪金服,融益汇,来融金服,派派猪理财,中南金服,安心投,超有利,宝通网,宜投金服,金易融,圆小财,钱妈妈,隆发金融,八斗金服,金投手,多财宝,微镇,益大家金融,66财富,微镑客,满兜理财,钱生财,万财金服,蓝色金服,艺点理财,巨久金融,南瓜马车,汇金丰,百融网,国惠金融,小袋理财,神仙有财,万元富,钱趣多,随取宝,果儿金融,钱满仓,中信创金融,多利宝,投理想,昌和财富,赢盈在线,华侨宝,金砖联合,守财奴,点滴金融,e周行,精融汇,弘旭融投,中星财行,人人融,吉财猫,钱婆婆,君来投,人人惠信,猪宝宝,爱分钱,司库金服,自金所,国湘资本,薛国创投,放心金融,安逸宝,机器人金融,知财网,易房创投,稳展财富,兴旺财富,商赢金融,美投网,坤一金融,天天金融,国盛财富,来鑫财富,牛牛理财,鑫华士,车融资,中盛金服,康恒财富,融圣360,甬添财富,car2money,方元金服,九能金融,中大财富,天池资本,财富500,德得宝,仁和融兴,储钱罐,多多宝,福赢万宝,哆利猫,融冠金融,互助金服,小九金服,飞鸟金融,金源创投,亚联超银,盛世财富,先锋e融,宁翌直通车,蜜蜂财富,正大财富,星时代金融,千金e诺,爱融网,微企融,盛信金融,爵财网,普惠家,三只小羊,育米金融,布袋资产,投融雪,爱木财富,御财金融,无忧聚财,叮咚钱包,米金社,钱富通,三益宝,德鸿普惠,钱海湾金融,海星宝理财,橙天金融,钱程在线,金融街在线,山东高速金服,鑫聚财,智佳金服,玉米理财,创利投,淘金汇,集利财富,金财动力,智融会,新能源金服,聚胜财富,丝路金服,融客网,稳赚宝,光华财缘网,财富农场,丰盛金,牛板金,网筹金融,小小金服,聚车金融,惠恩资本,点滴身边,财小主,众信金服,新金所,看看钱包,改革牛,琥珀金服,种子拼图,米e宝,前海红筹,大爱金融,旭日财富,亿企聚财,泓信在线,酷盈网,润业金融,领创金服,小壹在线,果拾金融,智联财富,握握金服,得易金服,小猪生财,福银票号,你投我融,东宏金融,老账房,铜板街,余盆,8戒有财,易人金服,钱鼓鼓,智惠蜂窝,星鑫宝,沃要投,惠黎金融,鄂汇金融,白菜金融,中智魔方,金票通,91投,熊猫金服,春言金融,利聚网,投巴巴,懒财主,金口袋,保尔金,蚂蚁打的,聚力金服网,钱布袋,小微蚌壳,点金融,智富大管家,壹文财富,金蝌蚪理财,文创汇,领投羊,能成财富,中信实力,苏常网,财优优,资本在线,胖毛在线,潘亿金融,仁庆投资,小微财行,中钧金服,爱健康金融,火火理财,益金宝,汇元金服,携银网,钱转赚,金融易倍,如意财富,国元网金,财火火,宏祺金融,富创在线,合生宝,金钥匙,启道金融,孺牛金服,徽嘉金融,车投宝,柚美理财,今算盘,贝通网,向右转,中东资本,百善金饭碗,恒富在线,晴天助,缘天金服,贸金所,万富宝,1号钱庄,新融网,中宝财富,蜜蜂融,水浒汇,意投财富,创安财富,蜜蜂兵团,联诺财富,潮深e融,1818优本财富,金小岗,信业财富,徽商金融,万利财富,分钱网,金桥创投,汇南创投,财来网,西域财富,海赢理财,合信,官银储,投融范,财富N次方,点银网,天府财富,通宝金服,汇陵金融,金牛座,木牛流马金融,航石资本,荷银商务,华舵金服,丰汇金融,广筹网,惠宜投资,汇盈财富,悍盈理财,汇金宝,金府通,兴玉融通,积财99,众石金融,金包谷,方林资本,财玖有财,云端财富,开财宝,隆和财富,财大户,银河财富,融100,理财邦,金玉普惠,艺融易,投金所,乾友资产,创联汇通,理财乐,宜倡财富,同诚信,大牛金融,e租宝,前沿财富,存钱网,大白金融,华邦理财,为顾在线,一元网,平凡金融,融e365,京储街,蚂米金服,众车在线,富捷金服,招财猫理财,湛卢宝,金晟创投,爱本地金服,红利圈,一财金融,和云筹,华镇金服,城城理财,禄安宝,金储宝,卓金金服,易金智慧,普惠金融,欧亚金融,金融湾,小宝在线,天天利财,班汇通,合富金融,白银巷子,八通金福,牛牛bank,新富金融,乾元金票据,千壹,博盛金融,倍多金,信投宝,金益金服,小马金融,甲壳虫金融,普惠理财,国金所,木头人,铜方圆,万家兄弟,蜂投网,好麦金融,宜泉资本,酒掌柜,财富保姆,长汇财富,筷来财,中投国融,掌道财富,普惠金钥匙,申融财富,金辉投资,冀鑫财富,恒众财富,星享融,九福口袋,分利宝,网信财富,泛湾天域,发财猪理财,红象金融,君享金融,中投融,利往行,爱鸿森,隆筹金融,欧克普惠,拓米金融,链车金服,易多财富,钱来啦,钱小串,富瑞通,融立方,增信金融,国金宝,百长钱包,豆蔓智投,蚂蚁在线,闽投网,兢业金服,鑫茂创投,顺天财富,牛牛金服,爱投点,房融所,天顺金服,国金社,雅堂金融,天天添财,万泽财富,80资本,融金汇,金盈财富,财迷包包,好时代,小猪罐子,金钥匙钱道,世联集金,国阳财富,中纳资本,倍赢金融,锦联财富市场,众邦财富,世富资本,甬红财富,东郊财富,众合投资,医加医,我投点,云时代,巨牛财富,生财网,宝玉金融超市,拍财富,众力金融,开元理财,壹金所,金财富,叮当口袋,慧源融投,睿信财富,禾泰财富,昊华财富,黄鹤金服,久久理财,小梦想,盛腾财富,建设金服,润合金融,中易融通,人人配资,凌锐财富,大博鑫财富,天立鸿,三农资本,众融在线,品胜财富,梧桐理财,股信网,易投资,笨小孩理财,一辰创投,贝格富,品财网,信客网,航银金融,微时资本,南信众投,大丰号,帮帮金融,小表哥金融,新财富365,牛火火,民航易融,稳易金融,诚鑫易通,金果财富,医融网,虹金所,真金服,柚子理财,皓添金融,叠尚金融,票据宝,V金融,响当当,53财服,助商金服,油融网,大乾柜,阳光钱包,雍和金融,财佰通,银狐财富,城铁在融,交金服,铜钱贯,德晟金服,金谷财行,网信普惠,钱罐子,聚财猫,富勤金融,投资去,牛伯伯理财,金衢桥,51钱管家,众储财富,虔诚猫金服,信托100,联投银帮,钱内助,玺鉴,悦融庄,每利网,信融投,汉沃财富,铂恒金服,聚生财,宏金多,亦融在线,央金所,苏诚金融,蚂蚁宜票,日日昌,金投会,天龙财富,铭捷金服,四季财富,朔诚资产,人人爱家金融,聚雪球,汇泰在线,奇子向钱,安润金融,闪电金融,稳盈宝,建安金融,启腾财富,海佛金融,八融宝,善金网,信富创投,厚德普惠,微车融,正山资本,小算盘金服,海豚金服,开元金服,车聚宝,盛世开元,懒人投资,红包袋,滇金所,春嘉金服,钱涌金服,决策树,憨豆金服,普惠无忧,合金融,担宝投,1号投,玖鑫汇,豫麟创投,帮帮汇,诺云汇,合众金服,乐投天下,住永金融,德铢财富,懒投资,信投在线,悠米钱包,旺财小强,99金融,创绩宝,聚爱财,励国金融,鼎裕财富,滴滴投资网,招财网,天壕普惠,惠盈理财,宏高财富,金二代,金米袋,葫芦金融,百利市,骏龙财富,泰然金融,广发金融,爱增宝,利人金融,金钱橘,好收易,金投资,六六投资,中富国帮,本利宝,财道金融,启迪金,黔融网,合伙人金融,明智金融,安心金融,闲钱宝,泽业财富,万年松财富,库德宝,中海资本,昂道招财猫,雨来邦,利金行,青松理财,瑞泽会,长金保,投储在线,进化互联,星理财,金豆利理财,藏象农业众创,聚投融,四联信投,广汇融,蜂缘财富,网络金融交易所,智慧树金融,泰山宝,银畅金融,济赢财富,融合天下,银通泰,前海双赢,安鑫金融,采利网,华夏银泰,融圆财富,轩辕财富,中和金融,亿人惠富,旺宝财富,车友信,万绿创投,融政金融,蓝融汇,紫橙金融,通融财富,优学宝,银海颐乐,多啦聚财,宏信创投,合家金融,春天金融,银程金服,天玺金融,易九金融,财富未来,金蛋,草根投资,财小喵,同江金融,互惠金服,聚宝珠,钱诚理财,米牛网,知合金服,虎融宝,帮客普惠,律金金融,花木金融,商赢金服,郑投网,储信理财,币港湾,银谷在线,金福财富,慧融财富,元泰金服,巨人理财,银强金融,融借宝,爱米金服,星月创投,安捷财富,油鱼金服,银信私人财行,旺财金福,投促金融,沪信金融,辉金投,时发金融,来存吧,鼎亨汇通,多维度,海金汇,国泰财富,星辰金服,冰川财富,高新普惠,去投网,共信赢,小宝金服,津融所,亚联财富,恒利网,财投宝,萤光金服,好投金服,芝麻宝金服,亿信天合,桂e宝,双喆投资,易BANK,融托金融,雪松普惠,安广融合,知麻开门,AA金融,惠鑫富,沪宁金服,芒果金融,泰牛网,壹理财,网交所,弘安在线,宜易宝,皖平财富,工艺通,瑞银创投,爱财有道,一桶金,一起富投资,花橙金融,知屋理财,大雁金服,巴巴汇,大同行,小资钱包,东方犹太,厚本金融,臻鑫创投,甬利财富,复祺在线,金柿子,沪商在线,德银在线,城商行,汇通钱箱,淘金城,友禾创投,银富汇,融投行,有鱼金服,安阔财富,铄洋金融,不差钱,中亿资本,彩云金融,乾坤袋,民强财富,名启财富,众利网,九州宏瑞,汇票通,金来股网,旺财猫,通灵创投,沪臣地方金融,普邦金控,聚福鑫,创亿财富,益鑫在线,轩鸿在线,信德过,融众网,百利汇通金融,慧达财富,恒融在线,旺利网,升隆财富,坤润财富,外快理财,蜀丰财富,第一光年,中若财富,安心de利,商汇通,美联投,财鸟财富,金联所,融艺通,水金所,中金服,商汇财富,乐驰金服,汇德行,昊天财富,V5金融,堆财网,汉泰华泽,牛鼎网,金蟾在线,聚千金融,爱迪理财,至尊宝,万同普惠,投米网,掌盈金服,元立方金服,非常有财,存金牛,共赢金融,车行金服,投呗,宏鑫宝,车投网,京金联,旺财狗,小鹰金服,利魔方,妥妥当,德合在线,金硕果,米果理财,红顶金融,广惠人,8号金融,电网金融,牛娃互联网金融,钱庄网,众资本,多多智富,鼎有财,日融财富,海象理财,铭泽理财,车厘子理财,融易投,中金国泰,助赢普惠,能投资,双雄财富,小虾理财,华融互联网金融,乐行理财,钱趣网,厚铺街,徽金所,丰汇财富,金佳金融,MoneyHome,瑞鼎创投,信和大金融,弘兴金融,金安国有金融,河马在线,乾易宝,爱易融,阳光金融,遇财网,钱江通,胜源财富,艺融网,淘财网,小富金融,米利财富,八点金融,盈利盒子,长盈金融,投宝金融,富国创投,润顺财富,汉融网,荷叶金融,乐投资,锦如金融,汉唐通宝,丰投网,清华财富,诚天财富,巧巧财富,招财袋,爱投网,永利财富,兴中宝,众汇通,国控小微,车酷网,蓝筹汇,众润金融,乐米金服,中融恒信,52金融,庆协投资,优金客,智信创富,E湘资本,新凯无忧,快联财富,同城投,天涯好收益,58红利,慧财网,中宝投资,龙驹财行,上咸bank,维金荟,赢贝金融,悦德财富,猴子理财,她金控,海金所,佰亿猫,甬巨金服,88财富网,见大金服,民富宝,互汇盈,妈妈钱包,两只老虎,阿拉丁金服,87汇财,汇创金融,泰山金融,公众理财,新华金典,集财,粤科金服,有钱金融,城惠金服,抢钱通,7号管家,盛世典当,云浩金融,YES金融,普金资本,妙资金融,金融桥,中鑫金服,融头金融,房金网,日益网,宇商有财,大数云融,久金所,旺和财富,达利金融,宝澜君业,昌久财富,锦绣钱程,蚂蚁兄弟,全支宝,盈天下,湛利金融,聚财宝,汇银宝,爱财网,红兆资本,邦诚金融,向日葵金融,宝丰盛,汇盈利,俊博财富,金银富,本倍财富,众信所,强强财富,神州通宝,大印财富通,融星行,车当铺,万度财富,佰富行,汉华财富,朋友范,智能投,青蚨在线,金华财富,兴泰创富,鑫隆财富,盈联网,恒硕金融,善林宝,苏银财富,储亿宝财富,中鼎创盈,虹维智投,宜帮金融,禧龙来,四海全球,好借存,惠众e金,科煌财富,金联投资,尚佳财富,沃资本,756金融网,蜂鸟金融,三惠富邦,创世金融,创益100,大米金融,国诚金融,核新产融,盛融在线,和祥行,币丰所,紫马财行,天玑汇富,财神在线,国艺金服,海鹭金服,趣投资,邑民金融,圣贤财富,平太金服,威阳普惠,分秒金融,饭饭金服,惠富天下,广电金融,盛世创投,零钱罐,方橙式,阜金网,隆隆网,穿山甲金服,大宋财富,微银金服,川建恒升,淘金家,金海金服,融资城,钱牛牛,财富在线,蚂蚁白领,人人操盘,hello金融,牛津所,甲富乾财富,盛平财富,猪猪理财,亚丰金融,昱盛财富,宁金所,沃信财富,新沃金融,蜜蜂资本,一起金融,钱联钱网,宏财网,北方金融,金豪利,互投金融,添添投,佰老汇金融,华金在线,中利财富,印子坊,好借好还,惠融投资,好利信,中科财富,平安理财网,天勤在线,子祥财富,汇鑫在线,飞翼聚财,融卷风,小猫钱钱,多肉理财,众立信,添亿创投,人人爱投,祁商创富,码头益,创业宝,钱景家财猫,物金所,一点投,诺帮友信,盈盈金科,航金所,无界财富,得宝理财,连连赚,象象财富,银鑫源,合米金服,魔袋,普点金服,理融宝,乐猫金融,方泽金服,罗斯金融,金品创投,金善财富,钱生花,荣通宝,旺米铺,资交所,新空间财富,红金所,乐信,和贵网,梅菜肉丸,天财猫,中银汇通,奶牛计划,瑞涛财富,聚有钱,徽融通,龙宝斋,亿升财富,利丰网,金粮宝,骏合金信,家家聚财,银禾财富,魔环电影,爱银网,快手理财,华盟金融,易诚金融,全球星金服,汇富创投,小财大用,伊人财,民泰财富,盈火虫,宝盖头,山西众创金融,金谷网盈,翰金所,华信在线,微财金融,迈信金融,718金融,万城汇丰,中盈财富,懒猫1688,信诚金服,红狐理财,山水聚宝,湖湘财富,钱功夫,众金所,融洽财富,秒针理财,财猫网,云回通宝,有余金服,雄图创投,汇投网,七点金服,钱升钱,光波金融,会富金服,安星财富网,小生菜,聪明投,天顺祥,深宜金服,信而富,轻纺城金融,千百亿金融,金贝艺融,魔卡金服,宜投通,广泽财富,中商行,票票管家,指南针,黑金所,善融,元富资产,聚金所,麦粒金融,笑着赚,钱罐儿理财,冀银理财,敬友财富,天石金融,微金客,速时代,东岳宝,松鼠金融,爱利是,皖都金融,睿银财富,华联保利网,恒普金融,铁甲金融,金润创投,信通袋,你我金融,微众筹,钢票网,泰麟资本,中联乐银,金汇微金,汇有财,e贝宝,铭胜投资,人人融通,袋袋金,深创金服,天恩世诚,网行金融,开茂创投,孚金所,都市金融,优财树,中浩信投,小鸡在线,诺金融,鑫天下财富,广阔创投,天科财富,中融易联,众筹宝,金钱猫,明日资本,3A金融,君来君往,兆金所,21世纪财富,星宁创投,微融网,筑梦天使,汇康财富,吉来宝,海银会,鹰眼理财,金承易通,典金所,融益盈,国瑞金融,誉金所,PPMAX有道理财,易宝金融,信投财富,联信财富,91快车,富爸爸,金鞍理财,智富会,魔房宝,雪橙金服,空中金融,小康资本,民蕴财富,爱达财富,Me金融,众悦普惠,钱美美,微品金融,赢众投,普惠在线,安企金融,星之灵,零钱包,西部财富,财菁汇,亚太投资,随时融,熊猫钱庄,雷萨财富,爱定投,薪多多,银钱树车投网,玄谷金融,玩儿家理财,天盛财富,联豪创投,存钱罐,普天众投,智捷汇通,光世界金融,汇金融商所,泰堃财富,中润e在线,久久盈,钱柜理财,壹点金服校园金融,好投资,巨财网,中农财富,辰典创投,中汇在线,多乐融,前金所,领奇理财,风零度,金岩财富,鑫隆创投,第一理财,财富中国,票号网,仟金所,大盈家,黑火金融,天天数米,通财网,财满仓,库天下,如愿创投,财迷中国,零壹金服,天天融,唐小僧,邦融汇,沾喜袋,博拓创投,立农在线,E借通,好房理财网,钱掌柜,利多网,我的钱夹,钱根源,鉴丰金融,涌沪行创投,储金所,红杉资产,美冠信投,乾丰金融,腾滕聚,聪明钱,恒享金服,55财富,鼎玉财富,e生财富,机智投,生金所,湘信网,金诺鼎,生财有道,一元投资,仓鼠金融,悦投融,铭人普惠,钱时代金服,富华金融,昱天财富,滨州财富,米麦bank,如丰电子财富,友融金融,众善服务,世宇财富,恒友投资,诺辰财富,齐鲁金服,信诺宝,易街金融,利融网,睿逸财富,联合汇,贝安金服,易金融,联帮财富,坤玺金融,百凯祺投资,合泽财富,丰储宝,巢商金融,财富天下,聚投网,排队金融,广融在线,富达亚金融,坤鼎金融,熊猫金库,华邦财富,嘉润财富,人安资本,沪联在线,盛开网,爱康投资,广安宏润,基石在线,聚米立方,钱窝窝,三五八创投,农金所,乾乐畅,蓝岸创投,财富宝,三弟财富,天天聚财,融融网,全诚在线,宝利金融,亿鑫创投,亿通投,黔程金融,惠信财富,贡和金融,壹投资,e快钱,存利网,圆梦巴巴,智融财富,渝商创投,陆鑫所,丰银凯利,敢投网,融易理财,湘商盟,加法口袋,邦融理财,佰市行,轩正创投,多宝库,大福创投,益田理财,天下汇通,汇富宝,旭景通,微投网,金合社,米粒儿金融,羊宝宝,众利创投,金蝶理财,鑫巢财富,乐钱,苗木之家,虹银财富,种子理财,格华财富,中银号,账房先生,顺昌财富,江粉金服,融金通,创融在线,中融财富,睿圣宏泰,瑞信富盈,宏中创投,昌泰网,广聚财富,鼎融资本,兴民财富,渣丰投资,和诚德在线,华深拓业投资,亿元宝,湘中银联,力安创投,亿德汇富,易通投资,苏聚创投,碧有信,金融街,新锐联,麻布袋,共赢社,融至鼎,诺信创投,前海航交所,融易信,裕德财富,宝利源,启隆信投,矩顺财富,名宏创投,向前金服,一点成圆,映贝金服,日日进,兴飞财富,佰信投,跃龙财富,鑫诚投资,中诚在线,卡趣网,高新盛,苹果金融,爱口袋,鑫利源,盛齐财富,微美金融,i零花钱,尊荣财富,诺一创投,安客创投,锦融运通,优旺诺祥,寻钱网,88供应链,富赢财富,9金服,通达财富,融魔方,创信泰冠,融讯网,易建财富,天下通,金喜财富,念念金融,金喜网,金汇丰,好时代,众创资本,追潮投资,上致财富,榕巨互金,智投富登,94bank,久利网,弘利创投,福州财富,卓信财富,万通财富,宏源恒丰财富,采壳365,宝来金融,拓宏理财网,汇丰众投,友信网投,朗诚金融,慧众财富,丰达财富,鹏飞财富,无棣盛世,盛赢资本,孔方兄理财,万民投资,点滴聚财,鸿利财富,奕诚金融,财富联成,汇亿财富,顺发人人帮,钱櫃网,新合作金融,永信财富,中通财富宝,中普金服,海金仓,百发客,富疆财富,置上金融,金鼠袋,信诚创投,小豆钱包,渤海金融,宝鼎投资,律信智投,好享投,ATM云金融,桂银联,华夏创银,海湾金服,信博财富,鑫良财富,融促汇,富润金融,一禾网,中融所,人人宝,蓝投财富,喜迎财,有色金融,宏德创投,中民i投,17聚财,深鹏金服,晶英财富,财富58,微龙网,万钱堂,志坤财富,惠金天下,惠易通金融,鼎金柜,宜生宝,龙票在线,家融合,方圆财富,今来银网,益远赢,禾信金服,丰泽财富,秦皇资本,国临创投,鑫融宝,钱100,华鑫恒生,名龙资本,诚融,百利财富,隆万创投,源金所,荣信汇,竞优理财,融其道,赢城创投,景行财富,快融在线,华金所,火牛财富,金钱客栈,合众筹,浦信财行,融金金融网,杉众投资,银号街,盈在线,趣投金融,易微信用,多粒财富,3000财富,鲤鱼理财,中融腾,天加利,好易投,金贸街,联富金融,彩虹财富,卓越理财,现佳创富,诚宜创投,老虎金融,润通财富,众投未来,宜民在线,星火钱包,信泽创投,真理财,星投资,鑫联创投,人人富,青岛力霸国际金融,福建融广通,粟米理财,楷誉金融,D1金融,比搜益,恒通金服,壹号金融,儒源财富,钱进帮,51快影,尼尊财富,富莱而金融,国投宝,诚信宝,凌云创投,酷有财,高搜易,润锦众成,锦盛财富,点点财富,弘信宝,泰牛理财,融易创投,云峰理财,天安房客,大佳创投,恒艳财富,薪满意融,利多财富,良渚财富,投一投,前金服,弘桥投资,淘金聚宝,民生投资,晶行财富,洛邑汇融,华东财富,寓锡金服,融业网,家金所,加油宝,弘宇信投,e融在线,金栋投资,商贸财富,赢瑞创投,明铄财富,好信财富,乐投无忧,易汇人人,理财咖,汉荣鼎盛,元太在线,果投金融,莫愁信融,好管家,腾远投资,荣锦创投,中融资本,绿豆金服,富尔理财,优储理财,优舸普惠,便捷惠通,安逸投,易投易,中天和信,万石金融网,手拉手金融,再金所,掌众财富,i财富,泓曲金融,小钱小乐,钱帮主,金贝增,资本密码,鑫潮创投,振源财富,369财富,金蜗牛财富,中国二手车,不再凡投资,加号财富,聚钱贯,国瑞财富,天弘创投,海阳财富,华悦财富,南岭财富,农哈哈,汇金在线,鼎鑫财富,龙腾投资,昆石投资,满元金富,黄色蒲公英,万金先生,百富网,源美理财,奇雀理财,涌金所,安信投,牛车在线,首信创投,小微聚投,银洽财富,亿好金服,盛泰投资,中青创投,道和创鑫,沃利资本,财富宝投融,宏图创投,华源投资,雍铄金融,中诚财富,宜信惠民,乐融巴巴,易融投资,专投汇,豐鑫财富,万盛金融,鑫广金融,中融网金所,鹏天投资,乐天在线,中银信投资,宜定投,聚汇投资,万博基业,富源财富,中汇通投资,华赢宝,金蟾宝,华幕投资,嘉宝信创投,瑞资所,伟利投资,拓坤投资,泽聚财富,姑苏财富,佳伦资本,圣典网,鸿康创投,云泽网,路路通,1+1理财网,常盈财富,善盈宝,牧渔金服,牛犇犇,天开财富,红丰智投,有人投,万家创投,昭丰财富,蓝象金服,圣达创投,麦芽金服,e金所,久汇资本,虹腾财富,杨梅理财,利邦财富,荣和在线,冠亿金融,信茂财富,858金融,佳禾金服,好鑫人,同乐宝,牡丹财富,放心投资,禾嘉创投,拾贝财富,家家盈,中安永恒财富,富田在线,金榜财富,众投天下,君越财富,云通金融,众筹投资,亚龙信投,助力金融,瑞敏投资,资邦财富,花瓣金融,昊都钱柜,聚金投资,皓峰财富,融丰创投,添米,安盛创投,挣钱宝,汉国钱庄,小龙金投,银城财富,首融在线,中金盛捷,易融通,来财宝,欣旺达财富,仟人金服,快乐投,财利通,汇银财富,惠民理财,天源财富,果轩财富,八陆融通,鑫华创投,信通财富,鑫禹在线,中农创投,汇易宝,佳联财富,浙联储,进弘创利,元宝街,小熊在线,金瑞投资,宏安财富,适配金融,融资谷,三块钱,长投在线,红酒金融,煜尊财富,巨石金融,钱的N次方,正博网,钱茂财富,巨莱财富,帮投网,慧众投,天祺资本,汇驹金融,佳缘金融,大华财富,投融e家,宜信宜投,大可利金,银立方,雅戈创投,信之宝,唯存信理财,洪升财富,宝多多,鼎兴财富,鸿屹资本,易金易,状元理财,众赢创投,小母鸡,众投宝,金鲤在线,兴业创投,金金财富,汇赢创投,亚太融资,景腾金融,靠谱鸟,展翔投资,九华金融,速帮经济,三农创投,小红理财,民间财富,得利盈,锐忻投资,众力投融,皇家金融,贝贝创投,创盛财富,保诚财富,凯祥财富,酬信投融,中E邦达,今鑫财富,汇隆财富,供销金融,东旭财富,金勺子,指尖财富,易圆财富,希望财富,财富女王邦,365金融,三峡金融,民间资本,融海财富,金鼎投资,创乐财富,凯大投资,投资啦,领投客,乾恒来投资,尊宝理财,币币通,雨滴财富,致雅财富,冠宇投资,E人一铺,速溶360,惠财富,善德财富,西证投融通,股东派,鑫满盈,鲁家所,鲁发财富,伍号掌柜,金召金,雄州金融,钜鲸金服,HelloMoney,金亿投资,正臣财富,投融租,紫东金融,万鼎投资,财富广域,无忧理财,新常态金服,创投汇,燕赵百姓理财网,宏东资本,找银子,金福猫,小麦金融,裕滨财富,泰信财富,豪田财富,云山信投,任人投,润成投资,普金金融,钜仁财富,丹鼎投资,信用时代,木兰创投,乐融在线,金赢家投资,鑫龙财富,齐鑫投,康意和,泓森财富,多利金服,文宝保,人祖金融,华闽理财,17理财网,加诚金融,力川金融,鼎诚财富,润通创投,华迪易投,一车易融,胤赞投资,温州金融港,赢投宝,资商金融,七彩龙珠,宝丰创投,安其拉财富,安安理财,久鼎创投,检顺财富,汇安金服,华飞资本,恒亨金服,一诺金融,中汇金融,诚铭投资,绿能宝,光大炎黄,渝意顺,众融网,当当财富,浙曦投资,淼广投资,善富资本,爱尚投资,金誉丰投资,嘉柏利,开杰圆融网,锦慧通,金维思,投车惠,中贸易融,乔泰投资,优特财富,瓢虫金融,肥猫理财,么么哒理财,财富加油站,汇支宝,宝都财富,福润汇鑫,钱柜money,美易理财,聚财富,光合联萌,融帆投资,八戒理财,盛泰信投,嘉淋财富,同发理财,领东财富,联创财富,天下钱庄,德福财富,小票金融,鸿泰源投资,艾米财富,盛达财富,日升财富,万佳金融,亿豪通,如意金金融,欧誉康金服,滴滴有金,誉丰财富,世纪创投,沃土财富,成金所,C金所,汉腾创投,点金盒,钦联财富,星期八金融,盛欣财富,众安银票,云保理,黔业金融,隆祥金融,联合众创,e车融,米袋计划,合利在线,旭鑫投资,天天易,盈聚宝,和融天下,德亨在线,万象理财,迪丰资本,星光资本,汇丰恒创投,中庚财富,启利网,龙锰财富,聚汇金融,儒商财富,万众创投,融微金融,润信新世纪,富银信,皖通金融,信欣财富,创杰投资,好彩金融,传通财富,顺财网,旺富宝,日日薪,及时雨,中葵财富,清融网,蜗牛在线,乔赢财富,生钱树,骏宝威,信易安,泽鑫宝,融和创鑫,龙途理财,富乐投资,金桔财富,东田财富,钱宝贝,海源财富,财富猫,汇金所,太保金服,华富信投,中天理财,760财富,金满盆,南汇财富,云麦在线,时代财富,星光金融,卡融网,金铜网,车轮赚,时飞科技,荣桓世远,奕鑫信投,无限财富,领峰金融,圈融网,天天利,富淼财富,兔子金融,车丰汇,鼎鲁班,满满金服,程诺金服,好运财富,江腾金融,九猫投资,钱加网,保全财富,华夏信,天之浩投资,国宝投资,医融行,惠金创投,丰成创投,中赢创投,聚铢投资,信安财富,爱派金信,惠民金融,易车理财,钱冠理财,天府投资网,弘高财富,锦瑞财富,财智投资,财富在沃,信达金服,金龟子,中腾投资,赞度ZanDo,爱优益,我就爱车,明启华投资,大象在线,徽通金融,永盈财富,钱匣子,鲁华财富,浙星财富,德信财富,瑞城财富,聚宝盆,小鸟在线,小微所,趣理财,重友财富,泓然控股,徽煌财富,第四市场,伊凡诺投资,胜达投资,永利天成,网金宝,易融财富,冠圣投资,证金宝,百事得财富,安盈汇通,鸿磊财富,财团网,新添利,亿鑫金融,聚联创投,滨泰资本,金畅想,盛世财富,广西臻信,玉丰投资,普金吉,大鱼金服,万晶聚金融,晨诺财富,光达君合,金猫在线,蜜蜂聚财,德誉P2P,显峰财富,典金财富,智富圈,汇鑫益,辉煌财富,金罐子,益得创投,拉美金金融,迁安金融,去哪投,天基投资,锋逸信投,银都创投,红云创投,坤隆投资,宋财聚宝,富源创投,铜穗子,龙泰财富,蓄利宝,国曼投资,金蚂蚁,爱财客,帮你投,小样金融,源牛金融,暴雪金融,金融买卖,虎袍金融,沃普惠,永利理财,茂业金服,西润投资,乘10理财,金创财富,恒通金融,联丰投资,贺翔财富,金利源,贵金所,惠金金服,宝筹网,金拍当,潜力股,钱客金融,安农e商,茶金所,冰莹财富,京圆柚理财,汪达财富,百信财富,乾韵财富,百家财富,天行信,融华财富,小企业e家,乐富宝,海豚在线,互联行,泛融网,汇旺宝,中都投资,易米阳光,芭比理财,领鲜理财,联正金融,宜企融,鑫宝鼎投资,台商金融,金钥匙财富,嘉富财富,嘉金金融,合肥亿人财富,乾东宝,钱来钱网,商鼎投资,信德创投,青创财富,尚融财富,立帮财富,鑫汇融合,融汇创投,四联财富,泓润恒业,红景创投,汉本在线,点金财务,鑫汇在线,鼎瀚金融,金元开泰,新濠财富,顺祥投资,中桂联投资,年享财富,崇汉财富,惠亿信投,玖宝创投,聚金金融,财源网,浚豪理财,信用本,立洲金融,易起创投,苹果投资,文通财富,金玉盈,稳收宝,中广财富,智邦创投,浙融创投,银佰汇,世誉投融城,明熙财富,同创金融,易利通,驰智金融,瑞朝汇,一诺财富,惠投资,亿惠金融,小蜜蜂理财,汇银投资,中投瑞银投资,商荣网,温心创投,长来财富,银翼投资,融信中盛,兴元财富,远古时代,宏高资本,渔夫网,万遇金融,铅笔小鑫,宏飞创投,太湖金融,众信财富,安易融,欧亿投资,金线财富,钜丰信投,易丰信投,安居客理财,中信创投,方圆金融,钱立方,汇金屋,点投网,铁信创投,如通金融,顺发投资,亿梆创投,铭宏创投,隆克利财富,元祥金服,昊澜财富,文海投资,宝典创投,微小宝,邦正投资,民融通,玖伍投资,尚通财富,聚汇财富,中沈投资担保,元一创投,御盛理财,天脉投资,多多投资,艺鑫旺,宏浙投资,京元信,锦祥资产,西部聚财,米粒金融,利丰财富,认合财富,淘金社,宝丰隆,红利金服,易联天下,金泰财富,国融宝,通财富,蓼盛财富,年年有余,华东理财,众储联,云峰财富,祥瑞资管,财意创投,日盛资本,国汇金融,黑蚁在线,德旺鑫,宏阳财富,搜货金服,柒掌柜,鑫环投资,发利网,驾道车融,聚信通,亚秀投资,安泰创投,财先生,聚邦金融,环球创客,方泰财富,鸿强财富,利德丰财富,好融资,添金财富联盟,富富金融,饷当当,中投在线,盛市投资,企联融业,鑫富联博,红杉财富,龙邦投资,珺源财富,万融投资,一点财富,晓微金融,小旺旺理财,赫轩投资,航锐财富,铂利亚,苏丰创投,鑫汇投资,本息宝,友利汇,融通恒信,浦发财富,鑫循环,融之源在线,携行天下,姑苏金融,鸿川投资,融聚通,翔丰财富,聚有利,汇金众盈,188金融,大众创投,银典投资,融益财富,恒融财富,龙腾理财,玉和财富,银诚信,亿方金融,江泰投资,正元资本,惠河财富,真格财富,天玺财富,保本儿,积储在线,富爸爸金融,尚峨金融,创跃财富,钱进家,雅庭金服,凯盈财富,至鼎财富,启明投资,鲸孚融,七八金融,和泰投资,丰彩投资,一起富,巨希财富,芝麻花投资,鑫润投资,永鑫创投,鑫业创投,家和财富,一洲融通,臣中投资,高益创投,时风港,光大信投,东信财富,莱芜财富,金团网,弘道财富,鼎信投资,日月财富,未了财富,三姐投融,满堂金,鼎上聚财,浙平在线,钱城网,厚金资产,都梁创投,幸福财富,惠兴通,安顺财富,宝龙财富,烨懿金融,微银财富,隆富聚财,汇富帮,鑫融城,富嘉资本,互金所,苏信财富,众昌财富,南海创投,微尘聚金,365创投,洽钱网,车妈妈,民大投资,心诚创投,前海银管家,2025金融理财,福利金融,财米,德纯财富,汇丰创投,鑫淼源投资,企银投资,德福财富,乾宝理财,阳天财富,尔达信投,正祥资本,国银财富,凌轩财富,大禹资本,聚来融,毅客网,鼓腰包,易尚在线,金扣理财,互金投资,365天天利,东方创投,乾友金融,懒人投资,懒人投资(粤),什马金融,牡丹财富,壹诺理财,光耀财富,网梦创投,大大宝,康玺在线,黔金所,鼎隆投资,福人创投,世昌金融,云朵轻,点点聚宝,19理财街,科讯网,浩银财富,天天信投,脱贫宝,妃云阁,发展投资,公主理财,源本财富,奇旺投资,卓鹏财富,迈龙财富,银淦诚,亚港投资,云图资本,华融众信,投资无忧,中山投资,投融客,子昂众盈,鑫誉汇,摩根钜通,随心金融,迅银,火融网,国储网,时代金服,多财多益,企之家财富,宝丰财富,趣豆理财,华巨投资,瑞金所,亚通创投,好运来金融,百聚财富,泓然资本,信融创投,共赢在线,盈金创富,煜生创投,金行豆创投,林登财富,尚蒙亿汇,天申金融,惠信宝,冠丰投资,投红木网,农村宝,日宝网,贝米在线,达通创投,融信宝,德利创投,宝通创投,倾诚金融,纳金石金融,盛宇财富,盛达投资,汇客通宝,晟欧财富,益盈创新,汉正街金融,中财所,力投网,汴京财富,隽逸财富,亿信金融,融信达投资,幸汇财富,玖鼎财富,文妥财富,天豪财富,和盛在线,新天成,嘉骏创投,惠盈在线,金融巷,政信金融,盛天创投,丰谦创投,步华投资,信美财富,良信财富,6金所,中银资本,德鑫财富,江淮财富,莲花财富,亨通创投,运兴嘉筑,银泰发,信金所,巨石财富,苏金所,腾云金融,大米微金融,福福金融,满仓赢,丰收宝,百家财富,金意创投,鼎合资本,微投所,同鑫创投,协众财富,日旺顺,北部湾财富,敏迎投资,中财在线,有米行,悦阔财富,金豆豆,吉泰理财,万钧财富,飞腾财富,弘昌创投,东岳金融,嘉庆创投,789金融,百投邦,鼎天在线,中融金服,警安财富,世纪创想,招宝万金,鸿运当投,妙慈投资,同城三个帮,赢富达,顶顶网,赤盈宝,协盈网,财富汇,富沧金融,聚宝通,金百利,武汉多利宝,摇钱树,摇钱树(浙),金元宝,林泰投资,坤元财富,德赛财富,民生创投,国汽金融,亿谷财富,舀米网,港兴投资,财保宝,多彩多乐,泉旺创投,银联融投,投之家,存米网,钱市网,宏能投资,融宝网,港投创本,昊天投资,度金网,中纳联投,象宝宝金融,隆辉财富,信融汇金,贵福财富,周道财富,纯嘉投资,金地信投,中海融通,墨竹轩电子,财行者,中银汇通,融创财富,京银财富,天惠投资,信利财富,财益创投,财富园,建明财富,58钱管家,盛德多投资,金钱谷,金宝会,召鑫财富,盛世汇盈,金中信,浩万投资,鼎鑫资本,金砖财行,咏湘鑫,金银丰,盈富投资,银际财富,元一投资,惠利宝,北斗金融,联璧金融,翰爽投资,恒丰信投,分红宝,老树财富,银坊金融,全家福,海控金融,宝金所,帝业投资,浙配资网,兜着赚,德丰投资,楚商创投,网赢天下,讯燕金服,鼎方投资,温商金融,活宝汇,汇凯鑫创投,春强财富,汾湖投资,鲁润创投,鼎和资本,米迪熊,耀毅投资,晨升投资,平福投资,邦众财富,金房汇,融通聚富,短平快理财,诚德担保,百泓财富,壹视财富,秒淼财富,鸿海资本,同日财富,桔子金融,加利帮,聚融投,万晶聚投资,标晨投资,天晨财富,酷跑金融,朝助创投,汇财宝,康联投,望洲财富,金财通,创金财富,益盛财富,鼎利网,金翌豪创投,壹唯世创投资,达信投资,鼎源资产,华众金服,粤辉财富,金陵财富,言融财富,金瑞盈,瑞金资本,合汇富,豫诚财富,鼎泰益,御声资本,祥富春投资,金政创投,万合理财,元邦创投,汇瑞财富,德塞财富,大家网,安融网,哈富在线,银欢财富,美嘉创投,立鼎资本,油财宝,精理财,粤利通,亚盛财富,纵横投资,诸葛E投,天齐金服,亚厚财富,斯格瑞特投资,联保通,巴中中汇,融大在线,爱蚂蚁,环球财富,璀璨明珠,新聪理财,聚商一百,龙源金融,点道投资,鲁滨易投,鑫广顺,信仁财富,睿筹财富,卓彤网,力元投资,合胜昌,共时理财,鑫浩伟融,益满金,信农普惠,博银财富,爱承兑,宝丰财富,融信金融,金钱窝,六顺财富,富豪创投,钱海创投,舜添泽财富,卓越财富,邦慧投资,宝翔投资,网金财富,网借宝,信达财富,君茂财富,盈通投资,安旺P2P,贵禄财富,圆晟行,九鼎投资,蔬泽创投,拜腾财富,余下钱,咱去投,草原理财,999理财,祥晨财富,云鼎汇融,惠仁财富,律邦融安,钱来钱网,好融网,合筑资本,广融钱多多,华商财富,宜聚宝,旺金所,鼎力投资,君孚财富,马上有钱,晋财金服,威泰创投,合众融通,鼎日投资,恒运坤城,子时金服,奇象理财,翰益投资,丰登宝,信誉财富,穗实财富,善安合财富,泯华创投,云融通,格瑞金融,英邦投资,盟邦天下,维沃财富,宝仕金融,钰泰财富,玺融资本,德利汇金,天融财富,万利创投,黄山资本,升财网,信信在线,仁济资本,帮客创投,光谷惠众,张家港金融网,融易在线,随手记,超额宝,牛宝宝理财,有存网,君掌柜,信捷投资,永信在线,商帮金融,银儿响,泓蕴添利,齐东方,联融易,一加二金融,中续投资,钱塘人家,融锦金融,万元财富,互金宝,中恒盛业,米兰金融,六合网,钱江理财,远行者,渝商金融,华强财富,明珠创投,飞融网,太安全,梧桐金服,国阳投融,煐特投资,闹钱网,人人金融,上海易端投资,岱宗会,亚投财富,时诗运,躺赢财富,巨鑫财富,祥富春投资,财源创投,投客网,润海创投,润发财富,恭信资产,永利财富,鑫发创投,紫金创投,聚福银汇,一路发创投,大众易融,国鼎投融,信誉99,国创投资,集金,理财保姆,惠民财富,金赋财富,金鑫创投,一诺创投,乾龙在线,旅融在线,富亿理财,海金社,浙亚财富,鸿湘堂,硕宝投资,天达创投,启德财富,粤财汇,乡信,金策通,融兴理财,三明股份,时时宝,龙腾华人财富,小管家,太有乾,中银投资担保,琳鹏创投,诚甄财富,川惠财富,佰易投,力合创投,财金圈,天利诚投资,多点金融,51汽车众筹,安信普华,黑米财富,佳通创投,英大创投,沃坤投资,鹿城资本,珊湖财富,五洲财富,云腾信,茂荣投资,中亿华商,巨元优财,中兴财富通,新中金财富,华容创投,易信云投,助行投资,乐城投资,互诚宝,中源资本,小苏帮客,益聚宝,玖信理财,风瑞投资,联合金融,华融天成,好存折,JFCC网聚天下,鼎瑞投资,江南创投,融昌理财,微方财富,小丫P2P,互利通,太阳金服,宝易通,耀升信投,平海金融,盛合金融,九五理财,小微钱铺,天成投资,如信网,你财富,优利网,鲁源金融,信邦财富,文茂创投,利典金融,唯吾财富,宜盛宝,金泰达投资,永泰达投资,微客金服,零花钱,银投信,钱宝网,聚信行,荷包金融,南瓜P2P,华人投,玉象金融,自由金服,旗融网,东朗理财,微微金融,中盈金服,华盈金融,茗圣创投,元亨泰富,苗岭信投,余恒金融,中富润德,优宝汇,菲润天下,沪丰金服,FCC俱乐部,汇博金服,金球所,恒慧融,尚古天下,商房所,如翌金融,欧金宝,爱多银,勋彩投资,钢镚在线,加财金服,彦宏金融,小胖理财,小行家金服,小微理财,亚泰普惠,融盛创投,燕凡钰金融,携盛金融,正大金融,小满金服,博源投资,信邦创投,理财大赢宝,尧瑞投资,久久财富,普惠财富,鑫泽恒投资,云金融,金麒麟,光大富尊,建泰投资,大神金融,大酉在线,久盈投资,度尔投资,明利财富,广融财富,寸芒金融,车期汇,万盛金服,万三网,熙牛金服,瑞城金融,万顺网,融荟财富,鲁银所,鼓浪金服,汇恒财富,快投机器,鸿融网,综财投资,三国财富,海发财富,众亮金服,点金财富,胜和财富,好富金融,一起投,胜天金融,陆金服,鑫乾财富,祥仁投资,金汇瑞通,安泰卓越,大集金服,华纳汇盈,钱上钱,佑米金融,泰金服,鹭岛金服,金豆子,金财蛙,鑫宏资本,当天金融,快帮网,趣抓钱,腾略创投,盛融宝,宏创金融,行银创投,金钥匙,金联创,优加聚财,宏润共创,爱收租理财,艾利财富,盈信网,众银财富,妥妥赢,虹洲金融,红运金服,银号理财,帮帮财,17来财,巨牛财富,远程金服,金茂源,中泰盈,乾客天下,银信金融,汉泽天下,京商网,慧鑫财富,溪安金服,满亿宝,皇金所,金利网,金饭碗理财,翼汇财,即利宝,智慧财神,坚果理财,优衔金融,宏亚金融,投米乐,微齐金融,指旺财富,卓武投资,维博信盛,东上金服,小草金融,盛新财富,罗威财富,宜融投,六点一客,元兴财富,际盈财富,钱富宝,富满多金融,麦穗金服,七彩池,钱财富,钱易网,人爱金服,中惠赢通,创宏利,万霖财富,万汇通,祥龙创投,天宏投资,欣融投资,来力采,梦熙金融,佳佳盈,焱丰金服,福米金融,贝米钱包,滚利金服,宏悦财富,众信创投,众人理财,蜂赢金服,鸿沧资本,缑祥投资,玩理财,大家在线,易投,银盛亿达,齐乐融融,聚翔金融,生息金服,倪孟财富,聚友创投,壹担金,红星所,小金库,沪乾投资,萌芽金服,力为投资,乾信金融,永生投资,乐优车,天使计划,享投网,浙风金融,捷麦理财,商信理财,一点金库,鑫贝通宝,正经事理财,啄米理财,鑫宝宝,铜牛聚财,襄信金服,零薪投资,时鸿投资,金阐投资,车商金融,力意财富,亿港财行,聚兴财富,旭东财富,港视金融,安稳财富,融达财富,奔荣金融,迈度BANK,君昌投资,御托贸易,禹龙投资,布格拉斯财富,创冠金服,东谦投资,财金盟,凯发财通,财富柜,旺融财富,管家金服,博节金融,万鑫财富,稳稳盈,福祥创投,信丰财富,鼎丰投资,高利投资,交通易投,叶子金服,鑫荣咖,华夏万家,有理树,贯通金服,好借好还,小当家理财,高风金融,阜阳金融网,恒昇财富,龙龙理财,阳光财富,金坤投资,包公有财,京大财富,富车在线,爱生息,5A聚宝盆,i投资家,全网慧通,亨丰理财,金蝶财富,金橙财富,八哥理财,赶钱网,鑫龙金服,靓钱宝,车道财富,金投互联网,土豪理财,爱换钱,长涛金融,金融博士,灿星财富,汇集金融,苏商投资,快有家,澳达天翼投资,金行财富,8号金铺,虹权投资,鸿顺金融,上开投资,日收宝,正合源盛,钱所未有,快车财富,友诚信财富,钱都金服,钱坤宝,怡盛鼎丰,尊诚财富,旺隶轩金服,汇淘金,惠利银通,财神在线,华美投资,丰宏投资,明德创投,E财金融,应文投资,鹏翔金服,福翔创投,51丰收宝,旭美投资,中赢瑞银,农金所,投友圈,妈妈金库,融途天下,宝诚金融,久金投资,财术理财,朋泉资本,钱夹,聚宏源财富,云财富,房众金融,有利金服,中闽创投,网金所,天洋金融,星云网,舒畅理财,金谷创投,汇融财富,拓金投资,苏米计划,贝尔创投,津启宝,皓月金服,周知理财,易麦理财,万达金融,地球人金融,万创金融,翱太金融,众投网,玛瑙湾,滚雪球理财,顺心理财,秋田财富,小智理财,金猪理财,钱包金融,金吉利宝,大账户,沃享财富,小马资本,土土金服,华泰金融,小鸽理财,秒钱,萌橙理财,笑脸金融,丰通财富,吆鸡理财,狐小狸理财,泰阳信诺,金米米理财,亿人财富,富民财富,地浓金融,诚信金融,云端金融,白金钱包,太安宝,有财气,嗷呜宝,金贝猫,鲁小姐理财,智新宝,几何金融,汇诚普惠,首投理财,领钱儿,金叶金融,e富邦,上海圆慈投资,耀隆财富,阳光富道,财通集团,小滨金融,盛丰金服,博安杰,承国财富,网格金服,乐钱宝,掌悦理财,锐银理财,票票喵,用呗金融,火理财,快鱼金服,园宝金服,旺马金服,晋商金服,派派金,金满赢,微微理财,安快金融,安创理财,索星金服,钱秘书理财,人和金服,粤盛金融,来浙投,得力金服,普汇宝,麦麦理财,启点金融,凡太聚宝,农金宝互金,牛人街,弹钱吧,余小财,小余在线,讴业普惠,金刚金服,鑫路金融,小金袋,板板金服,中青网投,中新金服,e鹭理财,乾诚金服,融牛在线,佳乾财富,花生投,智慧财,加财猫,鼎财富,初见理财,喵理财,钱融融,坤泉理财,萌小薪,唐人钱包,巨潮金融,积财金融,开金所,福运金控,帝象金融,鲸明理财,合贝金服,鑫银宝,金竹金服,财米薪,浙鼎金融,沃顿金服,元泰资本,汇银富通,UU理财,融桥网,高财生,阿尔法金融,协融所,利通金服,蓝海金融,普汇聚财,重信合伙人,润银所,凹凸凹金服,社金互联,恒福金融,恒银普惠,瑞盈金服,悦财湾,增小钱,三一金服,御坤财富,及时赚,浣熊理财,聚富蛙,米袋子理财,恒泰金服,极智金融,抓钱猫理财,金苏在线,金坳财富,汇富万家,一两金融,濡江财富,多米金融,安合网,聚业金服,美环艺速,互赢金融,快约金服,海贝金融,鱼贝金服,立信投资,多点金服,惠信网,开心宝财富,8090理财,天达金融,贤钱宝,予财缘,悠哉猫,嵩元金服,钱宝财,恩之汇,营普金服,添财星,萨飞资本,科融宝,汇银融通,方捷金融,翡翠岛理财,丰宝金服,蚁众金信,易投杭,百荣金服,必越网,百善投资,穆金所,双优资本,车励享理财,菠菜理财,鑫格理财,河南亿人,咕咕理财,金碗理财,百年银子市,网恒在线,牛信金融,盾金所,1号领投,企商理财,小财迷,城道理财,板凳理财,51财融融,我能理财,睿恒钱贝网,妙银理财,叮叮理财,全融网,惠财,统逸资产,慧米财富,福气钱庄,汇善金融,盈信金服,赚吧理财,亲密+,秀秀金服,寓财金融,365储蓄家,满宝金服,俊掌柜,金点金服,邦邦理财,信域金融,观鑫网,投钱侠,花生票号,微金投,榄盛邦,懿金服,金牛聚财,微米在线,贝果金融,91飞猫,利创投,爱嘉富,信联商融,蜜蜂互惠,储钱箱,金蛐蛐,金蝠,双赢地带,金柚金服,米宝理财,聚龙理财,时光金融,盈票理财,团聚创投,红小宝,雨桥金融,互存金融,车蚁金服,鑫汇龙跃,银海金服,小灰熊金服,桑善金服,贝多芬财富,五福理财,旺力金融,利群在线,国恒金服,利投网,猫咪财富,点聚财,沃和金融,大家赢金服,鲸亿金服,存钱家,善果金融,呱呱金服,资产家,乙松金服,金呗金服,丰丰金融,往来金服,小象金融,元正财通,中外建金融,四喜进宝,易安管家,秉利金服,星云理财,云云财富,余薪乐,金大圣,长财宝,繁锦财富,锤子金融,毕投金服,乐赢金服,美银,资越投资,纵横理财,厚沃财富,融配达,宝洋财富,中鼎国服,百贾金,米格金服,四海金服,天伦金服,金羊金服,易米融,诚成尚凌,小融金服,普益金服,亿舜金服,点金金服,哲朴金所,极速猫理财,利利金服,鱼米金服,联邦金控,泓源资本,乐毅金服,实力派,甘肃惠融通,源如盛财富,喜袋网,金互行,睿米金融,通易融,种豆宝,掌钱,筑金,58钱柜,寅丰联,摩码金服,众力普惠,邦金所,福乐猪,北极熊链盟,户部金服,Tronker创客,e利友,专投网,仁信金融,微融资,卓远金服,渔樵咨询,寰玥Online,安投网,投桃理财,新城金融,债融易,律合金融,乐为金融,百财网,联银普惠,格子理财,中盛金融,紫薇金融,跃马财富,惠丰钱生钱,天辰智投,浩融益,湘坤融,亿润福,福贝金服,德易融,顺势宝,金额宝,浙农金服,优居金融,惠普在线,P兜理财,杭文投,点点搜财,信融天下,环市金服,胖猫宝,商户通,久融理财,超慧理财,和掌柜,纳泓普惠,普道财富,中科金服,恒晟金服,优本财富,铭泽创投,惠家理财,,金盛永利,普众房融通,枫叶理财,时间金融,小金理财,挖挖融,融迎宝,壹金宝,名优金融,聚信阳光,新常态财富,彩豆普惠,D金服,乾来聚惠,富门理财,贺邦投资,科瑞财富,鲁西金融,金抽屉,诸葛理财,宏鸣财富,维佳投资,优财网,领秀创投,东兴达投资,全优理财,悟净理财,黎明创投,汇兴投资,泰博投资,硕丰财富,前海机器人,皖北金融,蓝海创投,商票通,金通财富,金茂在线,约定理财,成明创投,江淮在线,信鑫盛汇,太力财富,利多多,宝峰创富,金鼎和财富,玖那里金融在线,值投网,有闲钱理财,信谊金融,云豆豆金融,荣瑞财富,v客宝,浪尖金融,慧投网,牛王在线,亿泰格翔,承跃财富,小眼镜,沃融投资,蜂窝创投,苹果财富,恒源投资,跃坚财富,快车在线,世纪金投财富,天下投,盈优理财网,信诺金融,天恒泰财富,钱理宝,红枫创投,汇通金融,东升财富,恒宏投资,东创投资,三方创富,久朋投资,和信赢天下,银杉资本,鑫亿财富,利双赢,旭晟金融,投融宝,金猪猪,乐园财富,汇旭财富,理财嘉年华,德益网,盛财富,赢河财富,宜投融,天琴创投,融泰创投,宏基财富,德尚创投,帝信网,智律金融,积木金融,益弘投资,成富宝,泰金融,融诚网,广盛宝金融,鼎超智能科技,阜阳融资网,永润投资,胡巴在线,金融家在线,军成财富,德勤财,聪付宝,金贝财富,盈丰在线,爱融汇,坤盛财富,银凤网,信资邦,亿财富,学易融,胜手点金,喜蓝理财,华夏投,三晋聚财,吉石宝,自金网,点滴投资,投资Kr,至融天下,海诚投资,江山财富,臻鑫配资系统,融金信投资,理理财,盈丰金融,聚融理财,锦宏博汇投资,万代福基金,壹世纪,甬金创投,林坤投资,沙平理财,多么高,泗海在线,昌益财富,东祥创投,佳昌创投,民旺金盒,汇宝创投,康盛投资,金饭碗,石门财富,四维金服,微笑金融,德信投资,理财快线,云中网,日日红财富,种子财富,金正鸿通,商信合财,融易发财富,汇泉投资,亿快创投,有声投资,宏富创投,双兴信投,正诺悦金融,奔富金融,即富财富,增点投资,宇坤投资,美信财富,嘉信创投,惠泽通,小石头理财,中联新源投资,小丸子理财,联汇金融,金旺投资,创励投资,帮荣投资,奥蒙金融,南瓜金融,万方融通,灯融创投,大贺财富,永拓投资,国鑫钱庄,首晟投资,博华创投,益家理财,靠谱投资,润通金融,层峰创融,盛鑫财富,天汇融,车金所,绿之篮投资,易富通,博金在线,国谟财富,首金所,众丁投,港通财富,融投网,闽商金融,微金石,钱呗多理财,益丰阿里,八仙宝,壹本金融,金富汇,央金玛,普金所,投雪球,聚淘理财,亿谱汇,万锦创投,财金投资,M21金融,懒人理财,麻雀财富,玖昌财富,金星创投,益家财富,金信理财,陆金所,深圳萨摩耶,肯瑞特,挖财,万证通,上海淇毓信息科技,360金融,京东金融,中腾信金融,快金融,前海大数金融,利信快捷金融,百度理财,深圳随手科技,美团金融,肯特瑞财富,肯特瑞小金库");
        map.put("52230", "互联网基金,网络基金");
        map.put("74000", "第三方支付,支付宝,财付通,翼支付");
        map.put("1A121", "运动服装,耐克,阿迪达斯,安踏,运动服,鸿星尔克,乔丹体育,匹克体育,匹克运动");
        map.put("1A122", "运动器材,球拍,跑步机,哑铃,健身机,跑步机,训练器");
        map.put("1A222", "专科医院,文登整骨,骨科医院,口腔,不孕不育,男科,洗牙,康复,牙科,牙医,眼科");
        map.put("1A221", "体检,美年大健康,爱康国宾,瑞美医疗,优联健管,美亚健康,美惠欧莱福,华检医疗,MHH美兆,第一健康,名流健康,金域检验,艾博健康,艾迪康,景康门诊部,乐金健康,邦尼康,福华健康,民盛健康,元化健保,家年健康,华兆益生");
        map.put("52400", "交易类投资产品,交易所,交易资金结算");
        map.put("13112", "家具,家具,家私,宜家,美凯龙,无印良品,诚培利商贸");
        map.put("12120", "箱包,箱包,书包,旅行箱,行李箱,,手提包,女包,新秀丽,SAMSONITE,日默瓦,拉杆箱,秉臣科技,天盈贸易,提箱,爱思集团,ACE爱思,润米科技");
        map.put("12141", "球鞋,球鞋,nice好赞,上海识装,毒,北京好赞移动");
        map.put("12142", "皮鞋,皮鞋");
        map.put("12143", "运动鞋,运动鞋,旅游鞋,登山鞋");
        map.put("16400", "网上购物,电子商务,电商,网购,云商,网上商场,网上购物,心选,优选");
        map.put("21930", "运营服务,福禄网络,漫道科技,新锐网络,带货助手");
        map.put("11280", "方便速食,方便面,自热火锅,阿宽红油面皮,好哥们酸辣粉");
        map.put("12140", "鞋,鞋垫,鞋业,修鞋,制鞋");
        map.put("13260", "养老院,敬老院,养老院");
        map.put("41720", "商业养老,企业年金,企业养老,平安养老,泰康养老,安邦养老,大家养老,长江养老保险");
        map.put("42700", "社保养老,养老基金,市养老保险,县养老保险,企业养老,机关养老,事业养老,单位养老,区养老,基本养老");
        map.put("19310", "专业考试,注册会计师协会,资格考试,认证认可协会,二建,一建,二级市政");
        map.put("19200", "培训升学,小学,中学,大学,学院,技校,招生办,学信网,学校,自主招生");
        map.put("74100", "第三方支付--提现,易智付,百付宝,翼支付,捷付睿通,中投信科");
        map.put("17100-1", "节日,春节,新年,新婚,五一,圣诞,端午,中秋,生日,乔迁");
        map.put("13230", "物业取暖,取暖,供暖,采暖,物业,供热");
        map.put("13130", "家居用品,纺织品,家居用品,海澜优选");
        map.put("18111", "洗浴/汗蒸,水善汤泉");
        map.put("11160", "自助餐,餐,烤肉,火锅,涮烤,骨头,涮羊肉,披萨,美食");
        map.put("21940", "商务租赁,深圳华德思诺,展柜,展台,展馆,参展,会展,展示柜");
        map.put("52120", "他行理财,平安橙子,你好银行,直销银行,上行快线,工银融E行");
        map.put("62200", "消费贷,玖富消金,马上消费,活力花");
        map.put("41010", "保险平台,泰康在线");
        map.put("16450", "电商生鲜,美菜网,中粮我买,喵先生,本来生活,每日优鲜,爱先蜂,谊品互联,北京滴哩网络,青麦供应链,知花知果,果之源");
        map.put("18233", "打赏,喜欢作者,赞赏,打赏");
        map.put("21400", "办公耗材,金山WPS,打印机,订书,票据夹,档案盒,文件夹,名片盒,档案袋,文件套,报告夹,板夹,装订,复印纸,A4纸,绘图纸,绘图仪,打印纸,硒鼓,计算器,美工刀,七支刀,大头针,裁纸刀,大头针,双面胶,胶带,扫描仪,账本,复写纸,印章,办公用品,办公耗材,碳粉,墨盒,固体胶,金山办公");
        map.put("21110", "知识产权,盈智信科");
        map.put("22400-1", "第三方支付--商家提现,点佰趣,拉卡拉,易生支付,国通星驿,哆啦宝,合利宝支付,捷付睿通,宝付网络科技,乐刷科技,捷付睿通");
        map.put("14270", "代驾,代驾");
        map.put("18410", "城市综合服务,爱南宁,锦州通,广佛通");
        map.put("15210", "网络服务,迅雷,网盘,百度云,邮箱,加速器,下载");
        map.put("13131-1", "日用杂货品牌,旋木时光,名创优品,诺米家居,PUEBCO,UNICO,FRANCFRANC,AFTERNOONTEA,中川政七,KIKOF,山崎实业,九木杂物社,泡泡玛特,POPMART,朴坊,SIMPLEMILL,小米有品");
        map.put("16460", "虚拟商品,福禄商城,发卡吧,网易藏宝阁,点卡,Q币");
        map.put("16470", "风险商户,（特约）巨优惠,前海亿博盛（融资租赁）");
        map.put("1A250", "医护用品,北京南丁科技发展有限公司,医疗器械,医疗用品,医疗科技,医疗设备,康复器材,康复机");
        map.put("14230", "汽配维修,康达慧尔商贸,壳牌,轮胎销售,润滑油,轮胎经营,钣金喷漆,汽修");
        map.put("00001", "行内BIN码,303,356837,356838,486497,622660,622662,622663,622664,622665,622666,622667,622669,622670,622671,622672,622668,622661,622674,90030,622673,620518,621489,621489,621492,620535,623156,621490,621491,620085,623155,623157,623158,623159,623253,622657,622685,622659,622687,625981,625979,356839,356840,406252,406254,425862,481699,524090,543159,622161,622570,622650,622655,622658,625975,625977,628201,628202,625976,625339,622801,625978,625980,625974");
        map.put("12130", "配饰,FLYINGTIGER,兰诺金典,THEGREENPARTY,,眼镜");
        map.put("13240", "租房平台,安居客,链家,我爱我家,贝壳找房,贝壳平台,自如生活,蛋壳公寓");
        map.put("19140", "新闻资讯,头条,劲球信息,每日趣,阅见天下");
        map.put("1A220", "挂号门诊,健康山西");
        map.put("16500", "抽奖,抽盒");
        map.put("11290", "肉蛋制品,鹌鹑蛋,卤蛋,牛肉,羊肉,猪肉,肉档,肉店,肉铺,肉食,肉卷,肉块,肉片,鸡肉,鸭肉,胸肉,鸡蛋,鸭蛋,鹅蛋,鹌鹑蛋,骨头,排骨,水产,鲜活,海鲜摊,冷鲜");
        map.put("1112C", "私房菜,私房菜,闷锅,秘制");
        map.put("18112", "足浴按摩,足疗,按摩,锥拿,足浴,足道,修脚,乐摩吧,推拿");
        map.put("18600", "星座生肖,生肖,星座,测测,加持,开光,上师,大师讲解,解梦,占卜,算卦,算命,白羊座,金牛座,双子座,巨蟹座,狮子座,处女座,天蝎座,射手座,魔羯座,水瓶座,双鱼座");
        map.put("17000", "社交人情,生日管家");
        map.put("15400", "综合缴费,一网通办,自在社区");
        map.put("14200", "私家车,油呗,车辆费用");
        map.put("41100", "健康险,平安健康,相护宝,轻松保,重疾险,大病医疗");
        map.put("1812C", "音乐餐厅,音乐餐,微博王国,餐饮娱乐");
        map.put("21860", "税务,国税,地税,报税,关税");
        map.put("21800", "运营费用,履约");
        map.put("21300", "工程款项,挖掘机,压路机,工程,项目,挖机,吊装,吊卸,塔吊,叉车,检修,搅拌机,验收,压机,脚手架");
        map.put("21820", "缴纳税款,地税,国税");
        map.put("21000", "办公支出,办公费,办公款,做账,交际费,审计,分润");
        map.put("30000", "疑似薪资,1月,2月,3月,4月,5月,6月,7月,8月,9月,10月,11月,12月,一月,二月,三月,四月,五月,六月,七月,八月,九月,十月,十一月,十二月");
        map.put("19400", "文具,尺子,圆规,直尺,刻度尺,中性笔,圆珠笔,钢笔,铅笔,彩铅,橡皮,胶水,胶带,水笔,墨水,修正液,修正带,黑板,粉笔,文具,文教用品");
        map.put("18100", "线下娱乐平台,云投币,娱乐城,娱乐会");
        map.put("31100", "离职补偿,离职补偿,离职结算,裁员");
        map.put("32200", "劳务收入,佣金,付佣,中介费,代办");
        map.put("1812B", "电玩城,大玩家娱乐,家庭娱乐,娱乐中心");
        map.put("11336", "洋酒,洋酒,进口酒");
        map.put("11337", "茶叶,茶业,茶叶,乌龙茶,龙井茶,铁观音,碧螺春,普洱,大红袍,茶事");
        map.put("11338", "咖啡,咖啡,瑞幸咖啡,咖啡馆");
        map.put("1C200", "非税缴纳,财政,非税,电子政务,人民政府");
        map.put("1112B", "水煮鱼,水煮鱼,石锅鱼,沸腾鱼,泡泡鱼,啤酒鱼,酸菜鱼,鱼你在一起,鱼还是鱼");
        map.put("11130", "西餐,豪客来");
        map.put("31000-1", "平台工资结算,司机提现,嘀嗒用户");
    }

    public String eval(
            String accountName,
            String account,
            String currencyCode,
            String transactionCode,
            String transactionAmount,
            String borrowFlage,
            String businessCode,
            String summary,
            String accountChinessName) {

        return processData(accountName, account, currencyCode, transactionCode, transactionAmount, borrowFlage, businessCode, summary, accountChinessName);
    }

    //数据的格式
//    private static class Data {
//        private String accountName;         //对方户名
//        private String account;             //对方账号
//        private String currencyCode;        //货币代码
//        private String transactionCode;     //交易代码
//        private int transactionAmount;      //交易金额
//        private int borrowFlage;            //借贷标志
//        private String businessCode;        //业务代号
//        private String summary;             //摘要
//        private String accountChinessName;  //账户中文名
//
//    }
    private String processData(String accountName,
                               String account,
                               String currencyCode,
                               String transactionCode,
                               String transactionAmount,
                               String borrowFlage,
                               String businessCode,
                               String summary,
                               String accountChinessName) {


        try {
            //===========================================================================================================================================
            //                                                        todo 处理0优先级
            //===========================================================================================================================================
            if (isContain(summary, "退款") && isContain(summary, "微信转账")) return "74100";
            if (isContain(summary, "退") && isContain(summary, "押金、订金、定金") && isEqual(borrowFlage, 0)) return "22121";
            if (isContain(summary, "退") && isContain(summary, "保证金、意向金") && isEqual(borrowFlage, 1)) return "21811";
            if (isContain(summary, "退") && isContain(summary, "保证金、意向金、押金、定金、订金") && isEqual(borrowFlage, 0) && isNotContain(summary, "车、房"))
                return "21121";
            if (isContain(summary, "退款") && isContain(summary, "阿里巴巴") && isNotContain(summary, "文学")) return "21101";
            if (isContain(summary, "退") && isContain(summary, "健身、运动、私教")) return "1A101";
            if (isContain(summary, "退款") && isInLibiary(summary, new String[]{"19130"})) return "19131";
            if (isContain(summary, "退款") && isInLibiary(summary, new String[]{"18400"})) return "18401";
            if (isContain(summary, "退") && isInLibiary(summary, new String[]{"18230"})) return "18232";
            if (isContain(summary, "退款") && isContain(summary, "微信红包、QQ红包")) return "17111";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"16420", "16420-1"}))
                return "16421";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"15110"}))
                return "15111";
            if (summary.contains("退费") && isContain(summary, "联通、电信、移动"))
                return "15111";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"14400", "14410", "14430", "14460", "14500", "14510", "14531"}))
                return "14401";
            if (summary.contains("退") && summary.contains("车") && isContain(summary, "款、费"))
                return "14201";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"14140"}))
                return "14141";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"14111", "14112"}))
                return "14113";
            if (summary.contains("退") && summary.contains("房") && isNotContain(accountName, "酒店、宾馆、旅社"))
                return "13217";
            if (summary.contains("退") && summary.contains("房") && isContain(summary, "款、费"))
                return "13201";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"12210", "12210-1", "12210-2"}))
                return "12211";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"12140", "12141", "12142", "12143"}))
                return "12144";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"12130", "12131-1", "12131-2", "12132"}))
                return "12133";
            if (summary.contains("退") && isContain(summary, "手表、钟表、腕表、配饰、饰品"))
                return "12133";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"12120"}))
                return "12121";
            if (summary.contains("退货") && summary.contains("财付通"))
                return "10001";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"11100", "11120", "11121", "11122", "11123", "11124", "11125", "11126", "11127", "11128", "11129", "1112A", "1112B", "1112C", "11131", "11132", "11140", "11140-1", "11141", "11142", "11143", "11144", "11144-1", "11145", "11146", "11147", "11148", "11149", "11150", "11151", "11160"}))
                return "11101";
            if (summary.contains("退") && isContain(summary, "食品、农副产品"))
                return "11201";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"11220"}))
                return "11221";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"11240-1"}))
                return "11241";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"11260", "11260-1"}))
                return "11261";
            if (summary.contains("退款") && isInLibiary(summary, new String[]{"11270"}))
                return "11271";
            if (summary.contains("退") && isContain(summary, "烟、酒、茶"))
                return "11301";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"11310", "11331", "11332", "11333", "11334", "11335", "11336", "11337", "11338"}))
                return "11301";
            if (summary.contains("退款") && summary.endsWith("HM"))
                return "12111";
            if (summary.contains("退") && isInLibiary(summary, new String[]{"12100", "12100-1"}))
                return "12111";


            //===========================================================================================================================================
            //                                                        todo 处理1优先级
            //===========================================================================================================================================
            if (isKeywordEqual(summary, "无条件退货、二维码消费退货、消费撤销")) return "10001";
            if (isLessThanTransactionAmount(transactionAmount, 0) && isContain(summary, "支付")) return "10001";
            if (isContain(summary, "自助") && isInLibiary(summary, new String[]{"11160"}) && isNotContain(summary, "快餐、海鲜"))
                return "11160";
            if (isContain(summary, "自助") && isContain(summary, "海鲜")) return "11161";
            if (isContain(summary, "伙食费、餐费") && isEqual(borrowFlage, 1)) return "11181";
            if (isKeywordEqual(accountName, "代扣自来水费、代扣电费")) return "13220";
            if (isContain(summary, "装修、装饰设计、装潢") && isNotContain(summary, "厂房、写字楼、酒店、工程、汽车") && isContain(summary, "别墅、洋房、四合院"))
                return "13120";
            if (isContain(summary, "一分钱认证")) return "95000";
            if (isContain(summary, "绑定、支付、银行卡") && isContain(summary, "验证")) return "95000";
            if (isContain(summary, "消费金") && isNotContain(summary, "消费金融")) return "94000";
            if (isContain(accountChinessName, "网联测、银联测试")) return "92300";
            if (isKeywordEqual(accountName, "代收资金冲正过渡户")) return "92200";
            if (isContain(summary, "抹帐")) return "92200";
            if (isKeywordEqual(accountName, "工本费及邮电费收入")) return "92130";
            if (isContain(summary, "工本费") && isKeywordEqual(accountName, "网上银行手续费收入")) return "92130";
            if (isKeywordEqual(summary, "手续费撤销")) return "92121";
            if (isContain(accountName, "汇款手续费") && isNotContain(summary, "手续费撤销")) return "92120";
            if (isKeywordEqual(summary, "短信通服务费")) return "92110";
            if (isContain(summary, "柜面通") && isEqual(borrowFlage, 0)) return "84200";
            if (isKeywordEqual(summary, "跨行取款手续费、跨行取款异地手续费")) return "84110";
            if (isKeywordEqual(summary, "代收") && isKeywordEqual(accountName, "CHN")) return "84100";
            if (isContain(summary, "柜面通") && isEqual(borrowFlage, 1)) return "84100";
            if (isKeywordEqual(summary, "银联ATM取款")) return "84100";
            if (isKeywordEqual(summary, "境外取现跨境取款手续费")) return "83110";
            if (isKeywordEqual(summary, "境外取现")) return "83100";
            if (isContain(summary, "CRS存款")) return "82200";
            if (isKeywordEqual(summary, "ATM取款、自助设备扫码取款")) return "82100";
            if (isKeywordEqual(accountName, "自助设备长款")) return "82000";
            if (isContain(summary, "柜面通错账")) return "81300";
            if (isKeywordEqual(summary, "")) return "81200";
            if (isKeywordEqual(summary, "通存通兑7708转账")) return "81200";
            if (isKeywordEqual(summary, "通存通兑扣款、提出通兑、转账通存扣款、取款")) return "81100";
            if (isContain(summary, "购汇")) return "75100";
            if (isContain(summary, "微信零钱充值账户、支付宝-余额充值")) return "74300";
            if (isContain(summary, "支付宝") && isContain(summary, "银联入账") && isContain(summary, "备付金")) return "74200";
            if (isKeywordEqual(summary, "转账到银行卡、财付通转账") && isContain(accountName, "财付通")) return "74200";
            if (isContain(summary, "微信转账、支付宝转账、微信面对面收款、QQ转账、面对面收款") && isNotContain(summary, accountChinessName))
                return "74200";
            if (isContain(summary, "微信转账、支付宝") && isContain(summary, accountChinessName) && isEqual(borrowFlage, 0))
                return "74100";
            if (isContain(summary, "提现") && isContain(summary, "微信零钱、QQ钱包、支付宝") && isEqual(borrowFlage, 0))
                return "74100";
            if (isContain(summary, "境外汇入、收汇")) return "73200";
            if (isContain(summary, "境外汇款发汇")) return "73100";
            if (isKeywordEqual(summary, "同城自助设备跨行转账")) return "72400";
            if (isContain(summary, "网银跨行汇款失败")) return "72300";
            if (isContain(summary, "大额汇兑")) return "72220";
            if (isContain(summary, "普通汇兑")) return "72210";
            if (isKeywordEqual(accountName, "同名汇户、同名划转、同名钞户")) return "72100";
            if (isKeywordEqual(summary, "转账汇款") && isKeywordEqual(accountName, accountChinessName) && isNotContain(summary, "跨行") && isStartWithLibiary(account, "00001"))
                return "71100";
            if (isKeywordEqual(summary, "卡折转账")) return "71100";
            if (isKeywordEqual(summary, "卡卡转账")) return "71000";
            if (isContain(summary, "司法扣划")) return "66210";
            if (isContain(summary, "证明") && isKeywordEqual(accountName, "国内结算手续费")) return "66100";
            if (isContain(summary, "借") && isContain(summary, "钱、款、费") && isNotContain(summary, "还") && isEqual(borrowFlage, 0))
                return "64240";
            if (isContain(summary, "借款给") && isNotContain(summary, "股东") && isNotContain(accountName, "公司、账户、有限") && isEqual(borrowFlage, 0))
                return "64240";
            if (isContain(summary, "还") && isContain(summary, "钱、款、费") && isEqual(borrowFlage, 0)) return "64230";
            if (isContain(summary, "还") && isContain(summary, "钱、款、费") && isEqual(borrowFlage, 1)) return "64220";
            if (isContain(summary, "借") && isContain(summary, "钱、款、费") && isNotContain(summary, "还") && isEqual(borrowFlage, 1))
                return "64210";
            if (isContain(summary, "借款给") && isNotContain(summary, "股东") && isNotContain(accountName, "公司、账户、有限") && isEqual(borrowFlage, 1))
                return "64210";
            if (isContain(accountName, "银行") && isContain(summary, "信用卡")) return "63220";
            if (isContain(summary, "信用卡中心、信用卡还款、还信用卡")) return "63220";
            if (isKeywordEqual(accountName, "贷记卡卡号") && isKeywordEqual(summary, "购汇")) return "63213";
            if (isKeywordEqual(summary, "网银跨行汇款还款") && isEqual(borrowFlage, 0)) return "63210";
            if (isContain(summary, "还信用卡、信用卡还款") && isEqual(borrowFlage, 0) && isKeywordEqual(accountName, accountChinessName))
                return "63210";
            if (isContain(summary, "信用卡还款") && isContain(summary, "光大")) return "63210";
            if (isKeywordEqual(summary, "转账还款")) return "63210";
            if (isKeywordEqual(summary, "还款-信用卡批量业务")) return "63210";
            if (isContain(summary, "还款") && isContain(summary, "支付宝")) return "63200";
            if (isContain(summary, "信用卡还款") && isContain(summary, "财付通")) return "63200";
            if (isKeywordEqual(summary, "信用卡提现、信用卡转出") && isKeywordEqual(accountName, "贷记卡卡号")) return "63110";
            if (isContain(accountName, "银行、分行、支行") && isContain(accountName, "贷") && isEqual(borrowFlage, 0))
                return "62510";
            if (isContain(accountName, "银行") && isContain(summary, "放款")) return "62510";
            if (isContain(summary, "银行") && isContain(summary, "放款")) return "62510";
            if (isContain(summary, "支付宝") && isContain(summary, "备用金")) return "62120";
            if (isContain(summary, "百度钱包、支付宝、财付通") && isContain(summary, "有钱花、花呗、借呗、360借条")) return "62120";
            if (isContain(accountName, "网贷存管提现过渡户")) return "62110";
            if (isContain(accountName, "零售个贷划款") && isContain(summary, "经营")) return "61220";
            if (isContain(accountName, "零售个贷划款") && isNotContain(summary, "经营")) return "61210";
            if (isKeywordEqual(summary, "车贷") && isKeywordEqual(accountName, accountChinessName)) return "61120";
            if (isContain(accountName, "平安宅易贷")) return "61110";
            if (isKeywordEqual(accountName, "应收他人个人贷款利息")) return "61003";
            if (isStartWith(summary, "放款") && isContain(summary, "借据号") && isKeywordEqual(transactionCode, "2207"))
                return "61002";
            if (isContain(summary, "@1@") && isContain(summary, accountChinessName)) return "61001";
            if (isKeywordEqual(transactionCode, "9649、d077、9645") && isNotContain(accountName, "平安宅易贷")) return "61001";
            if (isKeywordEqual(accountName, accountChinessName) && isStartWith(summary, "还贷")) return "61001";
            if (isStartWith(summary, "第三方代偿")) return "61001";
            if (isStartWith(summary, "提前还款、批量扣款、批处理归还欠款") && isContain(summary, "借据号")) return "61001";
            if (isContain(summary, "微众银行销户")) return "52821";
            if (isContain(summary, "股东还")) return "52640";
            if (isContain(summary, "公司向、公司给") && isContain(summary, "股东") && isContain(summary, "借")) return "52630";
            if (isContain(summary, "还股东")) return "52620";
            if (isContain(summary, "借款给") && isContain(summary, "股东")) return "52610";
            if (isContain(summary, "股东") && isContain(summary, "向公司、给公司") && isContain(summary, "借")) return "52610";
            if (isContain(summary, "入股")) return "52510";
            if (isContain(summary, "股东") && isContain(summary, "投资、入资、垫款、出资、注资")) return "52510";
            if (isContain(summary, "余额宝转出到卡") && isEqual(borrowFlage, 0)) return "52112";
            if (isContain(summary, "理财通赎回")) return "52112";
            if (isContain(summary, "支付宝、京东支付、财付通") && isContain(summary, "理财、小金库、余额宝、零钱通") && isNotContain(summary, "借"))
                return "52111";
            if (isKeywordEqual(accountName, "个人黄金活期保证金存款")) return "51612";
            if (isKeywordEqual(summary, "个人客户签约黄金业务开户费")) return "51611";
            if (isContain(summary, "银证转账") && isContain(accountName, "光大")) return "51521";
            if (isContain(summary, "期货") && isNotContain(accountName, "光大")) return "51520";
            if (isContain(summary, "银证转账") && isContain(accountName, "光大")) return "51511";
            if (isContain(summary, "银证转账") && isNotContain(accountName, "光大")) return "51510";
            if (isContain(summary, "国债分次付息")) return "51430";
            if (isContain(summary, "国债到期")) return "51420";
            if (isKeywordEqual(summary, "发售")) return "51410";
            if (isStartWith(accountName, "代理基金销售") && isContain(summary, "申购失败、退款、撤销")) return "51340";
            if (isStartWith(accountName, "代理基金销售") && isContain(summary, "分红")) return "51330";
            if (isStartWith(accountName, "代理基金销售") && isContain(summary, "赎回")) return "51320";
            if (isStartWith(accountName, "代理基金销售") && isNotContain(summary, "申购失败、退款、撤销")) return "51310";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "理财夜市"))
                return "512H3";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "理财夜市"))
                return "512H2";
            if (isContain(accountName, "EB") && isContain(accountName, "理财夜市") && isContain(summary, "申购"))
                return "512H1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "理财早市"))
                return "512G3";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "理财早市"))
                return "512G2";
            if (isContain(accountName, "EB") && isContain(accountName, "理财早市") && isContain(summary, "申购"))
                return "512G1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "优客理财"))
                return "512F3";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "优客理财"))
                return "512F2";
            if (isContain(accountName, "EB") && isContain(accountName, "优客理财") && isContain(summary, "申购"))
                return "512F1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "阳光金"))
                return "512E3";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "阳光金"))
                return "512E2";
            if (isContain(accountName, "阳光金") && isContain(accountName, "申购待转户")) return "512E1";
            if (isContain(accountName, "EB") && isContain(accountName, "阳光金") && isContain(summary, "申购"))
                return "512E1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "定活宝"))
                return "512D3";
            if (isKeywordEqual(accountName, "定活宝实时赎回透支户") && isKeywordEqual(summary, "本金快速到账")) return "512D2";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "定活宝"))
                return "512D2";
            if (isContain(accountName, "EB") && isContain(accountName, "定活宝") && isContain(summary, "申购"))
                return "512D1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "T计划"))
                return "512C3";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "T计划"))
                return "512C2";
            if (isContain(accountName, "EB") && isContain(accountName, "T计划") && isContain(summary, "申购"))
                return "512C1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "同利计划"))
                return "512B3";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "同利计划"))
                return "512B2";
            if (isContain(accountName, "EB") && isContain(accountName, "同利计划") && isContain(summary, "申购"))
                return "512B1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "年年盈"))
                return "512A3";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "年年盈"))
                return "512A2";
            if (isContain(accountName, "EB") && isContain(accountName, "年年盈") && isContain(summary, "申购"))
                return "512A1";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "九久盈"))
                return "51293";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "九久盈"))
                return "51292";
            if (isContain(accountName, "EB") && isContain(accountName, "九久盈") && isContain(summary, "申购"))
                return "51291";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "半年盈"))
                return "51283";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "半年盈"))
                return "51282";
            if (isContain(accountName, "EB") && isContain(accountName, "半年盈") && isContain(summary, "申购"))
                return "51281";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "季季盈"))
                return "51273";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "季季盈"))
                return "51272";
            if (isContain(accountName, "EB") && isContain(accountName, "季季盈") && isContain(summary, "申购"))
                return "51271";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "双月盈"))
                return "51263";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "双月盈"))
                return "51262";
            if (isContain(accountName, "EB") && isContain(accountName, "双月盈") && isContain(summary, "申购"))
                return "51261";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "月月盈"))
                return "51253";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "月月盈"))
                return "51252";
            if (isContain(accountName, "EB") && isContain(accountName, "月月盈") && isContain(summary, "申购"))
                return "51251";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "双周盈"))
                return "51243";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "双周盈"))
                return "51242";
            if (isContain(accountName, "EB") && isContain(accountName, "双周盈") && isContain(summary, "申购"))
                return "51241";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "七天盈"))
                return "51233";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "七天盈"))
                return "51232";
            if (isContain(accountName, "EB") && isContain(accountName, "七天盈") && isContain(summary, "申购"))
                return "51231";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "阳光天天购"))
                return "51223";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "阳光天天购"))
                return "51222";
            if (isStartWith(accountName, "EB") && isContain(accountName, "阳光天天购") && isContain(summary, "申购"))
                return "51221";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红") && isContain(summary, "光银现金"))
                return "51213";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回") && isContain(summary, "光银现金"))
                return "51212";
            if (isStartWith(accountName, "EB") && isContain(accountName, "光银现金") && isContain(summary, "申购"))
                return "51211";
            if (isKeywordEqual(summary, "理财") && isKeywordEqual(businessCode, "0361、0363、0352、0366")) return "51201";
            if (isContain(summary, "外币T计划") && isContain(summary, "到期")) return "51172";
            if (isContain(summary, "外币T计划") && isContain(summary, "本金")) return "51171";
            if (isKeywordEqual(accountName, "应付定期储蓄存款利息")) return "51161";
            if (isKeywordEqual(summary, "储蓄结息")) return "51162";
            if (isKeywordEqual(summary, "定存宝结息")) return "51152";
            if (isKeywordEqual(summary, "定存宝转活期")) return "51151";
            if (isKeywordEqual(summary, "活期宝一天收益、活期宝收益")) return "51144";
            if (isKeywordEqual(summary, "活期宝撤销")) return "51143";
            if (isKeywordEqual(summary, "约定活转活期宝")) return "51142";
            if (isKeywordEqual(summary, "活期宝转活期")) return "51141";
            if (isStartWith(accountName, "周周存")) return "51132";
            if (isContain(summary, "周周存")) return "51132";
            if (isContain(summary, "安存宝")) return "51131";
            if (isContain(summary, "大额存单") && isContain(summary, "付息")) return "51123";
            if (isContain(summary, "大额存单") && isContain(summary, "兑付本息、到期")) return "51122";
            if (isContain(summary, "大额存单") && isContain(summary, "本金、起息")) return "51121";
            if (isContain(summary, "发行期外提前兑付")) return "51114";
            if (isKeywordEqual(summary, "销户、部提、兑付") && isKeywordEqual(businessCode, "0361、0363、0352")) return "51114";
            if (isKeywordEqual(summary, "对私定期转账取款/销户、到期销户")) return "51114";
            if (isKeywordEqual(summary, "约定定期活转定、活转定")) return "51113";
            if (isKeywordEqual(summary, "约定定期到期本息转活、定转活、本转活期")) return "51112";
            if (isKeywordEqual(summary, "开户") && isKeywordEqual(businessCode, "0361、0363、0352")) return "51111";
            if (isKeywordEqual(summary, "对私定期转账开户/续存、续存、本息续存")) return "51111";
            if (isContain(summary, "光大") && isContain(summary, "定期")) return "51110";
            if (isContain(accountName, "人寿、招商信诺") && isContain(accountName, "代收、代扣")) return "43100";
            if (isContain(summary, "代收保费")) return "43100";
            if (isKeywordEqual(accountChinessName, "健身医保活期专用户")) return "42460";
            if (isKeywordEqual(accountName, "健身医保活期专用户")) return "42460";
            if (isContain(summary, "医保") && isContain(summary, "结息")) return "42450";
            if (isContain(summary, "报销") && isContain(accountName, "医保")) return "42430";
            if (isContain(summary, "医保") && isContain(summary, "报销")) return "42430";
            if (isContain(summary, "基本医疗、市医疗保险") && isEqual(borrowFlage, 1)) return "42410";
            if (isContain(summary, "五险一金、代扣社保")) return "42100";
            if (isContain(summary, "第三方追偿代扣")) return "41630";
            if (isContain(summary, "理赔") && isContain(accountName, "汽车")) return "41620";
            if (isContain(summary, "赔款") && isContain(summary, "京、津、冀、晋、内、辽、吉、黑、沪、浙、苏、皖、闽、赣、鲁、台、豫、鄂、湘、粤、桂、琼、港、渝、川、贵、云、藏、陕、甘、宁、青、新"))
                return "41620";
            if (isContain(summary, "汽车") && isContain(summary, "保费、保险")) return "41610";
            if (isContain(summary, "车险")) return "41610";
            if (isContain(accountName, "财险") && isContain(accountName, "财险")) return "41530";
            if (isContain(summary, "贷款保费")) return "41530";
            if (isContain(accountName, "保险") && isContain(summary, "借据号")) return "41530";
            if (isInLibiary(summary, new String[]{"36000"}) && isEqual(borrowFlage, 0) && isNotContain(accountName, "养老"))
                return "36000";
            if (isContain(summary, "垫付、耗材款") && isEqual(borrowFlage, 0)) return "35200";
            if (isContain(summary, "报销") && isContain(summary, "维修费、货款") && isEqual(borrowFlage, 0)) return "35200";
            if (isContain(summary, "前往、进行")) return "35100";
            if (isContain(summary, "出差、差旅费") && isEqual(borrowFlage, 0)) return "35100";
            if (isContain(summary, "生活费") && isEqual(borrowFlage, 0)) return "34100";
            if (isContain(summary, "救济、扶贫、水滴筹、捐款、捐赠、捐助") && isEqual(borrowFlage, 0)) return "34000";
            if (isEqual(borrowFlage, 0) && isContain(summary, "刷单、刷粉丝")) return "33100";
            if (isInLibiary(summary, new String[]{"33000-1", "33000-2"}) && isEqual(borrowFlage, 0)) return "33000";
            if (isInLibiary(summary, new String[]{"32200"}) && isEqual(borrowFlage, 0)) return "32200";
            if (isContain(summary, "奖学金、勤工俭学、勤工助学")) return "32100";
            if (isInLibiary(summary, new String[]{"32000"}) && isEqual(borrowFlage, 0)) return "32000";
            if (isContain(summary, "党费")) return "31300";
            if (isContain(summary, "个税") && isEqual(borrowFlage, 0)) return "31220";
            if (isInLibiary(summary, new String[]{"31100"}) && isEqual(borrowFlage, 0)) return "31100";
            if (isContain(summary, "余额代发")) return "31000";
            if (isInLibiary(summary, new String[]{"31000"}) && isEqual(borrowFlage, 0) && isNotContain(summary, "集体、农民工、还"))
                return "31000";
            if (isContain(accountName, "代发工资")) return "31000";
            if (isContain(summary, "工资") && isContain(summary, "集体、农民工")) return "22600";
            if (isInLibiary(summary, new String[]{"21300"}) && isEqual(borrowFlage, 0)) return "22500";
            if (isContain(accountName, "商户结算、商户清结算、商户资金结算、备付金、公司提现")) return "22400";
            if (isKeywordEqual(accountName, "分行特色业务298")) return "22100";
            if (isContain(summary, "收付通") && isEqual(borrowFlage, 0) && isContain(summary, "采购、货款、进货") && isEqual(borrowFlage, 0))
                return "22100";
            if (isContain(summary, "受托支付、经营所得") && isEqual(borrowFlage, 0)) return "22000";
            if (isStartWith(accountName, "个人贷款受托支付")) return "22000";
            if (isInLibiary(summary, new String[]{"35000"}) && isEqual(borrowFlage, 1)) return "21A00";
            if (isContain(summary, "报销") && isEqual(borrowFlage, 1)) return "21A00";
            if (isContain(summary, "加盟") && isEqual(borrowFlage, 1)) return "21910";
            if (isContain(summary, "微信广告、小程序广告、宣传、微盟")) return "21900";
            if (isContain(accountName, "银税通")) return "21860";
            if (isEqual(borrowFlage, 1) && isContain(summary, "刷单、刷粉丝")) return "21850";
            if (isContain(summary, "保证金、意向金") && isEqual(borrowFlage, 1)) return "21810";
            if (isContain(summary, "对公代扣") && isEqual(borrowFlage, 1)) return "21800";
            if (isContain(summary, "会议费、农电、商业用电、商业用水、排污费")) return "21800";
            if (isContain(summary, "电费、燃气费") && isContain(summary, "厂、店、铺、企业")) return "21800";
            if (isContain(summary, "采购") && isContain(summary, "礼品、礼物、证书、奖品")) return "21720";
            if (isInLibiary(summary, new String[]{"33000-1"}) && isEqual(borrowFlage, 1)) return "21720";
            if (isKeywordEqual(summary, "工")) return "21711";
            if (isInLibiary(summary, new String[]{"31000", "32000", "36000"}) && isNotContain(summary, "还、代练") && isEqual(borrowFlage, 1))
                return "21710";
            if (isContain(summary, "专利年费")) return "21610";
            if (isContain(summary, "知识产权局、专利局、专利代办") && isEqual(borrowFlage, 1)) return "21610";
            if (isContain(summary, "申请、注册、登记、变更、缴费") && isContain(summary, "专利、版权")) return "21610";
            if (isContain(summary, "房") && isContain(summary, "租、房费") && isInLibiary(summary, new String[]{"21500"}) && isEqual(borrowFlage, 1))
                return "21500";
            if (isContain(summary, "拆迁") && isEqual(borrowFlage, 1)) return "21300";
            if (isContain(summary, "种植、养殖、肥料、饲料、种子、鱼苗") && isEqual(borrowFlage, 1)) return "21200";
            if (isEqual(borrowFlage, 1) && isInLibiary(summary, new String[]{"21100", "21100-1"})) return "21100";
            if (isContain(summary, "收付通、阿里巴巴") && isEqual(borrowFlage, 1)) return "21100";
            if (isContain(summary, "生活费")) return "1B500";
            if (isContain(summary, "给儿子、给女儿、给孩子、压岁钱")) return "1B410";
            if (isContain(summary, "抚养、看护")) return "1B300";
            if (isContain(summary, "体检")) return "1A221";
            if (isContain(summary, "光大e务室")) return "1A200";
            if (isContain(summary, "校园") && isContain(summary, "缴费")) return "19210";
            if (isContain(summary, "班费、学费、学杂费、托费")) return "19210";
            if (isContain(summary, "零钱提") && isInLibiary(summary, new String[]{"18230"})) return "18232";
            if (isInLibiary(summary, new String[]{"18127"}) && isNotContain(summary, "31000、32000、36000"))
                return "18127";
            if (isContain(summary, "聚餐、聚会")) return "18120";
            if (isContain(summary, "救济、扶贫、水滴筹、轻松筹、水滴互联、点滴相互分摊、捐款、水滴互助") && isEqual(borrowFlage, 1)) return "17200";
            if (isInLibiary(summary, new String[]{"17100-1"}) && isContain(summary, "快乐、恭贺、之喜")) return "17100";
            if (isInLibiary(summary, new String[]{"16470"})) return "16470";
            if (isContain(summary, "购精彩")) return "16440";
            if (isInLibiary(summary, new String[]{"16230"})) return "16230";
            if (isContain(summary, "宽带、网络使用、路由器、交换机、光猫")) return "15200";
            if (isKeywordEqual(accountName, "移动电话费")) return "15110";
            if (isContain(summary, "通讯费、话费、流量") && isNotContain(summary, "报销") && isEqual(borrowFlage, 1))
                return "15110";
            if (isKeywordEqual(accountName, "ETC保证金专用户") && isEqual(borrowFlage, 0)) return "14284";
            if (isKeywordEqual(accountName, "ETC充值失败退款") && isContain(summary, "销户、注销")) return "14284";
            if (isKeywordEqual(accountName, "ETC充值失败退款") && isNotContain(summary, "销户、注销")) return "14283";
            if (isKeywordEqual(accountName, "ETC保证金专用户") && isEqual(borrowFlage, 1)) return "14282";
            if (isContain(summary, "闽通卡")) return "14281";
            if (isContain(accountName, "ETC批量代扣")) return "14281";
            if (isKeywordEqual(accountChinessName, "ETC保证金专用户")) return "14281";
            if (isKeywordEqual(summary, "ETC保证金专用户、闽通卡")) return "14280";
            if (isKeywordEqual(accountName, "ETC保证金专用户")) return "14280";
            if (isContain(summary, "租车、车辆租用") && isNotContain(summary, "出租车、报销")) return "14122";
            if (isContain(summary, "房") && isContain(summary, "租金") && isNotContain(summary, "21500") && isEqual(borrowFlage, 1))
                return "13240";
            if (isContain(summary, "房租、房费") && isNotContain(summary, "21500") && isEqual(borrowFlage, 1))
                return "13240";
            if (isContain(summary, "拆迁")) return "13216";
            if (isContain(summary, "13215")) return "13215";
            if (isContain(summary, "房") && isContain(summary, "买") && isNotContain(summary, "厂房、库房、拆迁") && isEqual(borrowFlage, 0))
                return "13213";
            if (isContain(summary, "房") && isContain(summary, "买、购") && isNotContain(summary, "厂房、库房、拆迁") && isEqual(borrowFlage, 1))
                return "13212";
            if (isContain(summary, "装修、装饰设计、装潢") && isNotContain(summary, "厂房、写字楼、酒店、工程、汽车")) return "13120";
            //===========================================================================================================================================
            //                                                        todo 处理2优先级
            //===========================================================================================================================================
            if (isContain(summary, "火锅、豆捞、涮羊肉")) return "11110";
            if (isKeywordEqual(accountName, "个人业务通存通兑")) return "81000";
            if (isKeywordEqual(accountName, "结售汇")) return "75000";
            if (isContain(summary, "二维码消费") && isContain(summary, "银联扫码转账、银联转账、跨行收款")) return "72000";
            if (isContain(summary, "二维码消费") && isContain(summary, "快速收款码")) return "71000";
            if (isContain(summary, "还") && isContain(summary, "信用卡")) return "63220";
            if (isContain(summary, "还呗、上海数禾")) return "63200";
            if (isContain(summary, "信用卡中心") && isEqual(borrowFlage, 0) && isNotContain(summary, "光大")) return "63120";
            if (isContain(summary, "车贷") && isKeywordEqual(accountName, accountChinessName)) return "62300";
            if (isInLibiary(summary, new String[]{"62200"})) return "62200";
            if (isContain(summary, "个人消费贷、消费金融")) return "62200";
            if (isInLibiary(summary, new String[]{"62100"}) && isEqual(borrowFlage, 1)) return "62120";
            if (isEqual(borrowFlage, 1) && isContain(summary, "小额贷")) return "62120";
            if (isContain(summary, "放款") && isContain(accountName, "网银在线")) return "62110";
            if (isInLibiary(summary, new String[]{"62100"}) && isEqual(borrowFlage, 0)) return "62110";
            if (isContain(summary, "云贷、钱袋、分期")) return "62100";
            if (isContain(summary, "股东")) return "52500";
            if (isContain(accountName, "光大兴陇")) return "52310";
            if (isContain(summary, "光大兴陇")) return "52310";
            if (isContain(accountName, "信托") && isNotContain(accountName, "光大兴陇")) return "52300";
            if (isContain(summary, "信托") && isNotContain(summary, "光大兴陇")) return "52300";
            if (isContain(accountName, "新华基金")) return "5225X";
            if (isContain(summary, "新华基金")) return "5225X";
            if (isContain(accountName, "财通基金")) return "5225W";
            if (isContain(summary, "财通基金")) return "5225W";
            if (isContain(accountName, "东方基金")) return "5225V";
            if (isContain(summary, "东方基金")) return "5225V";
            if (isContain(accountName, "长盛基金")) return "5226P";
            if (isContain(summary, "长盛基金")) return "5225P";
            if (isContain(accountName, "申万菱信基金")) return "5226O";
            if (isContain(summary, "申万菱信基金")) return "5225O";
            if (isContain(accountName, "中邮创业基金")) return "5226N";
            if (isContain(summary, "中邮创业基金")) return "5225N";
            if (isContain(accountName, "鑫元基金")) return "5225M";
            if (isContain(summary, "鑫元基金")) return "5225M";
            if (isContain(accountName, "金鹰基金")) return "5225L";
            if (isContain(summary, "金鹰基金")) return "5225L";
            if (isContain(accountName, "西部利得基金")) return "5225K";
            if (isContain(summary, "西部利得基金")) return "5225K";
            if (isContain(accountName, "泓德基金")) return "5225J";
            if (isContain(summary, "泓德基金")) return "5225J";
            if (isContain(accountName, "国联安基金")) return "5225I";
            if (isContain(summary, "国联安基金")) return "5225I";
            if (isContain(accountName, "鹏扬基金")) return "5225H";
            if (isContain(summary, "鹏扬基金")) return "5225H";
            if (isContain(accountName, "上银基金")) return "5225G";
            if (isContain(summary, "上银基金")) return "5225G";
            if (isContain(accountName, "中融基金")) return "5225F";
            if (isContain(summary, "中融基金")) return "5225F";
            if (isContain(accountName, "中加基金")) return "5225E";
            if (isContain(summary, "中加基金")) return "5225E";
            if (isContain(accountName, "国投瑞银基金")) return "5225D";
            if (isContain(summary, "国投瑞银基金")) return "5225D";
            if (isContain(accountName, "中信保诚基金")) return "5225C";
            if (isContain(summary, "中信保诚基金")) return "5225C";
            if (isContain(accountName, "诺安基金")) return "5225B";
            if (isContain(summary, "诺安基金")) return "5225B";
            if (isContain(accountName, "华泰柏瑞基金")) return "5225A";
            if (isContain(summary, "华泰柏瑞基金")) return "5225A";
            if (isContain(accountName, "海富通基金")) return "5224Z";
            if (isContain(summary, "海富通基金")) return "5224Z";
            if (isContain(accountName, "融通基金")) return "5224Y";
            if (isContain(summary, "融通基金")) return "5224Y";
            if (isContain(accountName, "万家基金")) return "5224X";
            if (isContain(summary, "万家基金")) return "5224X";
            if (isContain(accountName, "上投摩根基金")) return "5224W";
            if (isContain(summary, "上投摩根基金")) return "5224W";
            if (isContain(accountName, "永盈基金")) return "5224V";
            if (isContain(summary, "永盈基金")) return "5224V";
            if (isContain(accountName, "民生加银基金") && isContain(accountName, "汇丰普信基金")) return "5224U";
            if (isContain(summary, "民生加银基金") && isContain(summary, "汇丰普信基金")) return "5224U";
            if (isContain(accountName, "华宝基金") && isContain(accountName, "摩根士丹利华鑫基金")) return "5224T";
            if (isContain(summary, "华宝基金") && isContain(summary, "摩根士丹利华鑫基金")) return "5224T";
            if (isContain(accountName, "浦银安盛基金") && isContain(accountName, "国海富兰克林基金")) return "5224S";
            if (isContain(summary, "浦银安盛基金") && isContain(summary, "国海富兰克林基金")) return "5224S";
            if (isContain(accountName, "景顺长城基金") && isContain(accountName, "宝盈基金")) return "5224R";
            if (isContain(summary, "景顺长城基金") && isContain(summary, "宝盈基金")) return "5224R";
            if (isContain(accountName, "国寿安保基金") && isContain(accountName, "前海联合基金")) return "5224Q";
            if (isContain(summary, "国寿安保基金") && isContain(summary, "前海联合基金")) return "5224Q";
            if (isContain(accountName, "兴业基金")) return "5224P";
            if (isContain(summary, "兴业基金")) return "5224P";
            if (isContain(accountName, "交银施罗德基金")) return "5224O";
            if (isContain(summary, "交银施罗德基金")) return "5224O";
            if (isContain(accountName, "农银汇理基金")) return "5224N";
            if (isContain(summary, "农银汇理基金")) return "5224N";
            if (isContain(accountName, "国泰基金")) return "5224M";
            if (isContain(summary, "国泰基金")) return "5224M";
            if (isContain(accountName, "中欧基金")) return "5224L";
            if (isContain(summary, "中欧基金")) return "5224L";
            if (isContain(accountName, "银华基金")) return "5224K";
            if (isContain(summary, "银华基金")) return "5224K";
            if (isContain(accountName, "兴全基金")) return "5224J";
            if (isContain(summary, "兴全基金")) return "5224J";
            if (isContain(accountName, "中银基金")) return "5224I";
            if (isContain(summary, "中银基金")) return "5224I";
            if (isContain(accountName, "建信基金")) return "5224H";
            if (isContain(summary, "建信基金")) return "5224H";
            if (isContain(accountName, "安信基金")) return "5224G";
            if (isContain(summary, "安信基金")) return "5224G";
            if (isContain(accountName, "国泰基金")) return "5224F";
            if (isContain(summary, "国泰基金")) return "5224F";
            if (isContain(accountName, "长城基金")) return "5224E";
            if (isContain(summary, "长城基金")) return "5224E";
            if (isContain(accountName, "肯特瑞基金")) return "5224D";
            if (isContain(summary, "肯特瑞基金")) return "5224D";
            if (isContain(accountName, "博时基金")) return "5224C";
            if (isContain(summary, "博时基金")) return "5224C";
            if (isContain(accountName, "国金基金")) return "5224B";
            if (isContain(summary, "国金基金")) return "5224B";
            if (isContain(accountName, "招商基金")) return "5224A";
            if (isContain(summary, "招商基金")) return "5224A";
            if (isContain(accountName, "富国基金")) return "52249";
            if (isContain(summary, "富国基金")) return "52249";
            if (isContain(accountName, "华安基金")) return "52248";
            if (isContain(summary, "华安基金")) return "52248";
            if (isContain(accountName, "鹏华基金")) return "52247";
            if (isContain(summary, "鹏华基金")) return "52247";
            if (isContain(accountName, "广发基金")) return "52246";
            if (isContain(summary, "广发基金")) return "52246";
            if (isContain(accountName, "华夏基金")) return "52245";
            if (isContain(summary, "华夏基金")) return "52245";
            if (isContain(accountName, "南方基金")) return "52244";
            if (isContain(summary, "南方基金")) return "52244";
            if (isContain(accountName, "汇添富")) return "52243";
            if (isContain(summary, "汇添富")) return "52243";
            if (isContain(accountName, "嘉实基金")) return "52242";
            if (isContain(summary, "嘉实基金")) return "52242";
            if (isContain(accountName, "嘉实基金")) return "52241";
            if (isContain(summary, "嘉实基金")) return "52241";
            if (isContain(accountName, "工银瑞信")) return "52240";
            if (isContain(summary, "工银瑞信")) return "52240";
            if (isInLibiary(summary, new String[]{"52230"})) return "52230";
            if (isContain(summary, "私募")) return "52220";
            if (isContain(accountName, "私募")) return "52220";
            if (isContain(summary, "保德信") && isContain(summary, "基金")) return "52210";
            if (isInLibiary(summary, new String[]{"52120"})) return "52120";
            if (isContain(summary, "银行") && isContain(summary, "理财")) return "52120";
            if (isStartWith(accountName, "网银在线") && isContain(summary, "小金库") && isContain(summary, "转出"))
                return "52112";
            if (isInLibiary(summary, new String[]{"52110"}) && isEqual(borrowFlage, 0)) return "52112";
            if (isInLibiary(summary, new String[]{"52110"}) && isEqual(borrowFlage, 1)) return "52111";
            if (isContain(accountName, "代理黄金")) return "51610";
            if (isStartWith(accountName, "EB") && isContain(summary, "客户撤单、申购失败")) return "51204";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "客户撤单、申购失败")) return "51204";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "分红")) return "51203";
            if (isContain(accountName, "代理理财产品销售待转户") && isContain(summary, "赎回")) return "51202";
            if (isContain(summary, "申购") && isStartWith(summary, "EB")) return "51201";
            if (isStartWith(accountName, "EB")) return "51201";
            if (isContain(accountName, "代理理财产品销售待转户") && isNotContain(summary, "赎回、分红、申购失败")) return "51201";
            if (isContain(summary, "外币T计划")) return "51170";
            if (isContain(summary, "活期宝") && isKeywordEqual(accountName, accountChinessName)) return "51140";
            if (isContain(summary, "结构性存款")) return "51130";
            if (isContain(summary, "社会保险、社保") && isContain(summary, "养老") && isEqual(borrowFlage, 1)) return "42710";
            if (isContain(summary, "养老金") && isNotContain(accountName, "41720")) return "42700";
            if (isContain(accountName, "42700") && isEqual(borrowFlage, 0)) return "42700";
            if (isContain(accountName, "社会保险") && isContain(accountName, "养老") && isEqual(borrowFlage, 0))
                return "42700";
            if (isContain(summary, "失业金、就业保障")) return "42600";
            if (isContain(accountName, "社会保险") && isContain(accountName, "失业")) return "42600";
            if (isContain(accountName, "失业保险、失业基金")) return "42600";
            if (isContain(accountName, "社会保险、养老保险") && isContain(accountName, "工伤")) return "42500";
            if (isEqual(borrowFlage, 0) && isContain(summary, "基本医疗")) return "42430";
            if (isContain(accountName, "医疗保障") && isEqual(borrowFlage, 0)) return "42420";
            if (isContain(accountName, "社会保险") && isContain(accountName, "医疗、医保") && isEqual(borrowFlage, 0))
                return "42420";
            if (isContain(accountName, "医疗保障、市医疗保险") && isEqual(borrowFlage, 1)) return "42410";
            if (isContain(accountName, "社会保险") && isContain(accountName, "医疗、医保") && isEqual(borrowFlage, 1))
                return "42410";
            if (isContain(accountName, "公积金") && isEqual(borrowFlage, 1)) return "42220";
            if (isContain(accountName, "公积金、住房基金") && isEqual(borrowFlage, 0)) return "42210";
            if (isEqual(borrowFlage, 0) && isContain(summary, "补充医疗")) return "41820";
            if (isEqual(borrowFlage, 1) && isContain(summary, "补充医疗")) return "41810";
            if (isEqual(borrowFlage, 0) && isContain(accountName, "41720")) return "41720";
            if (isEqual(borrowFlage, 1) && isContain(summary, "养老险")) return "41710";
            if (isEqual(borrowFlage, 0) && isContain(accountName, "人寿、寿险")) return "41220";
            if (isEqual(borrowFlage, 0) && isContain(summary, "人寿、寿险")) return "41220";
            if (isEqual(borrowFlage, 1) && isContain(accountName, "人寿、寿险")) return "41210";
            if (isEqual(borrowFlage, 1) && isContain(summary, "人寿、寿险")) return "41210";
            if (isInLibiary(summary, new String[]{"41100"})) return "41100";
            if (isInLibiary(summary, new String[]{"41010"})) return "41010";
            if (isContain(summary, "拉勾、智联、前程无忧、BOSS直聘、招聘")) return "37000";
            if (isContain(summary, "返现") && isEqual(borrowFlage, 0)) return "36100";
            if (isEqual(borrowFlage, 0) && isContain(summary, "员工") && isInLibiary(summary, new String[]{"17100-1"}))
                return "36000";
            if (isInLibiary(summary, new String[]{"35000", "21000"}) && isEqual(borrowFlage, 0) && isNotContain(summary, "分润"))
                return "35000";
            if (isContain(summary, "助学金")) return "34200";
            if (isInLibiary(summary, new String[]{"17200-1"}) && isEqual(borrowFlage, 0)) return "34000";
            if (isContain(summary, "缴纳个税")) return "31210";
            if (isInLibiary(summary, new String[]{"31000-1"}) && isEqual(borrowFlage, 0)) return "31000";
            if (isContain(accountName, "代发")) return "31000";
            if (isContain(summary, "工会")) return "30000";
            if (isContain(summary, "版权、专利") && isEqual(borrowFlage, 0)) return "22700";
            if (isContain(summary, "分润") && isEqual(borrowFlage, 0)) return "22610";
            if (isContain(summary, "劳务收入、人工费")) return "22600";
            if (isContain(summary, "投标、招标")) return "22510";
            if (isContain(accountName, "乐刷科技、拉扎斯") && isKeywordEqual(summary, "资金结算、新零售提现")) return "22400";
            if (isContain(summary, "商家、商户、货款、营业款") && isContain(summary, "提现")) return "22400";
            if (isInLibiary(summary, new String[]{"22400-1"}) && isContain(summary, "付款、手续费、结算") && isEqual(borrowFlage, 0))
                return "22400";
            if (isContain(summary, "POS") && isContain(summary, "银联入账")) return "22400";
            if (isContain(summary, "商户提款、商户提现、商户资金结算、商户结算、商户清结算、客户资金结算、备付金、提现打款、实时结算、商户款结算") && isEqual(borrowFlage, 0) && isNotContain(summary, "支付宝"))
                return "22400";
            if (isContain(summary, "租") && isContain(summary, "房") && isEqual(borrowFlage, 0) && isNotContain(summary, "还"))
                return "22300";
            if (isContain(summary, "押金、订金、定金") && isEqual(borrowFlage, 0)) return "22120";
            if (isContain(accountName, "拍卖") && isEqual(borrowFlage, 0)) return "22110";
            if (isContain(summary, "拍卖") && isEqual(borrowFlage, 0)) return "22110";
            if (isInLibiary(summary, new String[]{"21100"}) && isEqual(borrowFlage, 0)) return "22100";
            if (isContain(summary, "装修、装饰设计、装潢")) return "21B00";
            if (isInLibiary(summary, new String[]{"21940"})) return "21940";
            if (isContain(summary, "文化发展有")) return "21900";
            if (isContain(summary, "广告、营销、推广、品牌设计")) return "21900";
            if (isInLibiary(summary, new String[]{"21820"}) && isEqual(borrowFlage, 1)) return "21820";
            if (isContain(summary, "员工") && isInLibiary(summary, new String[]{"17100-1"}) && isEqual(borrowFlage, 1))
                return "21720";
            if (isContain(summary, "投标、招标") && isEqual(borrowFlage, 1)) return "21310";
            if (isInLibiary(summary, new String[]{"21300"}) && isEqual(borrowFlage, 1)) return "21300";
            if (isInLibiary(summary, new String[]{"21110"})) return "21110";
            if (isKeywordEqual(summary, "版权、专利") && isEqual(borrowFlage, 1)) return "21110";
            if (isInLibiary(summary, new String[]{"21000"}) && isEqual(borrowFlage, 1)) return "21000";
            if (isInLibiary(summary, new String[]{"1C200"}) && isNotContain(summary, "142A0、14500-1") && isNotContain(summary, "店"))
                return "1C200";
            if (isContain(summary, "父母、赡养、抚养、孝敬")) return "1B510";
            if (isContain(summary, "证件照、证照、自助照相")) return "1B321";
            if (isInLibiary(summary, new String[]{"1B310"})) return "1B310";
            if (isInLibiary(summary, new String[]{"1B230"})) return "1B230";
            if (isContain(summary, "奶粉")) return "1B223";
            if (isContain(summary, "尿布、尿不湿、纸尿裤、湿巾")) return "1B222";
            if (isContain(summary, "童鞋、童装")) return "1B221";
            if (isInLibiary(summary, new String[]{"1B220"})) return "1B220";
            if (isContain(summary, "相亲、征婚、婚介")) return "1B120";
            if (isContain(summary, "彩礼、嫁妆、娶、婚博")) return "1B100";
            if (isContain(summary, "眼镜")) return "1A270";
            if (isContain(accountName, "保健") && isContain(accountName, "食品")) return "1A260";
            if (isContain(summary, "保健") && isContain(summary, "食品")) return "1A260";
            if (isInLibiary(summary, new String[]{"1A260"})) return "1A260";
            if (isInLibiary(summary, new String[]{"1A250"})) return "1A250";
            if (isContain(summary, "手术")) return "1A231";
            if (isContain(summary, "住院")) return "1A230";
            if (isInLibiary(summary, new String[]{"1A222"})) return "1A222";
            if (isInLibiary(summary, new String[]{"1A221"})) return "1A221";
            if (isInLibiary(summary, new String[]{"1A220"})) return "1A220";
            if (isContain(summary, "医院、门诊、附院、医疗费、诊所、卫生院、社区卫生、医学院、疾病预防") && isNotContain(summary, "医院店")) return "1A220";
            if (isInLibiary(summary, new String[]{"1A211"})) return "1A211";
            if (isContain(summary, "钓鱼、渔具")) return "1A150";
            if (isInLibiary(summary, new String[]{"1A121"})) return "1A121";
            if (isInLibiary(summary, new String[]{"1A113"})) return "1A113";
            if (isContain(summary, "健身房、健身俱乐、私教")) return "1A112";
            if (isContain(summary, "游泳馆、水世界")) return "1A111";
            if (isInLibiary(summary, new String[]{"19320"}) && isContain(summary, "工作室")) return "19330";
            if (isInLibiary(summary, new String[]{"19320"}) && isNotContain(summary, "工作室")) return "19320";
            if (isInLibiary(summary, new String[]{"19310"})) return "19310";
            if (isInLibiary(summary, new String[]{"19230"})) return "19230";
            if (isInLibiary(summary, new String[]{"19220"})) return "19220";
            if (isContain(summary, "家教、补习、补课、培训、辅导")) return "19220";
            if (isContain(accountName, "19130")) return "19130";
            if (isInLibiary(summary, new String[]{"19130"})) return "19130";
            if (isContain(summary, "教材、教学用品、辅导书、假期作业、人教、资料、教具")) return "19120";
            if (isInLibiary(summary, new String[]{"19000"})) return "19000";
            if (isContain(summary, "粉丝公社、追星")) return "18510";
            if (isInLibiary(summary, new String[]{"18410"})) return "18410";
            if (isInLibiary(summary, new String[]{"18320"})) return "18320";
            if (isContain(accountName, "拍卖") && isEqual(borrowFlage, 1)) return "18310";
            if (isContain(summary, "拍卖") && isEqual(borrowFlage, 1)) return "18310";
            if (isContain(summary, "财付通") && isEndWith(summary, "华为")) return "18250";
            if (isContain(summary, "财付通、支付宝") && isInLibiary(summary, new String[]{"18250"})) return "18250";
            if (isInLibiary(summary, new String[]{"18233"})) return "18233";
            if (isInLibiary(summary, new String[]{"18231"})) return "18231";
            if (isInLibiary(summary, new String[]{"18230"})) return "18230";
            if (isContain(summary, "寻梦、贪玩") && isContain(summary, "信息技术")) return "18220";
            if (isInLibiary(summary, new String[]{"18220"})) return "18220";
            if (isContain(accountName, "维修") && isContain(accountName, "手机、电脑、数码")) return "18211";
            if (isContain(summary, "维修") && isContain(summary, "手机、电脑、数码、电子")) return "18211";
            if (isContain(summary, "马术、马场")) return "18160";
            if (isInLibiary(summary, new String[]{"18150"})) return "18150";
            if (isInLibiary(summary, new String[]{"18140"})) return "18140";
            if (isContain(summary, "电影、影院、影城")) return "18130";
            if (isInLibiary(summary, new String[]{"1812C"})) return "1812C";
            if (isInLibiary(summary, new String[]{"1812B"})) return "1812B";
            if (isContain(summary, "电玩")) return "1812B";
            if (isInLibiary(summary, new String[]{"18129"})) return "18129";
            if (isContain(summary, "KTV")) return "18129";
            if (isContain(summary, "团建")) return "18128";
            if (isInLibiary(summary, new String[]{"18126"})) return "18126";
            if (isInLibiary(summary, new String[]{"18125"})) return "18125";
            if (isContain(summary, "密室、逃脱、室内游戏")) return "18124";
            if (isInLibiary(summary, new String[]{"18122"})) return "18122";
            if (isContain(summary, "酒吧、休闲吧、休闲会所")) return "18121";
            if (isInLibiary(summary, new String[]{"18112"})) return "18112";
            if (isInLibiary(summary, new String[]{"18111"})) return "18111";
            if (isContain(summary, "洗浴、汗蒸、澡堂、汤屋")) return "18111";
            if (isInLibiary(summary, new String[]{"18100"})) return "18100";
            if (isContain(summary, "鲜花、花语")) return "17410";
            if (isInLibiary(summary, new String[]{"17200-1"}) && isEqual(borrowFlage, 1)) return "17200";
            if (isInLibiary(summary, new String[]{"17100"})) return "17100";
            if (isInLibiary(summary, new String[]{"17000"})) return "17000";
            if (isContain(summary, "废品")) return "16610";
            if (isContain(summary, "财付通") && isContain(summary, "转转")) return "16600";
            if (isContain(summary, "二手、旧物、旧品")) return "16600";
            if (isContain(accountName, "福彩、体彩、彩票") && isEqual(borrowFlage, 0)) return "16511";
            if (isInLibiary(summary, new String[]{"16510"}) && isEqual(borrowFlage, 1)) return "16510";
            if (isInLibiary(summary, new String[]{"16500"})) return "16500";
            if (isInLibiary(summary, new String[]{"16460"})) return "16460";
            if (isInLibiary(summary, new String[]{"16450"})) return "16450";
            if (isInLibiary(summary, new String[]{"16430"})) return "16430";
            if (isInLibiary(summary, new String[]{"16420"}) && isNotContain(summary, "自助")) return "16420";
            if (isInLibiary(summary, new String[]{"16410"})) return "16410";
            if (isContain(summary, "物流")) return "16330";
            if (isContain(summary, "快递")) return "16320";
            if (isInLibiary(summary, new String[]{"16310"})) return "16310";
            if (isContain(summary, "同城") && isContain(summary, "快递、速递")) return "16310";
            if (isInLibiary(summary, new String[]{"16240"})) return "16240";
            if (isContain(summary, "海珍品")) return "16221";
            if (isContain(summary, "菜市场、菜篮子")) return "16210";
            if (isInLibiary(summary, new String[]{"16120"})) return "16120";
            if (isInLibiary(summary, new String[]{"16110"})) return "16110";
            if (isContain(summary, "退") && isEndWith(summary, "云缴费") && isEqual(borrowFlage, 0)) return "15411";
            if (isEndWith(summary, "云缴费") && isNotContain(summary, "银行") && isEqual(borrowFlage, 1)) return "15410";
            if (isInLibiary(summary, new String[]{"15400"})) return "15400";
            if (isInLibiary(summary, new String[]{"15300"})) return "15300";
            if (isInLibiary(summary, new String[]{"15210"})) return "15210";
            if (isInLibiary(summary, new String[]{"15120"})) return "15120";
            if (isInLibiary(summary, new String[]{"15110-1"}) && isContain(summary, "联通、电信、移动")) return "15110";
            if (isContain(accountName, "14531")) return "14531";
            if (isInLibiary(summary, new String[]{"14531"})) return "14531";
            if (isInLibiary(summary, new String[]{"14510"})) return "14510";
            if (isInLibiary(summary, new String[]{"14500-1"})) return "14500";
            if (isContain(accountName, "14500")) return "14500";
            if (isInLibiary(summary, new String[]{"14500"})) return "14500";
            if (isContain(summary, "航空")) return "14440";
            if (isContain(summary, "火车、铁路、铁道部")) return "14410";
            if (isInLibiary(summary, new String[]{"142A0"})) return "142A0";
            if (isContain(summary, "驾校")) return "14290";
            if (isInLibiary(summary, new String[]{"14280"})) return "14280";
            if (isContain(accountName, "高速")) return "14280";
            if (isContain(summary, "ETC、过路、通行、高速")) return "14280";
            if (isInLibiary(summary, new String[]{"14270"})) return "14270";
            if (isContain(summary, "充电桩、充电站")) return "14261";
            if (isInLibiary(summary, new String[]{"14260"}) && isNotContain(summary, "财富、流量、话费")) return "14260";
            if (isContain(summary, "停车")) return "14250";
            if (isContain(summary, "停车")) return "14250";
            if (isInLibiary(summary, new String[]{"14241"})) return "14241";
            if (isInLibiary(summary, new String[]{"14240"})) return "14240";
            if (isInLibiary(summary, new String[]{"14230"})) return "14230";
            if (isContain(summary, "汽车") && isContain(summary, "修理、维修")) return "14230";
            if (isContain(summary, "汽配、修车、汽修")) return "14230";
            if (isContain(summary, "二手车")) return "14220";
            if (isContain(accountName, "出租车、出租汽车、TAXI、的士")) return "14123";
            if (isContain(summary, "出租车、出租汽车、TAXI、的士")) return "14123";
            if (isInLibiary(summary, new String[]{"14112"})) return "14112";
            if (isInLibiary(summary, new String[]{"14111"})) return "14111";
            if (isInLibiary(summary, new String[]{"13260"})) return "13260";
            if (isInLibiary(summary, new String[]{"13251"}) && isNotContain(summary, "洗衣机")) return "13251";
            if (isInLibiary(summary, new String[]{"13250"})) return "13250";
            if (isInLibiary(summary, new String[]{"13240"})) return "13240";
            if (isContain(accountName, "13230")) return "13230";
            if (isInLibiary(summary, new String[]{"13230"})) return "13230";
            if (isContain(summary, "付费通、便民缴费") && isEqual(borrowFlage, 1)) return "13220";
            if (isContain(summary, "水表、电表、气表") && isNotContain(accountName, "仪表")) return "13220";
            if (isContain(accountName, "13220")) return "13220";
            if (isContain(summary, "水费、电费、燃气、生活缴费、公用事业缴费")) return "13220";
            if (isContain(summary, "房款、二手房") && isEqual(borrowFlage, 0)) return "13213";
            if (isContain(summary, "房款、二手房") && isEqual(borrowFlage, 1)) return "13212";
            if (isContain(summary, "中介费、房产佣金") && isNotContain(summary, "车") && isEqual(borrowFlage, 1)) return "13200";
            if (isContain(summary, "房屋中介、垃圾费")) return "13200";
            if (isInLibiary(summary, new String[]{"13131-1"})) return "13131";
            if (isInLibiary(summary, new String[]{"13131"})) return "13131";
            if (isInLibiary(summary, new String[]{"13130"})) return "13130";
            if (isContain(accountName, "家电维修、家电服务")) return "13113";
            if (isInLibiary(summary, new String[]{"13111-1"})) return "13111";
            if (isInLibiary(summary, new String[]{"13111"}) && isNotContain(summary, "维修、修理")) return "13111";
            if (isInLibiary(summary, new String[]{"12220"}) && isNotContain(summary, "管理")) return "12220";
            if (isInLibiary(summary, new String[]{"12210-2"})) return "12210";
            if (isInLibiary(summary, new String[]{"12210-1"})) return "12210";
            if (isInLibiary(summary, new String[]{"12143"})) return "12143";
            if (isInLibiary(summary, new String[]{"12142"})) return "12142";
            if (isInLibiary(summary, new String[]{"12141"})) return "12141";
            if (isContain(accountName, "12131-1")) return "12131";
            if (isInLibiary(summary, new String[]{"12131"}) && isNotContain(summary, "五金")) return "12131";
            if (isInLibiary(summary, new String[]{"12130"})) return "12130";
            if (isInLibiary(summary, new String[]{"12120"})) return "12120";
            if (isContain(summary, "财付通") && isEndWith(summary, "HM")) return "12110";
            if (isInLibiary(summary, new String[]{"12100-1"})) return "12100";
            if (isInLibiary(summary, new String[]{"11338"})) return "11338";
            if (isInLibiary(summary, new String[]{"11337"})) return "11337";
            if (isInLibiary(summary, new String[]{"11336"})) return "11336";
            if (isInLibiary(summary, new String[]{"11335"})) return "11335";
            if (isInLibiary(summary, new String[]{"11334"})) return "11334";
            if (isInLibiary(summary, new String[]{"11333"})) return "11333";
            if (isInLibiary(summary, new String[]{"11331"})) return "11331";
            if (isContain(summary, "新商盟、利群集团、烟草、雪茄、香烟、烟款、洋烟") && isNotContain(summary, "酒")) return "11320";
            if (isInLibiary(summary, new String[]{"11310"})) return "11310";
            if (isContain(summary, "烟酒")) return "11300";
            if (isInLibiary(summary, new String[]{"11280"})) return "11280";
            if (isInLibiary(summary, new String[]{"11270"})) return "11270";
            if (isInLibiary(summary, new String[]{"11260", "11260-1"})) return "11260";
            if (isContain(summary, "外卖")) return "11250";
            if (isInLibiary(summary, new String[]{"11240-1"})) return "11240";
            if (isContain(summary, "乳业")) return "11210";
            if (isContain(summary, "饭卡")) return "11180";
            if (isContain(summary, "食堂") && isNotContain(summary, "购买")) return "11180";
            if (isInLibiary(summary, new String[]{"11151"})) return "11151";
            if (isContain(summary, "烤鱼")) return "11151";
            if (isInLibiary(summary, new String[]{"11150"})) return "11150";
            if (isContain(summary, "烤串、烧烤、烤肉、撸串、铁板烧")) return "11150";
            if (isInLibiary(summary, new String[]{"11149"})) return "11149";
            if (isInLibiary(summary, new String[]{"11148"}) && isNotContain(summary, "自助")) return "11148";
            if (isInLibiary(summary, new String[]{"11146"})) return "11146";
            if (isContain(accountName, "11145")) return "11145";
            if (isInLibiary(summary, new String[]{"11145"})) return "11145";
            if (isInLibiary(summary, new String[]{"11144", "11144-1"})) return "11144";
            if (isInLibiary(summary, new String[]{"11143"})) return "11143";
            if (isContain(accountName, "11141")) return "11141";
            if (isInLibiary(summary, new String[]{"11141"})) return "11141";
            if (isInLibiary(summary, new String[]{"11140", "11140-1"})) return "11140";
            if (isContain(summary, "泰国") && isContain(summary, "餐厅")) return "11132";
            if (isInLibiary(summary, new String[]{"11132"})) return "11132";
            if (isInLibiary(summary, new String[]{"11131"})) return "11131";
            if (isContain(summary, "西餐")) return "11130";
            if (isInLibiary(summary, new String[]{"1112C"})) return "1112C";
            if (isInLibiary(summary, new String[]{"1112B"})) return "1112B";
            if (isInLibiary(summary, new String[]{"1112A"})) return "1112A";
            if (isInLibiary(summary, new String[]{"11129"})) return "11129";
            if (isInLibiary(summary, new String[]{"11128"})) return "11128";
            if (isInLibiary(summary, new String[]{"11127"})) return "11127";
            if (isInLibiary(summary, new String[]{"11126"})) return "11126";
            if (isInLibiary(summary, new String[]{"11125"})) return "11125";
            if (isInLibiary(summary, new String[]{"11124"})) return "11124";
            if (isInLibiary(summary, new String[]{"11123"})) return "11123";
            if (isInLibiary(summary, new String[]{"11122"})) return "11122";
            if (isInLibiary(summary, new String[]{"11121"})) return "11121";
            if (isInLibiary(summary, new String[]{"11110"})) return "11110";
            //===========================================================================================================================================
            //                                                        todo 处理3优先级
            //===========================================================================================================================================
            if (isContain(accountName, "火锅、豆捞")) return "11110";
            if (isContain(summary, "法庭、法院、诉讼、律师费")) return "66220";
            if (isContain(accountName, "银行、分行、支行") && isContain(summary, "贷、还款")) return "65000";
            if (isContain(accountName, "64124") && isEqual(borrowFlage, 0)) return "64124";
            if (isContain(summary, "车款") && isContain(summary, "代") && isContain(summary, "付") && isEqual(borrowFlage, 1))
                return "64121";
            if (isContain(accountName, "典当、当铺")) return "64100";
            if (isContain(summary, "典当、当铺")) return "64100";
            if (isContain(accountName, "个人消费贷、消费金融")) return "62200";
            if (isContain(accountName, "62100")) return "62100";
            if (isContain(summary, "平安陆基金") && isContain(accountName, "平安陆基金")) return "52236";
            if (isContain(summary, "好买基金") && isContain(accountName, "好买基金")) return "52235";
            if (isContain(summary, "蚂蚁基金") && isContain(accountName, "蚂蚁基金")) return "52234";
            if (isContain(summary, "易方达基金") && isContain(accountName, "易方达基金")) return "52233";
            if (isContain(summary, "天弘基金") && isContain(accountName, "天弘基金")) return "52232";
            if (isContain(summary, "天天基金") && isContain(accountName, "天天基金")) return "52231";
            if (isContain(accountName, "基金") && isNotContain(accountName, "私募、信托、光大、保德信")) return "52200";
            if (isContain(summary, "基金") && isNotContain(summary, "私募、信托、光大、保德信")) return "52200";
            if (isContain(accountName, "银行") && isContain(summary, "理财")) return "52120";
            if (isContain(summary, "兑付、付息、赎回、本金") && isInLibiary(summary, new String[]{"52100"})) return "52100";
            if (isContain(accountName, "期货、证券")) return "51500";
            if (isContain(summary, "期货、证券")) return "51500";
            if (isContain(summary, "生育") && isContain(summary, "津贴、保险")) return "42800";
            if (isContain(accountName, "社会保险") && isContain(accountName, "生育")) return "42800";
            if (isContain(summary, "公积金")) return "42200";
            if (isContain(summary, "社保") && isEqual(borrowFlage, 1)) return "42100";
            if (isContain(accountName, "财产保险") && isContain(summary, "理赔")) return "41520";
            if (isEqual(borrowFlage, 1) && isContain(summary, "产险、财险")) return "41510";
            if (isContain(accountName, "产险、财险") && isEqual(borrowFlage, 1)) return "41510";
            if (isContain(accountName, "财产保险") && isEqual(borrowFlage, 1)) return "41510";
            if (isContain(summary, "理赔款")) return "41020";
            if (isContain(summary, "保险、保费")) return "41000";
            if (isContain(summary, "报") && isContain(summary, "费用、款")) return "35000";
            if (isContain(accountName, "17200") && isEqual(borrowFlage, 0)) return "34000";
            if (isContain(summary, "代发")) return "31000";
            if (isInLibiary(summary, new String[]{"21400"})) return "21400";
            if (isContain(summary, "押金、订金、定金") && isEqual(borrowFlage, 1)) return "21120";
            if (isContain(summary, "销售部、市场部")) return "20000";
            if (isContain(summary, "营业款、营业额、营业收入、结算款")) return "20000";
            if (isContain(summary, "广场、公园、游乐、海滩、沙滩、亲子游") && isNotContain(summary, "广场店")) return "1B331";
            if (isContain(summary, "亲子")) return "1B300";
            if (isInLibiary(summary, new String[]{"1B221"})) return "1B221";
            if (isInLibiary(summary, new String[]{"1B200"})) return "1B200";
            if (isContain(accountName, "1B120")) return "1B120";
            if (isInLibiary(summary, new String[]{"1B120"})) return "1B120";
            if (isContain(accountName, "婚纱摄影、婚庆")) return "1B110";
            if (isContain(summary, "婚纱摄影、婚庆")) return "1B110";
            if (isInLibiary(summary, new String[]{"1A240"})) return "1A240";
            if (isContain(accountName, "药店、药房、药品连锁")) return "1A212";
            if (isContain(summary, "药店、药房、药品连锁")) return "1A212";
            if (isInLibiary(summary, new String[]{"1A212"})) return "1A212";
            if (isInLibiary(summary, new String[]{"1A210"})) return "1A210";
            if (isContain(accountName, "药品、制药")) return "1A210";
            if (isInLibiary(summary, new String[]{"1A122"})) return "1A122";
            if (isContain(summary, "体育用品")) return "1A120";
            if (isContain(accountName, "健身")) return "1A112";
            if (isInLibiary(summary, new String[]{"1A100"})) return "1A100";
            if (isInLibiary(summary, new String[]{"19240"})) return "19240";
            if (isInLibiary(summary, new String[]{"19200"})) return "19200";
            if (isInLibiary(summary, new String[]{"19140"})) return "19140";
            if (isInLibiary(summary, new String[]{"19110"})) return "19110";
            if (isInLibiary(summary, new String[]{"19100"})) return "19100";
            if (isInLibiary(summary, new String[]{"18300"})) return "18300";
            if (isInLibiary(summary, new String[]{"18250"}) && isNotContain(summary, "支付")) return "18250";
            if (isInLibiary(summary, new String[]{"18241"})) return "18241";
            if (isInLibiary(summary, new String[]{"18210"}) && isNotContain(summary, "手机银行")) return "18210";
            if (isInLibiary(summary, new String[]{"18130"})) return "18130";
            if (isInLibiary(summary, new String[]{"18121"})) return "18121";
            if (isInLibiary(summary, new String[]{"17500"}) && isNotContain(accountName, "易智付")) return "17500";
            if (isContain(summary, "礼品、礼物") && isNotContain(summary, "员工")) return "17400";
            if (isContain(accountName, "17200") && isEqual(borrowFlage, 1)) return "17200";
            if (isContain(summary, "微信红包、QQ红包")) return "17110";
            if (isContain(accountName, "福彩、体彩、彩票") && isEqual(borrowFlage, 1)) return "16510";
            if (isContain(summary, "抽奖、中奖")) return "16500";
            if (isContain(summary, "仓储、库房、仓库、寄存")) return "16340";
            if (isInLibiary(summary, new String[]{"16330"})) return "16330";
            if (isInLibiary(summary, new String[]{"16320"}) && isNotContain(summary, "快递费")) return "16320";
            if (isContain(summary, "邮政、运费") && isNotContain(summary, "储蓄、银行")) return "16300";
            if (isContain(summary, "免税")) return "16241";
            if (isInLibiary(summary, new String[]{"16200"}) && isNotContain(summary, "广场店")) return "16200";
            if (isInLibiary(summary, new String[]{"16130"})) return "16130";
            if (isInLibiary(summary, new String[]{"16121"})) return "16121";
            if (isInLibiary(summary, new String[]{"16120-1"})) return "16120";
            if (isContain(summary, "超市、超级市场、生活超、生活购")) return "16100";
            if (isContain(summary, "缴费") && isContain(summary, "联通、移动、电信")) return "15110";
            if (isInLibiary(summary, new String[]{"15110"})) return "15110";
            if (isInLibiary(summary, new String[]{"14460"})) return "14460";
            if (isContain(summary, "旅游、旅行社")) return "14450";
            if (isInLibiary(summary, new String[]{"14441"})) return "14441";
            if (isInLibiary(summary, new String[]{"14430"})) return "14430";
            if (isInLibiary(summary, new String[]{"14410"})) return "14410";
            if (isInLibiary(summary, new String[]{"14400"})) return "14400";
            if (isInLibiary(summary, new String[]{"142B3"})) return "142B3";
            if (isInLibiary(summary, new String[]{"142B2"})) return "142B2";
            if (isInLibiary(summary, new String[]{"142B1"}) && isNotContain(summary, "摩托罗拉")) return "142B1";
            if (isInLibiary(summary, new String[]{"14250"})) return "14250";
            if (isContain(summary, "汽车")) return "14210";
            if (isContain(accountName, "汽车")) return "14210";
            if (isInLibiary(summary, new String[]{"14210"})) return "14210";
            if (isInLibiary(summary, new String[]{"14200"}) && isEqual(borrowFlage, 1)) return "14200";
            if (isInLibiary(summary, new String[]{"14140"})) return "14140";
            if (isContain(accountName, "汽车租赁、租车")) return "14122";
            if (isInLibiary(summary, new String[]{"14122"})) return "14122";
            if (isInLibiary(summary, new String[]{"14121"})) return "14121";
            if (isContain(accountName, "14112")) return "14112";
            if (isContain(accountName, "14111")) return "14111";
            if (isContain(accountName, "13260")) return "13260";
            if (isContain(summary, "别墅、洋房") && isEqual(borrowFlage, 1)) return "13212";
            if (isContain(summary, "理房通")) return "13212";
            if (isContain(summary, "置业、房地产")) return "13212";
            if (isContain(summary, "公寓")) return "13200";
            if (isInLibiary(summary, new String[]{"13122"})) return "13122";
            if (isContain(summary, "装修材料") && isNotContain(summary, "工具")) return "13121";
            if (isInLibiary(summary, new String[]{"13121"})) return "13121";
            if (isContain(summary, "设计") && isNotContain(summary, "工业、店铺、园区、品牌")) return "13120";
            if (isContain(summary, "维修、修理") && isContain(summary, "13111")) return "13113";
            if (isContain(summary, "维修、修理") && isContain(summary, "家电")) return "13113";
            if (isInLibiary(summary, new String[]{"13112"})) return "13112";
            if (isContain(accountName, "13111-1")) return "13111";
            if (isContain(accountName, "13111")) return "13111";
            if (isContain(summary, "美容") && isContain(summary, "医院、医疗、正畸")) return "12230";
            if (isContain(summary, "整形、整容、医美、抽脂")) return "12230";
            if (isContain(accountName, "12220") && isNotContain(accountName, "管理")) return "12220";
            if (isInLibiary(summary, new String[]{"12210"})) return "12210";
            if (isInLibiary(summary, new String[]{"12140"})) return "12140";
            if (isInLibiary(summary, new String[]{"12132"})) return "12132";
            if (isContain(summary, "手表、钟表、腕表")) return "12132";
            if (isInLibiary(summary, new String[]{"12131-2"})) return "12131";
            if (isContain(summary, "配饰、饰品")) return "12130";
            if (isInLibiary(summary, new String[]{"11332"})) return "11332";
            if (isContain(summary, "酒水、酒款、洋酒")) return "11330";
            if (isContain(accountName, "新商盟、利群集团、烟草、雪茄、香烟")) return "11320";
            if (isInLibiary(summary, new String[]{"11290"})) return "11290";
            if (isInLibiary(summary, new String[]{"11250"})) return "11250";
            if (isInLibiary(summary, new String[]{"11230"})) return "11230";
            if (isInLibiary(summary, new String[]{"11220"})) return "11220";
            if (isInLibiary(summary, new String[]{"11210-1"})) return "11210";
            if (isInLibiary(summary, new String[]{"11210"})) return "11210";
            if (isInLibiary(summary, new String[]{"11147"})) return "11147";
            if (isInLibiary(summary, new String[]{"11142"})) return "11142";
            if (isKeywordEqual(summary, "东北") && isKeywordEqual(summary, "菜、馆")) return "11129";
            if (isContain(summary, "风味")) return "11120";
            if (isInLibiary(summary, new String[]{"11120"})) return "11120";
            if (isContain(accountName, "11110")) return "11110";
            //===========================================================================================================================================
            //                                                        todo 处理4优先级
            //===========================================================================================================================================
            if (isInLibiary(summary, new String[]{"11100"})) return "11100";
            if (isStartWith(accountName, "分行特色业务")) return "76300";
            if (isContain(summary, "支付宝、财付通") && isContain(summary, "转账")) return "74200";
            if (isContain(summary, "提现") && isContain(accountName, "74100")) return "74100";
            if (isKeywordEqual(accountName, accountChinessName)) return "72100";
            if (isContain(summary, "还") && isNotContain(summary, "转账") && isEqual(borrowFlage, 0)) return "64230";
            if (isContain(summary, "还") && isEqual(borrowFlage, 1) && isNotContain(summary, "网上支付、二维码消费、银联无卡、银联有卡、网络支付、银联消费"))
                return "64220";
            if (isContain(summary, "抵押")) return "64100";
            if (isContain(summary, "信用卡")) return "63220";
            if (isContain(summary, "房贷")) return "62400";
            if (isContain(summary, "车贷")) return "62300";
            if (isContain(summary, "销户")) return "52820";
            if (isContain(summary, "开户")) return "52810";
            if (isInLibiary(summary, new String[]{"52400"})) return "52400";
            if (isContain(summary, "理财通")) return "52111";
            if (isContain(accountName, "投资、创投、金融、资产管理")) return "52000";
            if (isContain(summary, "投资、补仓、创投、金融、分红、股红、资产管理")) return "52000";
            if (isKeywordEqual(transactionCode, "3008")) return "51163";
            if (isContain(summary, "存") && isContain(summary, "钱、款")) return "51100";
            if (isContain(summary, "失业")) return "42600";
            if (isContain(accountName, "社会保险、社保")) return "42000";
            if (isContain(summary, "医保")) return "41800";
            if (isContain(accountName, "保险") && isContain(accountName, "健康") && isEqual(borrowFlage, 0)) return "41120";
            if (isContain(accountName, "保险") && isContain(accountName, "健康") && isEqual(borrowFlage, 1)) return "41110";
            if (isContain(summary, "设计")) return "21B00";
            if (isInLibiary(summary, new String[]{"21930"})) return "21930";
            if (isContain(accountName, "信息咨询") && isEqual(borrowFlage, 1)) return "21920";
            if (isContain(summary, "信息咨询") && isEqual(borrowFlage, 1)) return "21920";
            if (isContain(summary, "地税、税务、国税") && isEqual(borrowFlage, 1)) return "21860";
            if (isContain(summary, "铺面")) return "21500";
            if (isContain(summary, "尾款、材料、配件") && isEqual(borrowFlage, 1)) return "21100";
            if (isContain(summary, "租金、租用")) return "1C100";
            if (isContain(summary, "影楼、摄影、拍照、照片")) return "1B320";
            if (isContain(accountName, "相亲、征婚、婚介")) return "1B120";
            if (isContain(summary, "家用")) return "1B000";
            if (isContain(summary, "医疗")) return "1A200";
            if (isContain(accountName, "网球")) return "1A140";
            if (isContain(summary, "网球")) return "1A140";
            if (isContain(accountName, "高尔夫")) return "1A130";
            if (isContain(summary, "高尔夫")) return "1A130";
            if (isContain(summary, "运动、体育")) return "1A100";
            if (isContain(summary, "医疗、健康")) return "1A000";
            if (isContain(accountName, "教育")) return "19000";
            if (isContain(summary, "教育、教培")) return "19000";
            if (isInLibiary(summary, new String[]{"18600"})) return "18600";
            if (isInLibiary(summary, new String[]{"18400"})) return "18400";
            if (isContain(summary, "视频、动漫、卡通、动画、COSPLAY、漫画、音乐、娱乐信息、影视")) return "18230";
            if (isContain(summary, "游戏、电竞") && isNotContain(summary, "服饰")) return "18220";
            if (isContain(summary, "俱乐部、夜总会、会所")) return "1812A";
            if (isContain(accountName, "18121")) return "18121";
            if (isContain(accountName, "酒吧、休闲吧、休闲会所")) return "18121";
            if (isContain(summary, "娱乐、休闲")) return "18000";
            if (isInLibiary(summary, new String[]{"16420-1"})) return "16420";
            if (isContain(accountName, "16400") && isEqual(borrowFlage, 1)) return "16400";
            if (isInLibiary(summary, new String[]{"16400"})) return "16400";
            if (isContain(accountName, "物流")) return "16330";
            if (isContain(summary, "快递费")) return "16320";
            if (isContain(accountName, "16320")) return "16320";
            if (isContain(summary, "供应链")) return "16300";
            if (isContain(accountName, "免税")) return "16241";
            if (isContain(summary, "专卖、专售")) return "16220";
            if (isContain(summary, "市场")) return "16210";
            if (isContain(summary, "国美")) return "16200";
            if (isContain(summary, "商场、百货、卖场")) return "16200";
            if (isContain(summary, "便利")) return "16120";
            if (isContain(summary, "物美") && isNotContain(summary, "宠物、便利、店")) return "16110";
            if (isContain(summary, "商贸、营业、购物、步行街、商店、贸易")) return "16000";
            if (isContain(summary, "云缴费") && isNotContain(summary, "银行")) return "15410";
            if (isContain(summary, "网费")) return "15200";
            if (isEndWith(summary, "联通、移动、电信")) return "15110";
            if (isContain(accountName, "14460")) return "14460";
            if (isContain(accountName, "旅游、旅行社")) return "14450";
            if (isContain(summary, "客运")) return "14430";
            if (isContain(summary, "旅行")) return "14400";
            if (isContain(summary, "交警")) return "142A0";
            if (isInLibiary(summary, new String[]{"14261"})) return "14261";
            if (isContain(summary, "油款")) return "14260";
            if (isContain(summary, "车款") && isEqual(borrowFlage, 1)) return "14210";
            if (isContain(summary, "买、购") && isContain(summary, "车")) return "14210";
            if (isContain(summary, "车费")) return "14120";
            if (isContain(summary, "出行")) return "14000";
            if (isInLibiary(summary, new String[]{"13220"})) return "13220";
            if (isContain(accountName, "置业、房地产")) return "13212";
            if (isContain(summary, "杂货")) return "13131";
            if (isContain(summary, "五金、工具")) return "13122";
            if (isContain(summary, "家居")) return "13112";
            if (isContain(summary, "家私、家电")) return "13110";
            if (isContain(summary, "家居")) return "13100";
            if (isContain(accountName, "美容") && isContain(accountName, "医院、医疗")) return "12230";
            if (isContain(accountName, "整形、整容")) return "12230";
            if (isContain(summary, "化妆品、美妆")) return "12210";
            if (isContain(summary, "鞋")) return "12140";
            if (isContain(accountName, "12132")) return "12132";
            if (isContain(accountName, "钟表、钟表、腕表")) return "12132";
            if (isContain(accountName, "12131-2")) return "12131";
            if (isContain(summary, "精品店")) return "12130";
            if (isContain(summary, "钱包")) return "12120";
            if (isInLibiary(summary, new String[]{"12100"})) return "12100";
            if (isContain(summary, "烟") && isContain(summary, "酒")) return "11300";
            if (isInLibiary(summary, new String[]{"11240"})) return "11240";
            if (isContain(accountName, "食品、农副产品")) return "11200";
            if (isContain(summary, "食品、农副产品")) return "11200";
            if (isContain(summary, "自助") && isNotContain(summary, "金融")) return "11160";
            if (isContain(summary, "卤")) return "11144";
            if (isContain(summary, "小店、收银台")) return "11140";
            if (isContain(summary, "料理")) return "11131";
            if (isContain(accountName, "11100")) return "11100";

            //===========================================================================================================================================
            //                                                        todo 处理5优先级
            //===========================================================================================================================================
            if (!currencyCode.equals("01")) return "93000";
            if (isContain(summary, accountName) && !accountName.equals(accountChinessName)) return "72000";


            if (isContain(summary, "网上支付、二维码消费、银联无卡、银联有卡、网络支付、银联消费")) return "10000";
            if (isContain(summary, "往来、来往")) return "91000";
            if (isContain(summary, "银行、分行、支行") && isEqual(borrowFlage, 0)) return "76100";
            if (isContain(accountName, "银行、分行、支行") && isEqual(borrowFlage, 0)) return "76100";
            if (isInLibiary(summary, new String[]{"74000"})) return "74000";
            if (isContain(summary, "转账、汇款、汇入")) return "72000";
            if (isContain(summary, "转账、汇款") && isNotContain(summary, "跨行") && isStartWithLibiary(account, "00001"))
                return "71000";
            if (isKeywordEqual(summary, "转账、转款、转入、转出")) return "70000";
            if (isContain(summary, "转") && isContain(summary, "账") && isNotContain(summary, "转账")) return "70000";
            if (isContain(summary, "按揭")) return "64100";
            if (isContain(summary, "融资")) return "60000";
            if (isContain(summary, "理财")) return "52100";
            if (isStartWith(summary, "EB") && isContain(summary, "赎回")) return "51202";
            if (isContain(summary, "年终")) return "32000";
            if (isContain(summary, "工") && isContain(summary, "资")) return "31000";
            if (isInLibiary(summary, new String[]{"30000"}) && isEqual(borrowFlage, 0)) return "30000";
            if (isContain(summary, "POS")) return "22400";
            if (isContain(accountName, "22400") && isEqual(borrowFlage, 0)) return "22400";
            if (isContain(summary, "支付") && isEqual(borrowFlage, 0)) return "22100";
            if (isContain(summary, "服务费、非税缴费")) return "21800";
            if (isInLibiary(summary, new String[]{"30000"}) && isEqual(borrowFlage, 1)) return "21710";
            if (isContain(summary, "商盟、商务咨询")) return "20000";
            if (isContain(accountName, "商务服务、商务咨询")) return "20000";
            if (isInLibiary(summary, new String[]{"17100-1"})) return "17100";
            if (isContain(summary, "缴费")) return "15400";
            if (isContain(summary, "支付、消费、付款") && isEqual(borrowFlage, 1)) return "10000";
            //===========================================================================================================================================
            //                                                        todo 处理6优先级
            //===========================================================================================================================================
        } catch (Exception e) {
            e.printStackTrace();
            //出错或者未匹配返回 -1
            return "-1";
        }
        return "-1";
    }

    //以*开头
    public boolean isStartWith(String keyWord, String target) {
        String[] arr = target.split("、");
        for (String s : arr) {
            if (keyWord.startsWith(s)) return true;
        }
        return false;
    }

    //以*结尾
    public boolean isEndWith(String keyWord, String target) {
        String[] arr = target.split("、");
        for (String s : arr) {
            if (keyWord.endsWith(s)) return true;
        }
        return false;
    }

    //以词库编码中的词开始
    public boolean isStartWithLibiary(String keyWord, String target) {
        String[] arr = target.split("、");
        for (String key : arr) {
            String words = map.get(key);
            String[] wordArr = words.split(",");
            for (String word : wordArr) {
                if (keyWord.startsWith(word)) return true;
            }
        }
        return false;
    }

    //关键字相同
    public boolean isKeywordEqual(String keyWord, String target) {
        String[] arr = target.split("、");
        for (String s : arr) {
            if (keyWord.equals(s)) return true;
        }
        return false;
    }

    //判断数值类型是否相等
    public boolean isEqual(String keyWord, int value) {
        try {
            int i = Integer.parseInt(keyWord);
            return i == value;
        } catch (NumberFormatException e) {
//            e.printStackTrace();
            return false;
        }
    }

    //包含多个条件时 例如 "烟、酒、茶"
    //只要有一个符合就返回true
    public boolean isContain(String keyWord, String conditions) {
        String[] str = conditions.split("、");
        for (String condition : str) {
            if (keyWord.contains(condition)) return true;
        }
        return false;
    }

    // 不包含关键词
    //全部不符合返回true
    public boolean isNotContain(String keyWord, String conditions) {
        String[] str = conditions.split("、");
        for (String condition : str) {
            if (keyWord.contains(condition)) return false;
        }
        return true;
    }

    //目前只有一个比较是 TransactionAmount< 0的条件
    public boolean isLessThanTransactionAmount(String transactionAmount, int value) {
        try {
            return Integer.parseInt(transactionAmount) < value;
        } catch (NumberFormatException e) {
//            e.printStackTrace();
            return false;
        }
    }

    //从分类规则中找对应的关系，并判断是否包含
    //只要有一个符合就返回true
    public boolean isInLibiary(String keyWord, String[] arr) {
        for (String code : arr) {
            String str = map.get(code);
            if (str != null) {
                String[] events = str.split(",");
                for (String event : events) {
                    if (StringUtils.isNotEmpty(event) && keyWord.contains(event)) {
//                        System.out.println("匹配到的关键字为：     " + event);
                        return true;
                    }
                }
            }
        }
        return false;
    }


}
